/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_AC97C_SR_CBEVT_OFFSET                                   4
#define AVR32_AC97C_SR_CBEVT_SIZE                                     1
#define AVR32_AC97C_SR_COEVT                                          2
#define AVR32_AC97C_SR_COEVT_MASK                            0x00000004
#define AVR32_AC97C_SR_COEVT_OFFSET                                   2
#define AVR32_AC97C_SR_COEVT_SIZE                                     1
#define AVR32_AC97C_SR_SOF                                            0
#define AVR32_AC97C_SR_SOF_MASK                              0x00000001
#define AVR32_AC97C_SR_SOF_OFFSET                                     0
#define AVR32_AC97C_SR_SOF_SIZE                                       1
#define AVR32_AC97C_SR_WKUP                                           1
#define AVR32_AC97C_SR_WKUP_MASK                             0x00000002
#define AVR32_AC97C_SR_WKUP_OFFSET                                    1
#define AVR32_AC97C_SR_WKUP_SIZE                                      1
#define AVR32_AC97C_TDATA                                             0
#define AVR32_AC97C_TDATA_MASK                               0x000fffff
#define AVR32_AC97C_TDATA_OFFSET                                      0
#define AVR32_AC97C_TDATA_SIZE                                       20
#define AVR32_AC97C_TXEMPTY                                           1
#define AVR32_AC97C_TXEMPTY_MASK                             0x00000002
#define AVR32_AC97C_TXEMPTY_OFFSET                                    1
#define AVR32_AC97C_TXEMPTY_SIZE                                      1
#define AVR32_AC97C_TXRDY                                             0
#define AVR32_AC97C_TXRDY_MASK                               0x00000001
#define AVR32_AC97C_TXRDY_OFFSET                                      0
#define AVR32_AC97C_TXRDY_SIZE                                        1
#define AVR32_AC97C_UNRUN                                             2
#define AVR32_AC97C_UNRUN_MASK                               0x00000004
#define AVR32_AC97C_UNRUN_OFFSET                                      2
#define AVR32_AC97C_UNRUN_SIZE                                        1
#define AVR32_AC97C_VRA                                               2
#define AVR32_AC97C_VRA_MASK                                 0x00000004
#define AVR32_AC97C_VRA_OFFSET                                        2
#define AVR32_AC97C_VRA_SIZE                                          1
#define AVR32_AC97C_WKUP                                              1
#define AVR32_AC97C_WKUP_MASK                                0x00000002
#define AVR32_AC97C_WKUP_OFFSET                                       1
#define AVR32_AC97C_WKUP_SIZE                                         1
#define AVR32_AC97C_WRST                                              1
#define AVR32_AC97C_WRST_MASK                                0x00000002
#define AVR32_AC97C_WRST_OFFSET                                       1
#define AVR32_AC97C_WRST_SIZE                                         1




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_ac97c_mr_t {
    unsigned int                 :29;
    unsigned int vra             : 1;
    unsigned int wrst            : 1;
    unsigned int ena             : 1;
} avr32_ac97c_mr_t;



typedef struct avr32_ac97c_ica_t {
    unsigned int                 : 2;
    unsigned int chid12          : 3;
    unsigned int chid11          : 3;
    unsigned int chid10          : 3;
    unsigned int chid9           : 3;
    unsigned int chid8           : 3;
    unsigned int chid7           : 3;
    unsigned int chid6           : 3;
    unsigned int chid5           : 3;
    unsigned int chid4           : 3;
    unsigned int chid3           : 3;
} avr32_ac97c_ica_t;



typedef struct avr32_ac97c_oca_t {
    unsigned int                 : 2;
    unsigned int chid12          : 3;
    unsigned int chid11          : 3;
    unsigned int chid10          : 3;
    unsigned int chid9           : 3;
    unsigned int chid8           : 3;
    unsigned int chid7           : 3;
    unsigned int chid6           : 3;
    unsigned int chid5           : 3;
    unsigned int chid4           : 3;
    unsigned int chid3           : 3;
} avr32_ac97c_oca_t;



typedef struct avr32_ac97c_carhr_t {
    unsigned int                 :12;
    unsigned int rdata           :20;
} avr32_ac97c_carhr_t;



typedef struct avr32_ac97c_cathr_t {
    unsigned int                 :12;
    unsigned int tdata           :20;
} avr32_ac97c_cathr_t;



typedef struct avr32_ac97c_casr_t {
    unsigned int                 :26;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 1;
    unsigned int unrun           : 1;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ac97c_casr_t;



typedef struct avr32_ac97c_camr_t {
    unsigned int                 : 9;
    unsigned int dmaen           : 1;
    unsigned int cen             : 1;
    unsigned int                 : 2;
    unsigned int cem             : 1;
    unsigned int size            : 2;
    unsigned int                 :10;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 1;
    unsigned int unrun           : 1;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ac97c_camr_t;



typedef struct avr32_ac97c_cbrhr_t {
    unsigned int                 :12;
    unsigned int rdata           :20;
} avr32_ac97c_cbrhr_t;



typedef struct avr32_ac97c_cbthr_t {
    unsigned int                 :12;
    unsigned int tdata           :20;
} avr32_ac97c_cbthr_t;



typedef struct avr32_ac97c_cbsr_t {
    unsigned int                 :26;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 1;
    unsigned int unrun           : 1;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ac97c_cbsr_t;



typedef struct avr32_ac97c_cbmr_t {
    unsigned int                 : 9;
    unsigned int dmaen           : 1;
    unsigned int cen             : 1;
    unsigned int                 : 2;
    unsigned int cem             : 1;
    unsigned int size            : 2;
    unsigned int                 :10;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 1;
    unsigned int unrun           : 1;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ac97c_cbmr_t;



typedef struct avr32_ac97c_corhr_t {
    unsigned int                 :16;
    unsigned int sdata           :16;
} avr32_ac97c_corhr_t;



typedef struct avr32_ac97c_cothr_t {
    unsigned int                 : 8;
    unsigned int read            : 1;
    unsigned int caddr           : 7;
    unsigned int cdata           :16;
} avr32_ac97c_cothr_t;



typedef struct avr32_ac97c_cosr_t {
    unsigned int                 :26;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 2;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ac97c_cosr_t;



typedef struct avr32_ac97c_comr_t {
    unsigned int                 :26;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 2;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ac97c_comr_t;



typedef struct avr32_ac97c_sr_t {
    unsigned int                 :27;
    unsigned int cbevt           : 1;
    unsigned int caevt           : 1;
    unsigned int coevt           : 1;
    unsigned int wkup            : 1;
    unsigned int sof             : 1;
} avr32_ac97c_sr_t;



typedef struct avr32_ac97c_ier_t {
    unsigned int                 :27;
    unsigned int cbevt           : 1;
    unsigned int caevt           : 1;
    unsigned int coevt           : 1;
    unsigned int wkup            : 1;
    unsigned int sof             : 1;
} avr32_ac97c_ier_t;



typedef struct avr32_ac97c_idr_t {
    unsigned int                 :27;
    unsigned int cbevt           : 1;
    unsigned int caevt           : 1;
    unsigned int coevt           : 1;
    unsigned int wkup            : 1;
    unsigned int sof             : 1;
} avr32_ac97c_idr_t;



typedef struct avr32_ac97c_imr_t {
    unsigned int                 :27;
    unsigned int cbevt           : 1;
    unsigned int caevt           : 1;
    unsigned int coevt           : 1;
    unsigned int wkup            : 1;
    unsigned int sof             : 1;
} avr32_ac97c_imr_t;



typedef struct avr32_ac97c_t {
          unsigned int                   :32       ;//0x0000
          unsigned int                   :32       ;//0x0004
  union {
          unsigned long                  mr        ;//0x0008
          avr32_ac97c_mr_t               MR        ;
  };
          unsigned int                   :32       ;//0x000c
  union {
          unsigned long                  ica       ;//0x0010
          avr32_ac97c_ica_t              ICA       ;
  };
  union {
          unsigned long                  oca       ;//0x0014
          avr32_ac97c_oca_t              OCA       ;
  };
          unsigned int                   :32       ;//0x0018
          unsigned int                   :32       ;//0x001c
  union {
    const unsigned long                  carhr     ;//0x0020
    const avr32_ac97c_carhr_t            CARHR     ;
  };
  union {
          unsigned long                  cathr     ;//0x0024
          avr32_ac97c_cathr_t            CATHR     ;
  };
  union {
    const unsigned long                  casr      ;//0x0028
    const avr32_ac97c_casr_t             CASR      ;
  };
  union {
          unsigned long                  camr      ;//0x002c
          avr32_ac97c_camr_t             CAMR      ;
  };
  union {
    const unsigned long                  cbrhr     ;//0x0030
    const avr32_ac97c_cbrhr_t            CBRHR     ;
  };
  union {
          unsigned long                  cbthr     ;//0x0034
          avr32_ac97c_cbthr_t            CBTHR     ;
  };
  union {
    const unsigned long                  cbsr      ;//0x0038
    const avr32_ac97c_cbsr_t             CBSR      ;
  };
  union {
          unsigned long                  cbmr      ;//0x003c
          avr32_ac97c_cbmr_t             CBMR      ;
  };
  union {
    const unsigned long                  corhr     ;//0x0040
    const avr32_ac97c_corhr_t            CORHR     ;
  };
  union {
          unsigned long                  cothr     ;//0x0044
          avr32_ac97c_cothr_t            COTHR     ;
  };
  union {
    const unsigned long                  cosr      ;//0x0048
    const avr32_ac97c_cosr_t             COSR      ;
  };
  union {
          unsigned long                  comr      ;//0x004c
          avr32_ac97c_comr_t             COMR      ;
  };
  union {
    const unsigned long                  sr        ;//0x0050
    const avr32_ac97c_sr_t               SR        ;
  };
  union {
          unsigned long                  ier       ;//0x0054
          avr32_ac97c_ier_t              IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0058
          avr32_ac97c_idr_t              IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x005c
    const avr32_ac97c_imr_t              IMR       ;
  };
} avr32_ac97c_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_AC97C_210_H_INCLUDED*/
#endif

