/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_ACIFA_VERSION_VARIANT_OFFSET                           16
#define AVR32_ACIFA_VERSION_VARIANT_SIZE                              4
#define AVR32_ACIFA_VERSION_VERSION                                   0
#define AVR32_ACIFA_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_ACIFA_VERSION_VERSION_OFFSET                            0
#define AVR32_ACIFA_VERSION_VERSION_SIZE                             12
#define AVR32_ACIFA_WCONF                                    0x00000008
#define AVR32_ACIFA_WCONF_MASK                               0x00000f03
#define AVR32_ACIFA_WCONF_RESETVALUE                         0x00000000
#define AVR32_ACIFA_WCONF_WINSEL                                      8
#define AVR32_ACIFA_WCONF_WINSEL_MASK                        0x00000f00
#define AVR32_ACIFA_WCONF_WINSEL_OFFSET                               8
#define AVR32_ACIFA_WCONF_WINSEL_SIZE                                 4
#define AVR32_ACIFA_WCONF_WIS                                         0
#define AVR32_ACIFA_WCONF_WIS_MASK                           0x00000003
#define AVR32_ACIFA_WCONF_WIS_OFFSET                                  0
#define AVR32_ACIFA_WCONF_WIS_SIZE                                    2
#define AVR32_ACIFA_WFCS                                             18
#define AVR32_ACIFA_WFCS_MASK                                0x00040000
#define AVR32_ACIFA_WFCS_OFFSET                                      18
#define AVR32_ACIFA_WFCS_SIZE                                         1
#define AVR32_ACIFA_WFDIS                                             2
#define AVR32_ACIFA_WFDIS_MASK                               0x00000004
#define AVR32_ACIFA_WFDIS_OFFSET                                      2
#define AVR32_ACIFA_WFDIS_SIZE                                        1
#define AVR32_ACIFA_WFEN_SIZE                                         1
#define AVR32_ACIFA_WFINT                                             2
#define AVR32_ACIFA_WFINT_MASK                               0x00000004
#define AVR32_ACIFA_WFINT_OFFSET                                      2
#define AVR32_ACIFA_WFINT_SIZE                                        1
#define AVR32_ACIFA_WFRDY                                            26
#define AVR32_ACIFA_WFRDY_MASK                               0x04000000
#define AVR32_ACIFA_WFRDY_OFFSET                                     26
#define AVR32_ACIFA_WFRDY_SIZE                                        1
#define AVR32_ACIFA_WINSEL                                            8
#define AVR32_ACIFA_WINSEL_MASK                              0x00000f00
#define AVR32_ACIFA_WINSEL_OFFSET                                     8
#define AVR32_ACIFA_WINSEL_SIZE                                       4
#define AVR32_ACIFA_WIS                                               0
#define AVR32_ACIFA_WIS_MASK                                 0x00000003
#define AVR32_ACIFA_WIS_OFFSET                                        0
#define AVR32_ACIFA_WIS_SIZE                                          2




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_acifa_confa_t {
    unsigned int oen             : 1;
    unsigned int                 : 2;
    unsigned int ss              : 1;
    unsigned int                 : 2;
    unsigned int hs              : 2;
    unsigned int                 : 4;
    unsigned int inseln          : 4;
    unsigned int                 : 4;
    unsigned int inselp          : 4;
    unsigned int                 : 6;
    unsigned int is              : 2;
} avr32_acifa_confa_t;



typedef struct avr32_acifa_confb_t {
    unsigned int oen             : 1;
    unsigned int                 : 2;
    unsigned int ss              : 1;
    unsigned int                 : 2;
    unsigned int hs              : 2;
    unsigned int                 : 4;
    unsigned int inseln          : 4;
    unsigned int                 : 4;
    unsigned int inselp          : 4;
    unsigned int                 : 6;
    unsigned int is              : 2;
} avr32_acifa_confb_t;



typedef struct avr32_acifa_wconf_t {
    unsigned int                 :20;
    unsigned int winsel          : 4;
    unsigned int                 : 6;
    unsigned int wis             : 2;
} avr32_acifa_wconf_t;



typedef struct avr32_acifa_evsrc0_t {
    unsigned int                 :28;
    unsigned int evsrc           : 4;
} avr32_acifa_evsrc0_t;



typedef struct avr32_acifa_evsrc1_t {
    unsigned int                 :28;
    unsigned int evsrc           : 4;
} avr32_acifa_evsrc1_t;



typedef struct avr32_acifa_scfa_t {
    unsigned int                 :25;
    unsigned int en              : 1;
    unsigned int scalefactor     : 6;
} avr32_acifa_scfa_t;



typedef struct avr32_acifa_scfb_t {
    unsigned int                 :25;
    unsigned int en              : 1;
    unsigned int scalefactor     : 6;
} avr32_acifa_scfb_t;



typedef struct avr32_acifa_en_t {
    unsigned int                 :27;
    unsigned int acbcpen         : 1;
    unsigned int acacpen         : 1;
    unsigned int wfen            : 1;
    unsigned int acben           : 1;
    unsigned int acaen           : 1;
} avr32_acifa_en_t;



typedef struct avr32_acifa_dis_t {
    unsigned int                 :27;
    unsigned int acbcpdis        : 1;
    unsigned int acacpdis        : 1;
    unsigned int wfdis           : 1;
    unsigned int acbdis          : 1;
    unsigned int acadis          : 1;
} avr32_acifa_dis_t;



typedef struct avr32_acifa_sut_t {
    unsigned int                 :16;
    unsigned int sut             :16;
} avr32_acifa_sut_t;



typedef struct avr32_acifa_ier_t {
    unsigned int                 :27;
    unsigned int sutbint         : 1;
    unsigned int sutaint         : 1;
    unsigned int wfint           : 1;
    unsigned int acbint          : 1;
    unsigned int acaint          : 1;
} avr32_acifa_ier_t;



typedef struct avr32_acifa_idr_t {
    unsigned int                 :27;
    unsigned int sutbint         : 1;
    unsigned int sutaint         : 1;
    unsigned int wfint           : 1;
    unsigned int acbint          : 1;
    unsigned int acaint          : 1;
} avr32_acifa_idr_t;



typedef struct avr32_acifa_imr_t {
    unsigned int                 :27;
    unsigned int sutbint         : 1;
    unsigned int sutaint         : 1;
    unsigned int wfint           : 1;
    unsigned int acbint          : 1;
    unsigned int acaint          : 1;
} avr32_acifa_imr_t;



typedef struct avr32_acifa_eve_t {
    unsigned int                 :30;
    unsigned int acev1           : 1;
    unsigned int acev0           : 1;
} avr32_acifa_eve_t;



typedef struct avr32_acifa_evd_t {
    unsigned int                 :30;
    unsigned int acev1           : 1;
    unsigned int acev0           : 1;
} avr32_acifa_evd_t;



typedef struct avr32_acifa_evm_t {
    unsigned int                 :30;
    unsigned int acev1           : 1;
    unsigned int acev0           : 1;
} avr32_acifa_evm_t;



typedef struct avr32_acifa_sr_t {
    unsigned int                 : 5;
    unsigned int wfrdy           : 1;
    unsigned int acbrdy          : 1;
    unsigned int acardy          : 1;
    unsigned int                 : 5;
    unsigned int wfcs            : 1;
    unsigned int acbcs           : 1;
    unsigned int acacs           : 1;
    unsigned int                 : 3;
    unsigned int acbcpen         : 1;
    unsigned int acacpen         : 1;
    unsigned int wfen            : 1;
    unsigned int acben           : 1;
    unsigned int acaen           : 1;
    unsigned int                 : 3;
    unsigned int sutbint         : 1;
    unsigned int sutaint         : 1;
    unsigned int wfint           : 1;
    unsigned int acbint          : 1;
    unsigned int acaint          : 1;
} avr32_acifa_sr_t;



typedef struct avr32_acifa_scr_t {
    unsigned int                 :27;
    unsigned int sutbint         : 1;
    unsigned int sutaint         : 1;
    unsigned int wfint           : 1;
    unsigned int acbint          : 1;
    unsigned int acaint          : 1;
} avr32_acifa_scr_t;



typedef struct avr32_acifa_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_acifa_version_t;



typedef struct avr32_acifa_parameter_t {
    unsigned int                 :16;
    unsigned int mux4_inputs_nb  : 4;
    unsigned int mux3_inputs_nb  : 4;
    unsigned int mux2_inputs_nb  : 4;
    unsigned int mux1_inputs_nb  : 4;
} avr32_acifa_parameter_t;



typedef struct avr32_acifa_t {
  union {
          unsigned long                  confa     ;//0x0000
          avr32_acifa_confa_t            CONFA     ;
  };
  union {
          unsigned long                  confb     ;//0x0004
          avr32_acifa_confb_t            CONFB     ;
  };
  union {
          unsigned long                  wconf     ;//0x0008
          avr32_acifa_wconf_t            WCONF     ;
  };
  union {
          unsigned long                  evsrc0    ;//0x000c
          avr32_acifa_evsrc0_t           EVSRC0    ;
  };
  union {
          unsigned long                  evsrc1    ;//0x0010
          avr32_acifa_evsrc1_t           EVSRC1    ;
  };
  union {
          unsigned long                  scfa      ;//0x0014
          avr32_acifa_scfa_t             SCFA      ;
  };
  union {
          unsigned long                  scfb      ;//0x0018
          avr32_acifa_scfb_t             SCFB      ;
  };
  union {
          unsigned long                  en        ;//0x001c
          avr32_acifa_en_t               EN        ;
  };
  union {
          unsigned long                  dis       ;//0x0020
          avr32_acifa_dis_t              DIS       ;
  };
  union {
          unsigned long                  sut       ;//0x0024
          avr32_acifa_sut_t              SUT       ;
  };
  union {
          unsigned long                  ier       ;//0x0028
          avr32_acifa_ier_t              IER       ;
  };
  union {
          unsigned long                  idr       ;//0x002c
          avr32_acifa_idr_t              IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0030
    const avr32_acifa_imr_t              IMR       ;
  };
  union {
          unsigned long                  eve       ;//0x0034
          avr32_acifa_eve_t              EVE       ;
  };
  union {
          unsigned long                  evd       ;//0x0038
          avr32_acifa_evd_t              EVD       ;
  };
  union {
    const unsigned long                  evm       ;//0x003c
    const avr32_acifa_evm_t              EVM       ;
  };
  union {
    const unsigned long                  sr        ;//0x0040
    const avr32_acifa_sr_t               SR        ;
  };
  union {
          unsigned long                  scr       ;//0x0044
          avr32_acifa_scr_t              SCR       ;
  };
  union {
    const unsigned long                  version   ;//0x0048
    const avr32_acifa_version_t          VERSION   ;
  };
  union {
    const unsigned long                  parameter ;//0x004c
    const avr32_acifa_parameter_t        PARAMETER ;
  };
} avr32_acifa_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_ACIFA_100_H_INCLUDED*/
#endif

