/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_ACIFB_WFCS3_OFFSET                                     27
#define AVR32_ACIFB_WFCS3_SIZE                                        1
#define AVR32_ACIFB_WFEN                                             16
#define AVR32_ACIFB_WFEN_MASK                                0x00010000
#define AVR32_ACIFB_WFEN_OFFSET                                      16
#define AVR32_ACIFB_WFEN_SIZE                                         1
#define AVR32_ACIFB_WFINT0                                           24
#define AVR32_ACIFB_WFINT0_MASK                              0x01000000
#define AVR32_ACIFB_WFINT0_OFFSET                                    24
#define AVR32_ACIFB_WFINT0_SIZE                                       1
#define AVR32_ACIFB_WFINT1                                           25
#define AVR32_ACIFB_WFINT1_MASK                              0x02000000
#define AVR32_ACIFB_WFINT1_OFFSET                                    25
#define AVR32_ACIFB_WFINT1_SIZE                                       1
#define AVR32_ACIFB_WFINT2                                           26
#define AVR32_ACIFB_WFINT2_MASK                              0x04000000
#define AVR32_ACIFB_WFINT2_OFFSET                                    26
#define AVR32_ACIFB_WFINT2_SIZE                                       1
#define AVR32_ACIFB_WFINT3                                           27
#define AVR32_ACIFB_WFINT3_MASK                              0x08000000
#define AVR32_ACIFB_WFINT3_OFFSET                                    27
#define AVR32_ACIFB_WFINT3_SIZE                                       1
#define AVR32_ACIFB_WIMPL0                                           16
#define AVR32_ACIFB_WIMPL0_MASK                              0x00010000
#define AVR32_ACIFB_WIMPL0_OFFSET                                    16
#define AVR32_ACIFB_WIMPL0_SIZE                                       1
#define AVR32_ACIFB_WIMPL1                                           17
#define AVR32_ACIFB_WIMPL1_MASK                              0x00020000
#define AVR32_ACIFB_WIMPL1_OFFSET                                    17
#define AVR32_ACIFB_WIMPL1_SIZE                                       1
#define AVR32_ACIFB_WIMPL2                                           18
#define AVR32_ACIFB_WIMPL2_MASK                              0x00040000
#define AVR32_ACIFB_WIMPL2_OFFSET                                    18
#define AVR32_ACIFB_WIMPL2_SIZE                                       1
#define AVR32_ACIFB_WIMPL3                                           19
#define AVR32_ACIFB_WIMPL3_MASK                              0x00080000
#define AVR32_ACIFB_WIMPL3_OFFSET                                    19
#define AVR32_ACIFB_WIMPL3_SIZE                                       1
#define AVR32_ACIFB_WIS                                               0
#define AVR32_ACIFB_WIS_MASK                                 0x00000003
#define AVR32_ACIFB_WIS_OFFSET                                        0
#define AVR32_ACIFB_WIS_SIZE                                          2




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_acifb_ctrl_t {
    unsigned int                 :14;
    unsigned int sut             :10;
    unsigned int actest          : 1;
    unsigned int                 : 1;
    unsigned int estart          : 1;
    unsigned int ustart          : 1;
    unsigned int                 : 2;
    unsigned int eventen         : 1;
    unsigned int en              : 1;
} avr32_acifb_ctrl_t;



typedef struct avr32_acifb_sr_t {
    unsigned int                 : 4;
    unsigned int wfcs3           : 1;
    unsigned int wfcs2           : 1;
    unsigned int wfcs1           : 1;
    unsigned int wfcs0           : 1;
    unsigned int                 : 8;
    unsigned int acrdy7          : 1;
    unsigned int accs7           : 1;
    unsigned int acrdy6          : 1;
    unsigned int accs6           : 1;
    unsigned int acrdy5          : 1;
    unsigned int accs5           : 1;
    unsigned int acrdy4          : 1;
    unsigned int accs4           : 1;
    unsigned int acrdy3          : 1;
    unsigned int accs3           : 1;
    unsigned int acrdy2          : 1;
    unsigned int accs2           : 1;
    unsigned int acrdy1          : 1;
    unsigned int accs1           : 1;
    unsigned int acrdy0          : 1;
    unsigned int accs0           : 1;
} avr32_acifb_sr_t;



typedef struct avr32_acifb_ier_t {
    unsigned int                 : 4;
    unsigned int wfint3          : 1;
    unsigned int wfint2          : 1;
    unsigned int wfint1          : 1;
    unsigned int wfint0          : 1;
    unsigned int                 : 8;
    unsigned int sutint7         : 1;
    unsigned int acint7          : 1;
    unsigned int sutint6         : 1;
    unsigned int acint6          : 1;
    unsigned int sutint5         : 1;
    unsigned int acint5          : 1;
    unsigned int sutint4         : 1;
    unsigned int acint4          : 1;
    unsigned int sutint3         : 1;
    unsigned int acint3          : 1;
    unsigned int sutint2         : 1;
    unsigned int acint2          : 1;
    unsigned int sutint1         : 1;
    unsigned int acint1          : 1;
    unsigned int sutint0         : 1;
    unsigned int acint0          : 1;
} avr32_acifb_ier_t;



typedef struct avr32_acifb_idr_t {
    unsigned int                 : 4;
    unsigned int wfint3          : 1;
    unsigned int wfint2          : 1;
    unsigned int wfint1          : 1;
    unsigned int wfint0          : 1;
    unsigned int                 : 8;
    unsigned int sutint7         : 1;
    unsigned int acint7          : 1;
    unsigned int sutint6         : 1;
    unsigned int acint6          : 1;
    unsigned int sutint5         : 1;
    unsigned int acint5          : 1;
    unsigned int sutint4         : 1;
    unsigned int acint4          : 1;
    unsigned int sutint3         : 1;
    unsigned int acint3          : 1;
    unsigned int sutint2         : 1;
    unsigned int acint2          : 1;
    unsigned int sutint1         : 1;
    unsigned int acint1          : 1;
    unsigned int sutint0         : 1;
    unsigned int acint0          : 1;
} avr32_acifb_idr_t;



typedef struct avr32_acifb_imr_t {
    unsigned int                 : 4;
    unsigned int wfint3          : 1;
    unsigned int wfint2          : 1;
    unsigned int wfint1          : 1;
    unsigned int wfint0          : 1;
    unsigned int                 : 8;
    unsigned int sutint7         : 1;
    unsigned int acint7          : 1;
    unsigned int sutint6         : 1;
    unsigned int acint6          : 1;
    unsigned int sutint5         : 1;
    unsigned int acint5          : 1;
    unsigned int sutint4         : 1;
    unsigned int acint4          : 1;
    unsigned int sutint3         : 1;
    unsigned int acint3          : 1;
    unsigned int sutint2         : 1;
    unsigned int acint2          : 1;
    unsigned int sutint1         : 1;
    unsigned int acint1          : 1;
    unsigned int sutint0         : 1;
    unsigned int acint0          : 1;
} avr32_acifb_imr_t;



typedef struct avr32_acifb_isr_t {
    unsigned int                 : 4;
    unsigned int wfint3          : 1;
    unsigned int wfint2          : 1;
    unsigned int wfint1          : 1;
    unsigned int wfint0          : 1;
    unsigned int                 : 8;
    unsigned int sutint7         : 1;
    unsigned int acint7          : 1;
    unsigned int sutint6         : 1;
    unsigned int acint6          : 1;
    unsigned int sutint5         : 1;
    unsigned int acint5          : 1;
    unsigned int sutint4         : 1;
    unsigned int acint4          : 1;
    unsigned int sutint3         : 1;
    unsigned int acint3          : 1;
    unsigned int sutint2         : 1;
    unsigned int acint2          : 1;
    unsigned int sutint1         : 1;
    unsigned int acint1          : 1;
    unsigned int sutint0         : 1;
    unsigned int acint0          : 1;
} avr32_acifb_isr_t;



typedef struct avr32_acifb_icr_t {
    unsigned int                 : 4;
    unsigned int wfint3          : 1;
    unsigned int wfint2          : 1;
    unsigned int wfint1          : 1;
    unsigned int wfint0          : 1;
    unsigned int                 : 8;
    unsigned int sutint7         : 1;
    unsigned int acint7          : 1;
    unsigned int sutint6         : 1;
    unsigned int acint6          : 1;
    unsigned int sutint5         : 1;
    unsigned int acint5          : 1;
    unsigned int sutint4         : 1;
    unsigned int acint4          : 1;
    unsigned int sutint3         : 1;
    unsigned int acint3          : 1;
    unsigned int sutint2         : 1;
    unsigned int acint2          : 1;
    unsigned int sutint1         : 1;
    unsigned int acint1          : 1;
    unsigned int sutint0         : 1;
    unsigned int acint0          : 1;
} avr32_acifb_icr_t;



typedef struct avr32_acifb_tr_t {
    unsigned int                 :24;
    unsigned int actest7         : 1;
    unsigned int actest6         : 1;
    unsigned int actest5         : 1;
    unsigned int actest4         : 1;
    unsigned int actest3         : 1;
    unsigned int actest2         : 1;
    unsigned int actest1         : 1;
    unsigned int actest0         : 1;
} avr32_acifb_tr_t;



typedef struct avr32_acifb_parameter_t {
    unsigned int                 :12;
    unsigned int wimpl3          : 1;
    unsigned int wimpl2          : 1;
    unsigned int wimpl1          : 1;
    unsigned int wimpl0          : 1;
    unsigned int                 : 8;
    unsigned int acimpl7         : 1;
    unsigned int acimlp6         : 1;
    unsigned int acimlp5         : 1;
    unsigned int acimpl4         : 1;
    unsigned int acimpl3         : 1;
    unsigned int acimpl2         : 1;
    unsigned int acimpl1         : 1;
    unsigned int acimpl0         : 1;
} avr32_acifb_parameter_t;



typedef struct avr32_acifb_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_acifb_version_t;



typedef struct avr32_acifb_confw0_t {
    unsigned int                 :15;
    unsigned int wfen            : 1;
    unsigned int                 : 5;
    unsigned int weven           : 1;
    unsigned int wevsrc          : 2;
    unsigned int                 : 6;
    unsigned int wis             : 2;
} avr32_acifb_confw0_t;



typedef struct avr32_acifb_confw1_t {
    unsigned int                 :15;
    unsigned int wfen            : 1;
    unsigned int                 : 5;
    unsigned int weven           : 1;
    unsigned int wevsrc          : 2;
    unsigned int                 : 6;
    unsigned int wis             : 2;
} avr32_acifb_confw1_t;



typedef struct avr32_acifb_confw2_t {
    unsigned int                 :15;
    unsigned int wfen            : 1;
    unsigned int                 : 5;
    unsigned int weven           : 1;
    unsigned int wevsrc          : 2;
    unsigned int                 : 6;
    unsigned int wis             : 2;
} avr32_acifb_confw2_t;



typedef struct avr32_acifb_confw3_t {
    unsigned int                 :15;
    unsigned int wfen            : 1;
    unsigned int                 : 5;
    unsigned int weven           : 1;
    unsigned int wevsrc          : 2;
    unsigned int                 : 6;
    unsigned int wis             : 2;
} avr32_acifb_confw3_t;



typedef struct avr32_acifb_conf0_t {
    unsigned int                 : 1;
    unsigned int flen            : 3;
    unsigned int hys             : 4;
    unsigned int                 : 6;
    unsigned int evenn           : 1;
    unsigned int evenp           : 1;
    unsigned int                 : 4;
    unsigned int inselp          : 2;
    unsigned int inseln          : 2;
    unsigned int                 : 2;
    unsigned int mode            : 2;
    unsigned int                 : 2;
    unsigned int is              : 2;
} avr32_acifb_conf0_t;



typedef struct avr32_acifb_conf1_t {
    unsigned int                 : 1;
    unsigned int flen            : 3;
    unsigned int hys             : 4;
    unsigned int                 : 6;
    unsigned int evenn           : 1;
    unsigned int evenp           : 1;
    unsigned int                 : 4;
    unsigned int inselp          : 2;
    unsigned int inseln          : 2;
    unsigned int                 : 2;
    unsigned int mode            : 2;
    unsigned int                 : 2;
    unsigned int is              : 2;
} avr32_acifb_conf1_t;



typedef struct avr32_acifb_conf2_t {
    unsigned int                 : 1;
    unsigned int flen            : 3;
    unsigned int hys             : 4;
    unsigned int                 : 6;
    unsigned int evenn           : 1;
    unsigned int evenp           : 1;
    unsigned int                 : 4;
    unsigned int inselp          : 2;
    unsigned int inseln          : 2;
    unsigned int                 : 2;
    unsigned int mode            : 2;
    unsigned int                 : 2;
    unsigned int is              : 2;
} avr32_acifb_conf2_t;



typedef struct avr32_acifb_conf3_t {
    unsigned int                 : 1;
    unsigned int flen            : 3;
    unsigned int hys             : 4;
    unsigned int                 : 6;
    unsigned int evenn           : 1;
    unsigned int evenp           : 1;
    unsigned int                 : 4;
    unsigned int inselp          : 2;
    unsigned int inseln          : 2;
    unsigned int                 : 2;
    unsigned int mode            : 2;
    unsigned int                 : 2;
    unsigned int is              : 2;
} avr32_acifb_conf3_t;



typedef struct avr32_acifb_conf4_t {
    unsigned int                 : 1;
    unsigned int flen            : 3;
    unsigned int hys             : 4;
    unsigned int                 : 6;
    unsigned int evenn           : 1;
    unsigned int evenp           : 1;
    unsigned int                 : 4;
    unsigned int inselp          : 2;
    unsigned int inseln          : 2;
    unsigned int                 : 2;
    unsigned int mode            : 2;
    unsigned int                 : 2;
    unsigned int is              : 2;
} avr32_acifb_conf4_t;



typedef struct avr32_acifb_conf5_t {
    unsigned int                 : 1;
    unsigned int flen            : 3;
    unsigned int hys             : 4;
    unsigned int                 : 6;
    unsigned int evenn           : 1;
    unsigned int evenp           : 1;
    unsigned int                 : 4;
    unsigned int inselp          : 2;
    unsigned int inseln          : 2;
    unsigned int                 : 3;
    unsigned int mode            : 1;
    unsigned int                 : 2;
    unsigned int is              : 2;
} avr32_acifb_conf5_t;



typedef struct avr32_acifb_conf6_t {
    unsigned int                 : 1;
    unsigned int flen            : 3;
    unsigned int hys             : 4;
    unsigned int                 : 6;
    unsigned int evenn           : 1;
    unsigned int evenp           : 1;
    unsigned int                 : 4;
    unsigned int inselp          : 2;
    unsigned int inseln          : 2;
    unsigned int                 : 2;
    unsigned int mode            : 2;
    unsigned int                 : 2;
    unsigned int is              : 2;
} avr32_acifb_conf6_t;



typedef struct avr32_acifb_conf7_t {
    unsigned int                 : 1;
    unsigned int flen            : 3;
    unsigned int hys             : 4;
    unsigned int                 : 6;
    unsigned int evenn           : 1;
    unsigned int evenp           : 1;
    unsigned int                 : 4;
    unsigned int inselp          : 2;
    unsigned int inseln          : 2;
    unsigned int                 : 2;
    unsigned int mode            : 2;
    unsigned int                 : 2;
    unsigned int is              : 2;
} avr32_acifb_conf7_t;



typedef struct avr32_acifb_t {
  union {
          unsigned long                  ctrl      ;//0x0000
          avr32_acifb_ctrl_t             CTRL      ;
  };
  union {
    const unsigned long                  sr        ;//0x0004
    const avr32_acifb_sr_t               SR        ;
  };
          unsigned int                   :32       ;//0x0008
          unsigned int                   :32       ;//0x000c
  union {
          unsigned long                  ier       ;//0x0010
          avr32_acifb_ier_t              IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0014
          avr32_acifb_idr_t              IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0018
    const avr32_acifb_imr_t              IMR       ;
  };
  union {
    const unsigned long                  isr       ;//0x001c
    const avr32_acifb_isr_t              ISR       ;
  };
  union {
          unsigned long                  icr       ;//0x0020
          avr32_acifb_icr_t              ICR       ;
  };
  union {
          unsigned long                  tr        ;//0x0024
          avr32_acifb_tr_t               TR        ;
  };
          unsigned int                   :32       ;//0x0028
          unsigned int                   :32       ;//0x002c
  union {
    const unsigned long                  parameter ;//0x0030
    const avr32_acifb_parameter_t        PARAMETER ;
  };
  union {
    const unsigned long                  version   ;//0x0034
    const avr32_acifb_version_t          VERSION   ;
  };
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
          unsigned int                   :32       ;//0x0040
          unsigned int                   :32       ;//0x0044
          unsigned int                   :32       ;//0x0048
          unsigned int                   :32       ;//0x004c
          unsigned int                   :32       ;//0x0050
          unsigned int                   :32       ;//0x0054
          unsigned int                   :32       ;//0x0058
          unsigned int                   :32       ;//0x005c
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
  union {
          unsigned long                  confw0    ;//0x0080
          avr32_acifb_confw0_t           CONFW0    ;
  };
  union {
          unsigned long                  confw1    ;//0x0084
          avr32_acifb_confw1_t           CONFW1    ;
  };
  union {
          unsigned long                  confw2    ;//0x0088
          avr32_acifb_confw2_t           CONFW2    ;
  };
  union {
          unsigned long                  confw3    ;//0x008c
          avr32_acifb_confw3_t           CONFW3    ;
  };
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
  union {
          unsigned long                  conf0     ;//0x00d0
          avr32_acifb_conf0_t            CONF0     ;
  };
  union {
          unsigned long                  conf1     ;//0x00d4
          avr32_acifb_conf1_t            CONF1     ;
  };
  union {
          unsigned long                  conf2     ;//0x00d8
          avr32_acifb_conf2_t            CONF2     ;
  };
  union {
          unsigned long                  conf3     ;//0x00dc
          avr32_acifb_conf3_t            CONF3     ;
  };
  union {
          unsigned long                  conf4     ;//0x00e0
          avr32_acifb_conf4_t            CONF4     ;
  };
  union {
          unsigned long                  conf5     ;//0x00e4
          avr32_acifb_conf5_t            CONF5     ;
  };
  union {
          unsigned long                  conf6     ;//0x00e8
          avr32_acifb_conf6_t            CONF6     ;
  };
  union {
          unsigned long                  conf7     ;//0x00ec
          avr32_acifb_conf7_t            CONF7     ;
  };
} avr32_acifb_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_ACIFB_201_H_INCLUDED*/
#endif

