/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_ADCIFB_TRGR_TRGMOD                                       0
#define AVR32_ADCIFB_TRGR_TRGMOD_CM                           0x00000006
#define AVR32_ADCIFB_TRGR_TRGMOD_ETAE                         0x00000003
#define AVR32_ADCIFB_TRGR_TRGMOD_ETFE                         0x00000002
#define AVR32_ADCIFB_TRGR_TRGMOD_ETRE                         0x00000001
#define AVR32_ADCIFB_TRGR_TRGMOD_EVT                          0x00000007
#define AVR32_ADCIFB_TRGR_TRGMOD_MASK                         0x00000007
#define AVR32_ADCIFB_TRGR_TRGMOD_NT                           0x00000000
#define AVR32_ADCIFB_TRGR_TRGMOD_OFFSET                                0
#define AVR32_ADCIFB_TRGR_TRGMOD_PDT                          0x00000004
#define AVR32_ADCIFB_TRGR_TRGMOD_PT                           0x00000005
#define AVR32_ADCIFB_TRGR_TRGMOD_SIZE                                  3
#define AVR32_ADCIFB_TRGR_TRGPER                                      16
#define AVR32_ADCIFB_TRGR_TRGPER_MASK                         0xffff0000
#define AVR32_ADCIFB_TRGR_TRGPER_OFFSET                               16
#define AVR32_ADCIFB_TRGR_TRGPER_SIZE                                 16
#define AVR32_ADCIFB_TSAMOD                                            0
#define AVR32_ADCIFB_TSAMOD_MASK                              0x00000001
#define AVR32_ADCIFB_TSAMOD_OFFSET                                     0
#define AVR32_ADCIFB_TSAMOD_SIZE                                       1
#define AVR32_ADCIFB_TSPO                                             16
#define AVR32_ADCIFB_TSPO_MASK                                0x00ff0000
#define AVR32_ADCIFB_TSPO_OFFSET                                      16
#define AVR32_ADCIFB_TSPO_SIZE                                         8
#define AVR32_ADCIFB_VARIANT                                          16
#define AVR32_ADCIFB_VARIANT_MASK                             0x000f0000
#define AVR32_ADCIFB_VARIANT_OFFSET                                   16
#define AVR32_ADCIFB_VARIANT_SIZE                                      4
#define AVR32_ADCIFB_VERSION                                  0x00000034
#define AVR32_ADCIFB_VERSION_MASK                             0x000f0fff
#define AVR32_ADCIFB_VERSION_OFFSET                                    0
#define AVR32_ADCIFB_VERSION_RESETVALUE                       0x00000101
#define AVR32_ADCIFB_VERSION_SIZE                                     12
#define AVR32_ADCIFB_VERSION_VARIANT                                  16
#define AVR32_ADCIFB_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_ADCIFB_VERSION_VARIANT_OFFSET                           16
#define AVR32_ADCIFB_VERSION_VARIANT_SIZE                              4
#define AVR32_ADCIFB_VERSION_VERSION                                   0
#define AVR32_ADCIFB_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_ADCIFB_VERSION_VERSION_OFFSET                            0
#define AVR32_ADCIFB_VERSION_VERSION_SIZE                             12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_adcifb_cr_t {
    unsigned int                 :22;
    unsigned int dis             : 1;
    unsigned int en              : 1;
    unsigned int                 : 6;
    unsigned int start           : 1;
    unsigned int swrst           : 1;
} avr32_adcifb_cr_t;



typedef struct avr32_adcifb_mr_t {
    unsigned int pendbc          : 4;
    unsigned int                 : 4;
    unsigned int tspo            : 8;
    unsigned int                 : 9;
    unsigned int apoe            : 1;
    unsigned int ace             : 1;
    unsigned int pendet          : 1;
    unsigned int                 : 3;
    unsigned int tsamod          : 1;
} avr32_adcifb_mr_t;



typedef struct avr32_adcifb_acr_t {
    unsigned int                 : 4;
    unsigned int shtim           : 4;
    unsigned int                 : 1;
    unsigned int startup         : 7;
    unsigned int                 : 2;
    unsigned int prescal         : 6;
    unsigned int                 : 2;
    unsigned int res             : 2;
    unsigned int                 : 3;
    unsigned int sleep           : 1;
} avr32_adcifb_acr_t;



typedef struct avr32_adcifb_trgr_t {
    unsigned int trgper          :16;
    unsigned int                 :13;
    unsigned int trgmod          : 3;
} avr32_adcifb_trgr_t;



typedef struct avr32_adcifb_cvr_t {
    unsigned int                 : 4;
    unsigned int hv              :12;
    unsigned int                 : 4;
    unsigned int lv              :12;
} avr32_adcifb_cvr_t;



typedef struct avr32_adcifb_sr_t {
    unsigned int                 : 7;
    unsigned int en              : 1;
    unsigned int                 : 9;
    unsigned int celse           : 1;
    unsigned int cgt             : 1;
    unsigned int clt             : 1;
    unsigned int                 : 2;
    unsigned int busy            : 1;
    unsigned int ready           : 1;
    unsigned int                 : 2;
    unsigned int nocnt           : 1;
    unsigned int pencnt          : 1;
    unsigned int                 : 2;
    unsigned int ovre            : 1;
    unsigned int drdy            : 1;
} avr32_adcifb_sr_t;



typedef struct avr32_adcifb_isr_t {
    unsigned int                 :17;
    unsigned int celse           : 1;
    unsigned int cgt             : 1;
    unsigned int clt             : 1;
    unsigned int                 : 2;
    unsigned int busy            : 1;
    unsigned int ready           : 1;
    unsigned int                 : 2;
    unsigned int nocnt           : 1;
    unsigned int pencnt          : 1;
    unsigned int                 : 2;
    unsigned int ovre            : 1;
    unsigned int drdy            : 1;
} avr32_adcifb_isr_t;



typedef struct avr32_adcifb_icr_t {
    unsigned int                 :17;
    unsigned int celse           : 1;
    unsigned int cgt             : 1;
    unsigned int clt             : 1;
    unsigned int                 : 2;
    unsigned int busy            : 1;
    unsigned int ready           : 1;
    unsigned int                 : 2;
    unsigned int nocnt           : 1;
    unsigned int pencnt          : 1;
    unsigned int                 : 2;
    unsigned int ovre            : 1;
    unsigned int drdy            : 1;
} avr32_adcifb_icr_t;



typedef struct avr32_adcifb_ier_t {
    unsigned int                 :17;
    unsigned int celse           : 1;
    unsigned int cgt             : 1;
    unsigned int clt             : 1;
    unsigned int                 : 2;
    unsigned int busy            : 1;
    unsigned int ready           : 1;
    unsigned int                 : 2;
    unsigned int nocnt           : 1;
    unsigned int pencnt          : 1;
    unsigned int                 : 2;
    unsigned int ovre            : 1;
    unsigned int drdy            : 1;
} avr32_adcifb_ier_t;



typedef struct avr32_adcifb_idr_t {
    unsigned int                 :17;
    unsigned int celse           : 1;
    unsigned int cgt             : 1;
    unsigned int clt             : 1;
    unsigned int                 : 2;
    unsigned int busy            : 1;
    unsigned int ready           : 1;
    unsigned int                 : 2;
    unsigned int nocnt           : 1;
    unsigned int pencnt          : 1;
    unsigned int                 : 2;
    unsigned int ovre            : 1;
    unsigned int drdy            : 1;
} avr32_adcifb_idr_t;



typedef struct avr32_adcifb_imr_t {
    unsigned int                 :17;
    unsigned int celse           : 1;
    unsigned int cgt             : 1;
    unsigned int clt             : 1;
    unsigned int                 : 2;
    unsigned int busy            : 1;
    unsigned int ready           : 1;
    unsigned int                 : 2;
    unsigned int nocnt           : 1;
    unsigned int pencnt          : 1;
    unsigned int                 : 2;
    unsigned int ovre            : 1;
    unsigned int drdy            : 1;
} avr32_adcifb_imr_t;



typedef struct avr32_adcifb_lcdr_t {
    unsigned int                 : 8;
    unsigned int lcch            : 8;
    unsigned int                 : 4;
    unsigned int ldata           :12;
} avr32_adcifb_lcdr_t;



typedef struct avr32_adcifb_parameter_t {
    unsigned int ch31            : 1;
    unsigned int ch30            : 1;
    unsigned int ch29            : 1;
    unsigned int ch28            : 1;
    unsigned int ch27            : 1;
    unsigned int ch26            : 1;
    unsigned int ch25            : 1;
    unsigned int ch24            : 1;
    unsigned int ch23            : 1;
    unsigned int ch22            : 1;
    unsigned int ch21            : 1;
    unsigned int ch20            : 1;
    unsigned int ch19            : 1;
    unsigned int ch18            : 1;
    unsigned int ch17            : 1;
    unsigned int ch16            : 1;
    unsigned int ch15            : 1;
    unsigned int ch14            : 1;
    unsigned int ch13            : 1;
    unsigned int ch12            : 1;
    unsigned int ch11            : 1;
    unsigned int ch10            : 1;
    unsigned int ch9             : 1;
    unsigned int ch8             : 1;
    unsigned int ch7             : 1;
    unsigned int ch6             : 1;
    unsigned int ch5             : 1;
    unsigned int ch4             : 1;
    unsigned int ch3             : 1;
    unsigned int ch2             : 1;
    unsigned int ch1             : 1;
    unsigned int ch0             : 1;
} avr32_adcifb_parameter_t;



typedef struct avr32_adcifb_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_adcifb_version_t;



typedef struct avr32_adcifb_cher_t {
    unsigned int ch31            : 1;
    unsigned int ch30            : 1;
    unsigned int ch29            : 1;
    unsigned int ch28            : 1;
    unsigned int ch27            : 1;
    unsigned int ch26            : 1;
    unsigned int ch25            : 1;
    unsigned int ch24            : 1;
    unsigned int ch23            : 1;
    unsigned int ch22            : 1;
    unsigned int ch21            : 1;
    unsigned int ch20            : 1;
    unsigned int ch19            : 1;
    unsigned int ch18            : 1;
    unsigned int ch17            : 1;
    unsigned int ch16            : 1;
    unsigned int ch15            : 1;
    unsigned int ch14            : 1;
    unsigned int ch13            : 1;
    unsigned int ch12            : 1;
    unsigned int ch11            : 1;
    unsigned int ch10            : 1;
    unsigned int ch9             : 1;
    unsigned int ch8             : 1;
    unsigned int ch7             : 1;
    unsigned int ch6             : 1;
    unsigned int ch5             : 1;
    unsigned int ch4             : 1;
    unsigned int ch3             : 1;
    unsigned int ch2             : 1;
    unsigned int ch1             : 1;
    unsigned int ch0             : 1;
} avr32_adcifb_cher_t;



typedef struct avr32_adcifb_chdr_t {
    unsigned int ch31            : 1;
    unsigned int ch30            : 1;
    unsigned int ch29            : 1;
    unsigned int ch28            : 1;
    unsigned int ch27            : 1;
    unsigned int ch26            : 1;
    unsigned int ch25            : 1;
    unsigned int ch24            : 1;
    unsigned int ch23            : 1;
    unsigned int ch22            : 1;
    unsigned int ch21            : 1;
    unsigned int ch20            : 1;
    unsigned int ch19            : 1;
    unsigned int ch18            : 1;
    unsigned int ch17            : 1;
    unsigned int ch16            : 1;
    unsigned int ch15            : 1;
    unsigned int ch14            : 1;
    unsigned int ch13            : 1;
    unsigned int ch12            : 1;
    unsigned int ch11            : 1;
    unsigned int ch10            : 1;
    unsigned int ch9             : 1;
    unsigned int ch8             : 1;
    unsigned int ch7             : 1;
    unsigned int ch6             : 1;
    unsigned int ch5             : 1;
    unsigned int ch4             : 1;
    unsigned int ch3             : 1;
    unsigned int ch2             : 1;
    unsigned int ch1             : 1;
    unsigned int ch0             : 1;
} avr32_adcifb_chdr_t;



typedef struct avr32_adcifb_chsr_t {
    unsigned int ch31            : 1;
    unsigned int ch30            : 1;
    unsigned int ch29            : 1;
    unsigned int ch28            : 1;
    unsigned int ch27            : 1;
    unsigned int ch26            : 1;
    unsigned int ch25            : 1;
    unsigned int ch24            : 1;
    unsigned int ch23            : 1;
    unsigned int ch22            : 1;
    unsigned int ch21            : 1;
    unsigned int ch20            : 1;
    unsigned int ch19            : 1;
    unsigned int ch18            : 1;
    unsigned int ch17            : 1;
    unsigned int ch16            : 1;
    unsigned int ch15            : 1;
    unsigned int ch14            : 1;
    unsigned int ch13            : 1;
    unsigned int ch12            : 1;
    unsigned int ch11            : 1;
    unsigned int ch10            : 1;
    unsigned int ch9             : 1;
    unsigned int ch8             : 1;
    unsigned int ch7             : 1;
    unsigned int ch6             : 1;
    unsigned int ch5             : 1;
    unsigned int ch4             : 1;
    unsigned int ch3             : 1;
    unsigned int ch2             : 1;
    unsigned int ch1             : 1;
    unsigned int ch0             : 1;
} avr32_adcifb_chsr_t;



typedef struct avr32_adcifb_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_adcifb_cr_t              CR        ;
  };
  union {
          unsigned long                  mr        ;//0x0004
          avr32_adcifb_mr_t              MR        ;
  };
  union {
          unsigned long                  acr       ;//0x0008
          avr32_adcifb_acr_t             ACR       ;
  };
  union {
          unsigned long                  trgr      ;//0x000c
          avr32_adcifb_trgr_t            TRGR      ;
  };
  union {
          unsigned long                  cvr       ;//0x0010
          avr32_adcifb_cvr_t             CVR       ;
  };
  union {
    const unsigned long                  sr        ;//0x0014
    const avr32_adcifb_sr_t              SR        ;
  };
  union {
    const unsigned long                  isr       ;//0x0018
    const avr32_adcifb_isr_t             ISR       ;
  };
  union {
          unsigned long                  icr       ;//0x001c
          avr32_adcifb_icr_t             ICR       ;
  };
  union {
          unsigned long                  ier       ;//0x0020
          avr32_adcifb_ier_t             IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0024
          avr32_adcifb_idr_t             IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0028
    const avr32_adcifb_imr_t             IMR       ;
  };
  union {
    const unsigned long                  lcdr      ;//0x002c
    const avr32_adcifb_lcdr_t            LCDR      ;
  };
  union {
    const unsigned long                  parameter ;//0x0030
    const avr32_adcifb_parameter_t       PARAMETER ;
  };
  union {
    const unsigned long                  version   ;//0x0034
    const avr32_adcifb_version_t         VERSION   ;
  };
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
  union {
          unsigned long                  cher      ;//0x0040
          avr32_adcifb_cher_t            CHER      ;
  };
  union {
          unsigned long                  chdr      ;//0x0044
          avr32_adcifb_chdr_t            CHDR      ;
  };
  union {
    const unsigned long                  chsr      ;//0x0048
    const avr32_adcifb_chsr_t            CHSR      ;
  };
} avr32_adcifb_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_ADCIFB_101_H_INCLUDED*/
#endif

