/*****************************************************************************
 *
 * Copyright (C) 2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_ADCIFA_WCFG0_MASK                               0x7fffffff
#define AVR32_ADCIFA_WCFG0_RESETVALUE                         0x00000000
#define AVR32_ADCIFA_WCFG0_SRC                                        27
#define AVR32_ADCIFA_WCFG0_SRC_MASK                           0x78000000
#define AVR32_ADCIFA_WCFG0_SRC_OFFSET                                 27
#define AVR32_ADCIFA_WCFG0_SRC_SIZE                                    4
#define AVR32_ADCIFA_WCFG0_WM                                         24
#define AVR32_ADCIFA_WCFG0_WM_MASK                            0x07000000
#define AVR32_ADCIFA_WCFG0_WM_OFFSET                                  24
#define AVR32_ADCIFA_WCFG0_WM_SIZE                                     3
#define AVR32_ADCIFA_WCFG1                                    0x0000005c
#define AVR32_ADCIFA_WCFG1_HT                                         12
#define AVR32_ADCIFA_WCFG1_HT_MASK                            0x00fff000
#define AVR32_ADCIFA_WCFG1_HT_OFFSET                                  12
#define AVR32_ADCIFA_WCFG1_HT_SIZE                                    12
#define AVR32_ADCIFA_WCFG1_LT                                          0
#define AVR32_ADCIFA_WCFG1_LT_MASK                            0x00000fff
#define AVR32_ADCIFA_WCFG1_LT_OFFSET                                   0
#define AVR32_ADCIFA_WCFG1_LT_SIZE                                    12
#define AVR32_ADCIFA_WCFG1_MASK                               0x7fffffff
#define AVR32_ADCIFA_WCFG1_RESETVALUE                         0x00000000
#define AVR32_ADCIFA_WCFG1_SRC                                        27
#define AVR32_ADCIFA_WCFG1_SRC_MASK                           0x78000000
#define AVR32_ADCIFA_WCFG1_SRC_OFFSET                                 27
#define AVR32_ADCIFA_WCFG1_SRC_SIZE                                    4
#define AVR32_ADCIFA_WCFG1_WM                                         24
#define AVR32_ADCIFA_WCFG1_WM_MASK                            0x07000000
#define AVR32_ADCIFA_WCFG1_WM_OFFSET                                  24
#define AVR32_ADCIFA_WCFG1_WM_SIZE                                     3
#define AVR32_ADCIFA_WM                                               24
#define AVR32_ADCIFA_WM0                                              10
#define AVR32_ADCIFA_WM0_MASK                                 0x00000400
#define AVR32_ADCIFA_WM0_OFFSET                                       10
#define AVR32_ADCIFA_WM0_SIZE                                          1
#define AVR32_ADCIFA_WM1                                              11
#define AVR32_ADCIFA_WM1_MASK                                 0x00000800
#define AVR32_ADCIFA_WM1_OFFSET                                       11
#define AVR32_ADCIFA_WM1_SIZE                                          1
#define AVR32_ADCIFA_WM_MASK                                  0x07000000
#define AVR32_ADCIFA_WM_OFFSET                                        24
#define AVR32_ADCIFA_WM_SIZE                                           3




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_adcifa_cr_t {
    unsigned int                 :28;
    unsigned int tstart          : 1;
    unsigned int tstop           : 1;
    unsigned int soc1            : 1;
    unsigned int soc0            : 1;
} avr32_adcifa_cr_t;



typedef struct avr32_adcifa_cfg_t {
    unsigned int                 :10;
    unsigned int sut             : 6;
    unsigned int                 : 5;
    unsigned int muxset          : 1;
    unsigned int exref           : 1;
    unsigned int awke            : 1;
    unsigned int shd             : 1;
    unsigned int rs              : 2;
    unsigned int frm             : 1;
    unsigned int ssmq            : 1;
    unsigned int sleep           : 1;
    unsigned int tsen            : 1;
    unsigned int adcen           : 1;
} avr32_adcifa_cfg_t;



typedef struct avr32_adcifa_sr_t {
    unsigned int awup            : 1;
    unsigned int                 : 3;
    unsigned int state1          : 4;
    unsigned int                 : 4;
    unsigned int state0          : 4;
    unsigned int runt            : 1;
    unsigned int sutd            : 1;
    unsigned int msoc1           : 1;
    unsigned int msoc0           : 1;
    unsigned int wm1             : 1;
    unsigned int wm0             : 1;
    unsigned int pcnt            : 1;
    unsigned int ploss           : 1;
    unsigned int lovr1           : 1;
    unsigned int ovr1            : 1;
    unsigned int seoc1           : 1;
    unsigned int seos1           : 1;
    unsigned int lovr0           : 1;
    unsigned int ovr0            : 1;
    unsigned int seoc0           : 1;
    unsigned int seos0           : 1;
} avr32_adcifa_sr_t;



typedef struct avr32_adcifa_scr_t {
    unsigned int awup            : 1;
    unsigned int                 :16;
    unsigned int sutd            : 1;
    unsigned int msoc1           : 1;
    unsigned int msoc0           : 1;
    unsigned int wm1             : 1;
    unsigned int wm0             : 1;
    unsigned int pcnt            : 1;
    unsigned int ploss           : 1;
    unsigned int lovr1           : 1;
    unsigned int ovr1            : 1;
    unsigned int seoc1           : 1;
    unsigned int seos1           : 1;
    unsigned int lovr0           : 1;
    unsigned int ovr0            : 1;
    unsigned int seoc0           : 1;
    unsigned int seos0           : 1;
} avr32_adcifa_scr_t;



typedef struct avr32_adcifa_ssr_t {
    unsigned int awup            : 1;
    unsigned int                 :16;
    unsigned int sutd            : 1;
    unsigned int msoc1           : 1;
    unsigned int msoc0           : 1;
    unsigned int wm1             : 1;
    unsigned int wm0             : 1;
    unsigned int pcnt            : 1;
    unsigned int ploss           : 1;
    unsigned int lovr1           : 1;
    unsigned int ovr1            : 1;
    unsigned int seoc1           : 1;
    unsigned int seos1           : 1;
    unsigned int lovr0           : 1;
    unsigned int ovr0            : 1;
    unsigned int seoc0           : 1;
    unsigned int seos0           : 1;
} avr32_adcifa_ssr_t;



typedef struct avr32_adcifa_seqcfg0_t {
    unsigned int                 :12;
    unsigned int cnvnb           : 4;
    unsigned int                 : 2;
    unsigned int sres            : 2;
    unsigned int                 : 2;
    unsigned int trgsel          : 2;
    unsigned int                 : 3;
    unsigned int shdyn           : 1;
    unsigned int ovsx2           : 1;
    unsigned int socb            : 1;
    unsigned int hwla            : 1;
    unsigned int sa              : 1;
} avr32_adcifa_seqcfg0_t;



typedef struct avr32_adcifa_seqcfg1_t {
    unsigned int                 :12;
    unsigned int cnvnb           : 4;
    unsigned int                 : 2;
    unsigned int sres            : 2;
    unsigned int                 : 2;
    unsigned int trgsel          : 2;
    unsigned int                 : 3;
    unsigned int shdyn           : 1;
    unsigned int ovsx2           : 1;
    unsigned int socb            : 1;
    unsigned int hwla            : 1;
    unsigned int sa              : 1;
} avr32_adcifa_seqcfg1_t;



typedef struct avr32_adcifa_shg0_t {
    unsigned int                 : 1;
    unsigned int gcnv7           : 3;
    unsigned int                 : 1;
    unsigned int gcnv6           : 3;
    unsigned int                 : 1;
    unsigned int gcnv5           : 3;
    unsigned int                 : 1;
    unsigned int gcnv4           : 3;
    unsigned int                 : 1;
    unsigned int gcnv3           : 3;
    unsigned int                 : 1;
    unsigned int gcnv2           : 3;
    unsigned int                 : 1;
    unsigned int gcnv1           : 3;
    unsigned int                 : 1;
    unsigned int gcnv0           : 3;
} avr32_adcifa_shg0_t;



typedef struct avr32_adcifa_shg1_t {
    unsigned int                 : 1;
    unsigned int gcnv7           : 3;
    unsigned int                 : 1;
    unsigned int gcnv6           : 3;
    unsigned int                 : 1;
    unsigned int gcnv5           : 3;
    unsigned int                 : 1;
    unsigned int gcnv4           : 3;
    unsigned int                 : 1;
    unsigned int gcnv3           : 3;
    unsigned int                 : 1;
    unsigned int gcnv2           : 3;
    unsigned int                 : 1;
    unsigned int gcnv1           : 3;
    unsigned int                 : 1;
    unsigned int gcnv0           : 3;
} avr32_adcifa_shg1_t;



typedef struct avr32_adcifa_inpsel00_t {
    unsigned int                 : 4;
    unsigned int cnv3            : 4;
    unsigned int                 : 4;
    unsigned int cnv2            : 4;
    unsigned int                 : 4;
    unsigned int cnv1            : 4;
    unsigned int                 : 4;
    unsigned int cnv0            : 4;
} avr32_adcifa_inpsel00_t;



typedef struct avr32_adcifa_inpsel01_t {
    unsigned int                 : 4;
    unsigned int cnv3            : 4;
    unsigned int                 : 4;
    unsigned int cnv2            : 4;
    unsigned int                 : 4;
    unsigned int cnv1            : 4;
    unsigned int                 : 4;
    unsigned int cnv0            : 4;
} avr32_adcifa_inpsel01_t;



typedef struct avr32_adcifa_inpsel10_t {
    unsigned int                 : 4;
    unsigned int cnv7            : 4;
    unsigned int                 : 4;
    unsigned int cnv6            : 4;
    unsigned int                 : 4;
    unsigned int cnv5            : 4;
    unsigned int                 : 4;
    unsigned int cnv4            : 4;
} avr32_adcifa_inpsel10_t;



typedef struct avr32_adcifa_inpsel11_t {
    unsigned int                 : 4;
    unsigned int cnv7            : 4;
    unsigned int                 : 4;
    unsigned int cnv6            : 4;
    unsigned int                 : 4;
    unsigned int cnv5            : 4;
    unsigned int                 : 4;
    unsigned int cnv4            : 4;
} avr32_adcifa_inpsel11_t;



typedef struct avr32_adcifa_innsel00_t {
    unsigned int                 : 4;
    unsigned int cnv3            : 4;
    unsigned int                 : 4;
    unsigned int cnv2            : 4;
    unsigned int                 : 4;
    unsigned int cnv1            : 4;
    unsigned int                 : 4;
    unsigned int cnv0            : 4;
} avr32_adcifa_innsel00_t;



typedef struct avr32_adcifa_innsel01_t {
    unsigned int                 : 4;
    unsigned int cnv3            : 4;
    unsigned int                 : 4;
    unsigned int cnv2            : 4;
    unsigned int                 : 4;
    unsigned int cnv1            : 4;
    unsigned int                 : 4;
    unsigned int cnv0            : 4;
} avr32_adcifa_innsel01_t;



typedef struct avr32_adcifa_innsel10_t {
    unsigned int                 : 4;
    unsigned int cnv7            : 4;
    unsigned int                 : 4;
    unsigned int cnv6            : 4;
    unsigned int                 : 4;
    unsigned int cnv5            : 4;
    unsigned int                 : 4;
    unsigned int cnv4            : 4;
} avr32_adcifa_innsel10_t;



typedef struct avr32_adcifa_innsel11_t {
    unsigned int                 : 4;
    unsigned int cnv7            : 4;
    unsigned int                 : 4;
    unsigned int cnv6            : 4;
    unsigned int                 : 4;
    unsigned int cnv5            : 4;
    unsigned int                 : 4;
    unsigned int cnv4            : 4;
} avr32_adcifa_innsel11_t;



typedef struct avr32_adcifa_ckdiv_t {
    unsigned int                 :23;
    unsigned int cnt             : 9;
} avr32_adcifa_ckdiv_t;



typedef struct avr32_adcifa_itimer_t {
    unsigned int                 :15;
    unsigned int itmc            :17;
} avr32_adcifa_itimer_t;



typedef struct avr32_adcifa_tsscfg_t {
    unsigned int                 :18;
    unsigned int pdpsw           : 3;
    unsigned int pendt           : 1;
    unsigned int trgsel          : 2;
    unsigned int stm             : 4;
    unsigned int pendbc          : 4;
} avr32_adcifa_tsscfg_t;



typedef struct avr32_adcifa_tsswseq0_t {
    unsigned int                 : 4;
    unsigned int sw3             : 4;
    unsigned int                 : 4;
    unsigned int sw2             : 4;
    unsigned int                 : 4;
    unsigned int sw1             : 4;
    unsigned int                 : 4;
    unsigned int sw0             : 4;
} avr32_adcifa_tsswseq0_t;



typedef struct avr32_adcifa_tsswseq1_t {
    unsigned int                 : 4;
    unsigned int sw3             : 4;
    unsigned int                 : 4;
    unsigned int sw2             : 4;
    unsigned int                 : 4;
    unsigned int sw1             : 4;
    unsigned int                 : 4;
    unsigned int sw0             : 4;
} avr32_adcifa_tsswseq1_t;



typedef struct avr32_adcifa_wcfg0_t {
    unsigned int                 : 1;
    unsigned int src             : 4;
    unsigned int wm              : 3;
    unsigned int ht              :12;
    unsigned int lt              :12;
} avr32_adcifa_wcfg0_t;



typedef struct avr32_adcifa_wcfg1_t {
    unsigned int                 : 1;
    unsigned int src             : 4;
    unsigned int wm              : 3;
    unsigned int ht              :12;
    unsigned int lt              :12;
} avr32_adcifa_wcfg1_t;



typedef struct avr32_adcifa_adccal_t {
    unsigned int                 : 2;
    unsigned int ocal            : 6;
    unsigned int                 : 9;
    unsigned int gcal            :15;
} avr32_adcifa_adccal_t;



typedef struct avr32_adcifa_shcal_t {
    unsigned int                 : 6;
    unsigned int gain1           :10;
    unsigned int                 : 6;
    unsigned int gain0           :10;
} avr32_adcifa_shcal_t;



typedef struct avr32_adcifa_ier_t {
    unsigned int awup            : 1;
    unsigned int                 :16;
    unsigned int sutd            : 1;
    unsigned int msoc1           : 1;
    unsigned int msoc0           : 1;
    unsigned int wm1             : 1;
    unsigned int wm0             : 1;
    unsigned int pcnt            : 1;
    unsigned int ploss           : 1;
    unsigned int lovr1           : 1;
    unsigned int ovr1            : 1;
    unsigned int seoc1           : 1;
    unsigned int seos1           : 1;
    unsigned int lovr0           : 1;
    unsigned int ovr0            : 1;
    unsigned int seoc0           : 1;
    unsigned int seos0           : 1;
} avr32_adcifa_ier_t;



typedef struct avr32_adcifa_idr_t {
    unsigned int awup            : 1;
    unsigned int                 :16;
    unsigned int sutd            : 1;
    unsigned int msoc1           : 1;
    unsigned int msoc0           : 1;
    unsigned int wm1             : 1;
    unsigned int wm0             : 1;
    unsigned int pcnt            : 1;
    unsigned int ploss           : 1;
    unsigned int lovr1           : 1;
    unsigned int ovr1            : 1;
    unsigned int seoc1           : 1;
    unsigned int seos1           : 1;
    unsigned int lovr0           : 1;
    unsigned int ovr0            : 1;
    unsigned int seoc0           : 1;
    unsigned int seos0           : 1;
} avr32_adcifa_idr_t;



typedef struct avr32_adcifa_imr_t {
    unsigned int awup            : 1;
    unsigned int                 :16;
    unsigned int sutd            : 1;
    unsigned int msoc1           : 1;
    unsigned int msoc0           : 1;
    unsigned int wm1             : 1;
    unsigned int wm0             : 1;
    unsigned int pcnt            : 1;
    unsigned int ploss           : 1;
    unsigned int lovr1           : 1;
    unsigned int ovr1            : 1;
    unsigned int seoc1           : 1;
    unsigned int seos1           : 1;
    unsigned int lovr0           : 1;
    unsigned int ovr0            : 1;
    unsigned int seoc0           : 1;
    unsigned int seos0           : 1;
} avr32_adcifa_imr_t;



typedef struct avr32_adcifa_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_adcifa_version_t;



typedef struct avr32_adcifa_parameter_t {
    unsigned int                 :16;
    unsigned int n               : 8;
    unsigned int m               : 8;
} avr32_adcifa_parameter_t;



typedef struct avr32_adcifa_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_adcifa_cr_t              CR        ;
  };
  union {
          unsigned long                  cfg       ;//0x0004
          avr32_adcifa_cfg_t             CFG       ;
  };
  union {
    const unsigned long                  sr        ;//0x0008
    const avr32_adcifa_sr_t              SR        ;
  };
  union {
          unsigned long                  scr       ;//0x000c
          avr32_adcifa_scr_t             SCR       ;
  };
  union {
          unsigned long                  ssr       ;//0x0010
          avr32_adcifa_ssr_t             SSR       ;
  };
  union {
          unsigned long                  seqcfg0   ;//0x0014
          avr32_adcifa_seqcfg0_t         SEQCFG0   ;
  };
  union {
          unsigned long                  seqcfg1   ;//0x0018
          avr32_adcifa_seqcfg1_t         SEQCFG1   ;
  };
  union {
          unsigned long                  shg0      ;//0x001c
          avr32_adcifa_shg0_t            SHG0      ;
  };
  union {
          unsigned long                  shg1      ;//0x0020
          avr32_adcifa_shg1_t            SHG1      ;
  };
  union {
          unsigned long                  inpsel00  ;//0x0024
          avr32_adcifa_inpsel00_t        INPSEL00  ;
  };
  union {
          unsigned long                  inpsel01  ;//0x0028
          avr32_adcifa_inpsel01_t        INPSEL01  ;
  };
  union {
          unsigned long                  inpsel10  ;//0x002c
          avr32_adcifa_inpsel10_t        INPSEL10  ;
  };
  union {
          unsigned long                  inpsel11  ;//0x0030
          avr32_adcifa_inpsel11_t        INPSEL11  ;
  };
  union {
          unsigned long                  innsel00  ;//0x0034
          avr32_adcifa_innsel00_t        INNSEL00  ;
  };
  union {
          unsigned long                  innsel01  ;//0x0038
          avr32_adcifa_innsel01_t        INNSEL01  ;
  };
  union {
          unsigned long                  innsel10  ;//0x003c
          avr32_adcifa_innsel10_t        INNSEL10  ;
  };
  union {
          unsigned long                  innsel11  ;//0x0040
          avr32_adcifa_innsel11_t        INNSEL11  ;
  };
  union {
          unsigned long                  ckdiv     ;//0x0044
          avr32_adcifa_ckdiv_t           CKDIV     ;
  };
  union {
          unsigned long                  itimer    ;//0x0048
          avr32_adcifa_itimer_t          ITIMER    ;
  };
  union {
          unsigned long                  tsscfg    ;//0x004c
          avr32_adcifa_tsscfg_t          TSSCFG    ;
  };
  union {
          unsigned long                  tsswseq0  ;//0x0050
          avr32_adcifa_tsswseq0_t        TSSWSEQ0  ;
  };
  union {
          unsigned long                  tsswseq1  ;//0x0054
          avr32_adcifa_tsswseq1_t        TSSWSEQ1  ;
  };
  union {
          unsigned long                  wcfg0     ;//0x0058
          avr32_adcifa_wcfg0_t           WCFG0     ;
  };
  union {
          unsigned long                  wcfg1     ;//0x005c
          avr32_adcifa_wcfg1_t           WCFG1     ;
  };
    const unsigned long                  lcv0      ;//0x0060
    const unsigned long                  lcv1      ;//0x0064
  union {
          unsigned long                  adccal    ;//0x0068
          avr32_adcifa_adccal_t          ADCCAL    ;
  };
  union {
          unsigned long                  shcal     ;//0x006c
          avr32_adcifa_shcal_t           SHCAL     ;
  };
  union {
          unsigned long                  ier       ;//0x0070
          avr32_adcifa_ier_t             IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0074
          avr32_adcifa_idr_t             IDR       ;
  };
  union {
          unsigned long                  imr       ;//0x0078
          avr32_adcifa_imr_t             IMR       ;
  };
  union {
    const unsigned long                  version   ;//0x007c
    const avr32_adcifa_version_t         VERSION   ;
  };
  union {
    const unsigned long                  parameter ;//0x0080
    const avr32_adcifa_parameter_t       PARAMETER ;
  };
    const unsigned long                  resx      [16];//0x0084
} avr32_adcifa_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_ADCIFA_110_H_INCLUDED*/
#endif

