/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_AST_VARIANT_OFFSET                                   16
#define AVR32_AST_VARIANT_SIZE                                      4
#define AVR32_AST_VERSION                                  0x000000fc
#define AVR32_AST_VERSION_MASK                             0x000f0fff
#define AVR32_AST_VERSION_OFFSET                                    0
#define AVR32_AST_VERSION_RESETVALUE                       0x00000300
#define AVR32_AST_VERSION_SIZE                                     12
#define AVR32_AST_VERSION_VARIANT                                  16
#define AVR32_AST_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_AST_VERSION_VARIANT_OFFSET                           16
#define AVR32_AST_VERSION_VARIANT_SIZE                              4
#define AVR32_AST_VERSION_VERSION                                   0
#define AVR32_AST_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_AST_VERSION_VERSION_OFFSET                            0
#define AVR32_AST_VERSION_VERSION_SIZE                             12
#define AVR32_AST_WER                                      0x0000001c
#define AVR32_AST_WER_ALARM0                                        8
#define AVR32_AST_WER_ALARM0_MASK                          0x00000100
#define AVR32_AST_WER_ALARM0_OFFSET                                 8
#define AVR32_AST_WER_ALARM0_SIZE                                   1
#define AVR32_AST_WER_ALARM1                                        9
#define AVR32_AST_WER_ALARM1_MASK                          0x00000200
#define AVR32_AST_WER_ALARM1_OFFSET                                 9
#define AVR32_AST_WER_ALARM1_SIZE                                   1
#define AVR32_AST_WER_MASK                                 0x00030301
#define AVR32_AST_WER_OVF                                           0
#define AVR32_AST_WER_OVF_MASK                             0x00000001
#define AVR32_AST_WER_OVF_OFFSET                                    0
#define AVR32_AST_WER_OVF_SIZE                                      1
#define AVR32_AST_WER_PER0                                         16
#define AVR32_AST_WER_PER0_MASK                            0x00010000
#define AVR32_AST_WER_PER0_OFFSET                                  16
#define AVR32_AST_WER_PER0_SIZE                                     1
#define AVR32_AST_WER_PER1                                         17
#define AVR32_AST_WER_PER1_MASK                            0x00020000
#define AVR32_AST_WER_PER1_OFFSET                                  17
#define AVR32_AST_WER_PER1_SIZE                                     1
#define AVR32_AST_WER_RESETVALUE                           0x00000000
#define AVR32_AST_YEAR                                             26
#define AVR32_AST_YEAR_MASK                                0xfc000000
#define AVR32_AST_YEAR_OFFSET                                      26
#define AVR32_AST_YEAR_SIZE                                         6
#define AVR32_AST_ZERO                                     0x00000000




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_ast_cr_t {
    unsigned int                 :11;
    unsigned int psel            : 5;
    unsigned int                 : 6;
    unsigned int ca1             : 1;
    unsigned int ca0             : 1;
    unsigned int                 : 5;
    unsigned int cal             : 1;
    unsigned int pclr            : 1;
    unsigned int en              : 1;
} avr32_ast_cr_t;



typedef struct avr32_ast_sr_t {
    unsigned int                 : 2;
    unsigned int clkrdy          : 1;
    unsigned int clkbusy         : 1;
    unsigned int                 : 2;
    unsigned int ready           : 1;
    unsigned int busy            : 1;
    unsigned int                 : 6;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_sr_t;



typedef struct avr32_ast_scr_t {
    unsigned int                 : 2;
    unsigned int clkrdy          : 1;
    unsigned int                 : 3;
    unsigned int ready           : 1;
    unsigned int                 : 7;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_scr_t;



typedef struct avr32_ast_ier_t {
    unsigned int                 : 2;
    unsigned int clkrdy          : 1;
    unsigned int                 : 3;
    unsigned int ready           : 1;
    unsigned int                 : 7;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_ier_t;



typedef struct avr32_ast_idr_t {
    unsigned int                 : 2;
    unsigned int clkrdy          : 1;
    unsigned int                 : 3;
    unsigned int ready           : 1;
    unsigned int                 : 7;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_idr_t;



typedef struct avr32_ast_imr_t {
    unsigned int                 : 2;
    unsigned int clkrdy          : 1;
    unsigned int                 : 3;
    unsigned int ready           : 1;
    unsigned int                 : 7;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_imr_t;



typedef struct avr32_ast_wer_t {
    unsigned int                 :14;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_wer_t;



typedef struct avr32_ast_pir0_t {
    unsigned int                 :27;
    unsigned int insel           : 5;
} avr32_ast_pir0_t;



typedef struct avr32_ast_pir1_t {
    unsigned int                 :27;
    unsigned int insel           : 5;
} avr32_ast_pir1_t;



typedef struct avr32_ast_clock_t {
    unsigned int                 :21;
    unsigned int cssel           : 3;
    unsigned int                 : 7;
    unsigned int cen             : 1;
} avr32_ast_clock_t;



typedef struct avr32_ast_dtr_t {
    unsigned int                 :16;
    unsigned int value           : 8;
    unsigned int                 : 2;
    unsigned int add             : 1;
    unsigned int exp             : 5;
} avr32_ast_dtr_t;



typedef struct avr32_ast_eve_t {
    unsigned int                 :14;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_eve_t;



typedef struct avr32_ast_evd_t {
    unsigned int                 :14;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_evd_t;



typedef struct avr32_ast_evm_t {
    unsigned int                 :14;
    unsigned int per1            : 1;
    unsigned int per0            : 1;
    unsigned int                 : 6;
    unsigned int alarm1          : 1;
    unsigned int alarm0          : 1;
    unsigned int                 : 7;
    unsigned int ovf             : 1;
} avr32_ast_evm_t;



typedef struct avr32_ast_calv_t {
    unsigned int year            : 6;
    unsigned int month           : 4;
    unsigned int day             : 5;
    unsigned int hour            : 5;
    unsigned int min             : 6;
    unsigned int sec             : 6;
} avr32_ast_calv_t;



typedef struct avr32_ast_parameter_t {
    unsigned int                 : 3;
    unsigned int per1value       : 5;
    unsigned int                 : 3;
    unsigned int per0value       : 5;
    unsigned int pir1wa          : 1;
    unsigned int pir0wa          : 1;
    unsigned int                 : 1;
    unsigned int numpir          : 1;
    unsigned int                 : 2;
    unsigned int numar           : 2;
    unsigned int                 : 1;
    unsigned int dtexpvalue      : 5;
    unsigned int dtexpwa         : 1;
    unsigned int dt              : 1;
} avr32_ast_parameter_t;



typedef struct avr32_ast_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_ast_version_t;



typedef struct avr32_ast_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_ast_cr_t                 CR        ;
  };
          unsigned long                  cv        ;//0x0004
  union {
    const unsigned long                  sr        ;//0x0008
    const avr32_ast_sr_t                 SR        ;
  };
  union {
          unsigned long                  scr       ;//0x000c
          avr32_ast_scr_t                SCR       ;
  };
  union {
          unsigned long                  ier       ;//0x0010
          avr32_ast_ier_t                IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0014
          avr32_ast_idr_t                IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0018
    const avr32_ast_imr_t                IMR       ;
  };
  union {
          unsigned long                  wer       ;//0x001c
          avr32_ast_wer_t                WER       ;
  };
          unsigned long                  ar0       ;//0x0020
          unsigned long                  ar1       ;//0x0024
          unsigned int                   :32       ;//0x0028
          unsigned int                   :32       ;//0x002c
  union {
          unsigned long                  pir0      ;//0x0030
          avr32_ast_pir0_t               PIR0      ;
  };
  union {
          unsigned long                  pir1      ;//0x0034
          avr32_ast_pir1_t               PIR1      ;
  };
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
  union {
          unsigned long                  clock     ;//0x0040
          avr32_ast_clock_t              CLOCK     ;
  };
  union {
          unsigned long                  dtr       ;//0x0044
          avr32_ast_dtr_t                DTR       ;
  };
  union {
          unsigned long                  eve       ;//0x0048
          avr32_ast_eve_t                EVE       ;
  };
  union {
          unsigned long                  evd       ;//0x004c
          avr32_ast_evd_t                EVD       ;
  };
  union {
    const unsigned long                  evm       ;//0x0050
    const avr32_ast_evm_t                EVM       ;
  };
  union {
          unsigned long                  calv      ;//0x0054
          avr32_ast_calv_t               CALV      ;
  };
          unsigned int                   :32       ;//0x0058
          unsigned int                   :32       ;//0x005c
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
  union {
    const unsigned long                  parameter ;//0x00f0
    const avr32_ast_parameter_t          PARAMETER ;
  };
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
  union {
    const unsigned long                  version   ;//0x00fc
    const avr32_ast_version_t            VERSION   ;
  };
} avr32_ast_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_AST_300_H_INCLUDED*/
#endif

