/*****************************************************************************
 *
 * Copyright (C) 2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_CANIF_TS_SIZE                                           1
#define AVR32_CANIF_TXOKIM                                            8
#define AVR32_CANIF_TXOKIM_MASK                              0x00000100
#define AVR32_CANIF_TXOKIM_OFFSET                                     8
#define AVR32_CANIF_TXOKIM_SIZE                                       1
#define AVR32_CANIF_VARIANT                                          16
#define AVR32_CANIF_VARIANT_MASK                             0x000f0000
#define AVR32_CANIF_VARIANT_OFFSET                                   16
#define AVR32_CANIF_VARIANT_SIZE                                      4
#define AVR32_CANIF_VERSION                                  0x00000000
#define AVR32_CANIF_VERSION_CHNO                                     20
#define AVR32_CANIF_VERSION_CHNO_MASK                        0x00700000
#define AVR32_CANIF_VERSION_CHNO_OFFSET                              20
#define AVR32_CANIF_VERSION_CHNO_SIZE                                 3
#define AVR32_CANIF_VERSION_MASK                             0x3f7f0fff
#define AVR32_CANIF_VERSION_MNCH0                                    24
#define AVR32_CANIF_VERSION_MNCH0_MASK                       0x3f000000
#define AVR32_CANIF_VERSION_MNCH0_OFFSET                             24
#define AVR32_CANIF_VERSION_MNCH0_SIZE                                6
#define AVR32_CANIF_VERSION_OFFSET                                    0
#define AVR32_CANIF_VERSION_RESETVALUE                       0x10200110
#define AVR32_CANIF_VERSION_SIZE                                     12
#define AVR32_CANIF_VERSION_VARIANT                                  16
#define AVR32_CANIF_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_CANIF_VERSION_VARIANT_OFFSET                           16
#define AVR32_CANIF_VERSION_VARIANT_SIZE                              4
#define AVR32_CANIF_VERSION_VERSION                                   0
#define AVR32_CANIF_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_CANIF_VERSION_VERSION_OFFSET                            0
#define AVR32_CANIF_VERSION_VERSION_SIZE                             12
#define AVR32_CANIF_WKEN                                              3
#define AVR32_CANIF_WKEN_MASK                                0x00000008
#define AVR32_CANIF_WKEN_OFFSET                                       3
#define AVR32_CANIF_WKEN_SIZE                                         1
#define AVR32_CANIF_WKUP                                              6
#define AVR32_CANIF_WKUPIM                                            6
#define AVR32_CANIF_WKUPIM_MASK                              0x00000040
#define AVR32_CANIF_WKUPIM_OFFSET                                     6
#define AVR32_CANIF_WKUPIM_SIZE                                       1
#define AVR32_CANIF_WKUP_MASK                                0x00000040
#define AVR32_CANIF_WKUP_OFFSET                                       6
#define AVR32_CANIF_WKUP_SIZE                                         1




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_canif_version_t {
    unsigned int                 : 2;
    unsigned int mnch0           : 6;
    unsigned int                 : 1;
    unsigned int chno            : 3;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_canif_version_t;



typedef struct avr32_canif_parameter_t {
    unsigned int                 : 2;
    unsigned int mnch4           : 6;
    unsigned int                 : 2;
    unsigned int mnch3           : 6;
    unsigned int                 : 2;
    unsigned int mnch2           : 6;
    unsigned int                 : 2;
    unsigned int mnch1           : 6;
} avr32_canif_parameter_t;



typedef struct avr32_canif_cancfg_t {
    unsigned int                 : 5;
    unsigned int ovrm            : 1;
    unsigned int cmode           : 2;
    unsigned int                 : 2;
    unsigned int sm              : 1;
    unsigned int sjw             : 2;
    unsigned int prs             : 3;
    unsigned int                 : 2;
    unsigned int phs2            : 3;
    unsigned int phs1            : 3;
    unsigned int                 : 2;
    unsigned int pres            : 6;
} avr32_canif_cancfg_t;



typedef struct avr32_canif_canctrl_t {
    unsigned int                 :28;
    unsigned int wken            : 1;
    unsigned int ovrq            : 1;
    unsigned int cen             : 1;
    unsigned int init            : 1;
} avr32_canif_canctrl_t;



typedef struct avr32_canif_cansr_t {
    unsigned int                 :28;
    unsigned int rs              : 1;
    unsigned int ts              : 1;
    unsigned int ovs             : 1;
    unsigned int ces             : 1;
} avr32_canif_cansr_t;



typedef struct avr32_canif_canfc_t {
    unsigned int                 :14;
    unsigned int emode           : 2;
    unsigned int tec             : 8;
    unsigned int rec             : 8;
} avr32_canif_canfc_t;



typedef struct avr32_canif_canier_t {
    unsigned int                 :23;
    unsigned int txokim          : 1;
    unsigned int rxokim          : 1;
    unsigned int wkupim          : 1;
    unsigned int berrim          : 1;
    unsigned int serrim          : 1;
    unsigned int cerrim          : 1;
    unsigned int ferrim          : 1;
    unsigned int aerrim          : 1;
    unsigned int boffim          : 1;
} avr32_canif_canier_t;



typedef struct avr32_canif_canidr_t {
    unsigned int                 :23;
    unsigned int txokim          : 1;
    unsigned int rxokim          : 1;
    unsigned int wkupim          : 1;
    unsigned int berrim          : 1;
    unsigned int serrim          : 1;
    unsigned int cerrim          : 1;
    unsigned int ferrim          : 1;
    unsigned int aerrim          : 1;
    unsigned int boffim          : 1;
} avr32_canif_canidr_t;



typedef struct avr32_canif_canimr_t {
    unsigned int                 :23;
    unsigned int txokim          : 1;
    unsigned int rxokim          : 1;
    unsigned int wkupim          : 1;
    unsigned int berrim          : 1;
    unsigned int serrim          : 1;
    unsigned int cerrim          : 1;
    unsigned int ferrim          : 1;
    unsigned int aerrim          : 1;
    unsigned int boffim          : 1;
} avr32_canif_canimr_t;



typedef struct avr32_canif_caniscr_t {
    unsigned int                 :10;
    unsigned int lsmob           : 6;
    unsigned int                 : 9;
    unsigned int wkup            : 1;
    unsigned int berr            : 1;
    unsigned int serr            : 1;
    unsigned int cerr            : 1;
    unsigned int ferr            : 1;
    unsigned int aerr            : 1;
    unsigned int boff            : 1;
} avr32_canif_caniscr_t;



typedef struct avr32_canif_canisr_t {
    unsigned int                 :10;
    unsigned int lsmob           : 6;
    unsigned int                 : 9;
    unsigned int wkup            : 1;
    unsigned int berr            : 1;
    unsigned int serr            : 1;
    unsigned int cerr            : 1;
    unsigned int ferr            : 1;
    unsigned int aerr            : 1;
    unsigned int boff            : 1;
} avr32_canif_canisr_t;



typedef struct avr32_canif_mobsch_t {
    unsigned int                 :10;
    unsigned int mtxok           : 6;
    unsigned int                 : 2;
    unsigned int mrxok           : 6;
    unsigned int                 : 2;
    unsigned int mav             : 6;
} avr32_canif_mobsch_t;



typedef struct avr32_canif_mobctrl_t {
    unsigned int                 :26;
    unsigned int am              : 1;
    unsigned int dir             : 1;
    unsigned int dlc             : 4;
} avr32_canif_mobctrl_t;



typedef struct avr32_canif_mobscr_t {
    unsigned int                 :28;
    unsigned int ovw             : 1;
    unsigned int dlcw            : 1;
    unsigned int txok            : 1;
    unsigned int rxok            : 1;
} avr32_canif_mobscr_t;



typedef struct avr32_canif_mobsr_t {
    unsigned int                 :28;
    unsigned int ovw             : 1;
    unsigned int dlcw            : 1;
    unsigned int txok            : 1;
    unsigned int rxok            : 1;
} avr32_canif_mobsr_t;


typedef struct avr32_canif_channel_t {
          unsigned long                  canramb   ;//0x0000
  union {
          unsigned long                  cancfg    ;//0x0004
          avr32_canif_cancfg_t           CANCFG    ;
  };
  union {
          unsigned long                  canctrl   ;//0x0008
          avr32_canif_canctrl_t          CANCTRL   ;
  };
  union {
    const unsigned long                  cansr     ;//0x000c
    const avr32_canif_cansr_t            CANSR     ;
  };
  union {
    const unsigned long                  canfc     ;//0x0010
    const avr32_canif_canfc_t            CANFC     ;
  };
  union {
          unsigned long                  canier    ;//0x0014
          avr32_canif_canier_t           CANIER    ;
  };
  union {
          unsigned long                  canidr    ;//0x0018
          avr32_canif_canidr_t           CANIDR    ;
  };
  union {
    const unsigned long                  canimr    ;//0x001c
    const avr32_canif_canimr_t           CANIMR    ;
  };
  union {
          unsigned long                  caniscr   ;//0x0020
          avr32_canif_caniscr_t          CANISCR   ;
  };
  union {
    const unsigned long                  canisr    ;//0x0024
    const avr32_canif_canisr_t           CANISR    ;
  };
  union {
    const unsigned long                  mobsch    ;//0x0028
    const avr32_canif_mobsch_t           MOBSCH    ;
  };
          unsigned long                  mober     ;//0x002c
          unsigned long                  mobdr     ;//0x0030
    const unsigned long                  mobesr    ;//0x0034
          unsigned long                  mobier    ;//0x0038
          unsigned long                  mobidr    ;//0x003c
    const unsigned long                  mobimr    ;//0x0040
          unsigned long                  mrxiscr   ;//0x0044
    const unsigned long                  mrxisr    ;//0x0048
          unsigned long                  mtxiscr   ;//0x004c
    const unsigned long                  mtxisr    ;//0x0050
  union {
          unsigned long                  mobctrl   ;//0x0054
          avr32_canif_mobctrl_t          MOBCTRL   ;
  };
  union {
          unsigned long                  mobscr    ;//0x0058
          avr32_canif_mobscr_t           MOBSCR    ;
  };
  union {
    const unsigned long                  mobsr     ;//0x005c
    const avr32_canif_mobsr_t            MOBSR     ;
  };
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
          unsigned int                   :32       ;//0x00fc
          unsigned int                   :32       ;//0x0100
          unsigned int                   :32       ;//0x0104
          unsigned int                   :32       ;//0x0108
          unsigned int                   :32       ;//0x010c
          unsigned int                   :32       ;//0x0110
          unsigned int                   :32       ;//0x0114
          unsigned int                   :32       ;//0x0118
          unsigned int                   :32       ;//0x011c
          unsigned int                   :32       ;//0x0120
          unsigned int                   :32       ;//0x0124
          unsigned int                   :32       ;//0x0128
          unsigned int                   :32       ;//0x012c
          unsigned int                   :32       ;//0x0130
          unsigned int                   :32       ;//0x0134
          unsigned int                   :32       ;//0x0138
          unsigned int                   :32       ;//0x013c
          unsigned int                   :32       ;//0x0140
          unsigned int                   :32       ;//0x0144
          unsigned int                   :32       ;//0x0148
          unsigned int                   :32       ;//0x014c
          unsigned int                   :32       ;//0x0150
          unsigned int                   :32       ;//0x0154
          unsigned int                   :32       ;//0x0158
          unsigned int                   :32       ;//0x015c
          unsigned int                   :32       ;//0x0160
          unsigned int                   :32       ;//0x0164
          unsigned int                   :32       ;//0x0168
          unsigned int                   :32       ;//0x016c
          unsigned int                   :32       ;//0x0170
          unsigned int                   :32       ;//0x0174
          unsigned int                   :32       ;//0x0178
          unsigned int                   :32       ;//0x017c
          unsigned int                   :32       ;//0x0180
          unsigned int                   :32       ;//0x0184
          unsigned int                   :32       ;//0x0188
          unsigned int                   :32       ;//0x018c
          unsigned int                   :32       ;//0x0190
          unsigned int                   :32       ;//0x0194
          unsigned int                   :32       ;//0x0198
          unsigned int                   :32       ;//0x019c
          unsigned int                   :32       ;//0x01a0
          unsigned int                   :32       ;//0x01a4
          unsigned int                   :32       ;//0x01a8
          unsigned int                   :32       ;//0x01ac
          unsigned int                   :32       ;//0x01b0
          unsigned int                   :32       ;//0x01b4
          unsigned int                   :32       ;//0x01b8
          unsigned int                   :32       ;//0x01bc
          unsigned int                   :32       ;//0x01c0
          unsigned int                   :32       ;//0x01c4
          unsigned int                   :32       ;//0x01c8
          unsigned int                   :32       ;//0x01cc
          unsigned int                   :32       ;//0x01d0
          unsigned int                   :32       ;//0x01d4
          unsigned int                   :32       ;//0x01d8
          unsigned int                   :32       ;//0x01dc
          unsigned int                   :32       ;//0x01e0
          unsigned int                   :32       ;//0x01e4
          unsigned int                   :32       ;//0x01e8
          unsigned int                   :32       ;//0x01ec
          unsigned int                   :32       ;//0x01f0
          unsigned int                   :32       ;//0x01f4
          unsigned int                   :32       ;//0x01f8
          unsigned int                   :32       ;//0x01fc
} avr32_canif_channel_t;


typedef struct avr32_canif_t {
  union {
    const unsigned long                  version   ;//0x0000
    const avr32_canif_version_t          VERSION   ;
  };
  union {
    const unsigned long                  parameter ;//0x0004
    const avr32_canif_parameter_t        PARAMETER ;
  };
  avr32_canif_channel_t channel[AVR32_CANIF_CAN_NB];//0x8
  avr32_canif_channel_t channel_reserved[5 - AVR32_CANIF_CAN_NB];//Padding
} avr32_canif_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_CANIF_110_H_INCLUDED*/
#endif

