/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_CAT_TGBCFG1_DISHIFT                                  28
#define AVR32_CAT_TGBCFG1_DISHIFT_MASK                     0x30000000
#define AVR32_CAT_TGBCFG1_DISHIFT_OFFSET                           28
#define AVR32_CAT_TGBCFG1_DISHIFT_SIZE                              2
#define AVR32_CAT_TGBCFG1_MASK                             0x33ffffff
#define AVR32_CAT_TGBCFG1_MAX                                       0
#define AVR32_CAT_TGBCFG1_MAX_MASK                         0x0000ffff
#define AVR32_CAT_TGBCFG1_MAX_OFFSET                                0
#define AVR32_CAT_TGBCFG1_MAX_SIZE                                 16
#define AVR32_CAT_TGBCFG1_RESETVALUE                       0x00000000
#define AVR32_CAT_TGBCFG1_SPREAD                                   24
#define AVR32_CAT_TGBCFG1_SPREAD_MASK                      0x01000000
#define AVR32_CAT_TGBCFG1_SPREAD_OFFSET                            24
#define AVR32_CAT_TGBCFG1_SPREAD_SIZE                               1
#define AVR32_CAT_TGBCFG1_SYNC                                     25
#define AVR32_CAT_TGBCFG1_SYNC_MASK                        0x02000000
#define AVR32_CAT_TGBCFG1_SYNC_OFFSET                              25
#define AVR32_CAT_TGBCFG1_SYNC_SIZE                                 1
#define AVR32_CAT_TRIM                                              8
#define AVR32_CAT_TRIM_MASK                                0x00001f00
#define AVR32_CAT_TRIM_OFFSET                                       8
#define AVR32_CAT_TRIM_SIZE                                         5
#define AVR32_CAT_VARIANT                                          16
#define AVR32_CAT_VARIANT_MASK                             0x000f0000
#define AVR32_CAT_VARIANT_OFFSET                                   16
#define AVR32_CAT_VARIANT_SIZE                                      4
#define AVR32_CAT_VERSION                                  0x000000fc
#define AVR32_CAT_VERSION_MASK                             0x000f0fff
#define AVR32_CAT_VERSION_OFFSET                                    0
#define AVR32_CAT_VERSION_RESETVALUE                       0x00000000
#define AVR32_CAT_VERSION_SIZE                                     12
#define AVR32_CAT_VERSION_VARIANT                                  16
#define AVR32_CAT_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_CAT_VERSION_VARIANT_OFFSET                           16
#define AVR32_CAT_VERSION_VARIANT_SIZE                              4
#define AVR32_CAT_VERSION_VERSION                                   0
#define AVR32_CAT_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_CAT_VERSION_VERSION_OFFSET                            0
#define AVR32_CAT_VERSION_VERSION_SIZE                             12
#define AVR32_CAT_Y                                                24
#define AVR32_CAT_Y_MASK                                   0xff000000
#define AVR32_CAT_Y_OFFSET                                         24
#define AVR32_CAT_Y_SIZE                                            8




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_cat_ctrl_t {
    unsigned int                 :24;
    unsigned int swrst           : 1;
    unsigned int                 : 6;
    unsigned int en              : 1;
} avr32_cat_ctrl_t;



typedef struct avr32_cat_atpins_t {
    unsigned int                 :23;
    unsigned int aten            : 1;
    unsigned int                 : 3;
    unsigned int atsp            : 5;
} avr32_cat_atpins_t;



typedef struct avr32_cat_pinmode0_t {
    unsigned int                 :15;
    unsigned int sp              :17;
} avr32_cat_pinmode0_t;



typedef struct avr32_cat_pinmode1_t {
    unsigned int                 :15;
    unsigned int sp              :17;
} avr32_cat_pinmode1_t;



typedef struct avr32_cat_atcfg0_t {
    unsigned int div             :16;
    unsigned int chlen           : 8;
    unsigned int selen           : 8;
} avr32_cat_atcfg0_t;



typedef struct avr32_cat_atcfg1_t {
    unsigned int                 : 2;
    unsigned int dishift         : 2;
    unsigned int                 : 2;
    unsigned int sync            : 1;
    unsigned int spread          : 1;
    unsigned int dilen           : 8;
    unsigned int max             :16;
} avr32_cat_atcfg1_t;



typedef struct avr32_cat_atcfg2_t {
    unsigned int                 :12;
    unsigned int filter          : 4;
    unsigned int outsens         : 8;
    unsigned int sense           : 8;
} avr32_cat_atcfg2_t;



typedef struct avr32_cat_atcfg3_t {
    unsigned int                 : 8;
    unsigned int pthr            : 8;
    unsigned int pdrift          : 8;
    unsigned int ndrift          : 8;
} avr32_cat_atcfg3_t;



typedef struct avr32_cat_tgacfg0_t {
    unsigned int div             :16;
    unsigned int chlen           : 8;
    unsigned int selen           : 8;
} avr32_cat_tgacfg0_t;



typedef struct avr32_cat_tgacfg1_t {
    unsigned int                 : 2;
    unsigned int dishift         : 2;
    unsigned int                 : 2;
    unsigned int sync            : 1;
    unsigned int spread          : 1;
    unsigned int dilen           : 8;
    unsigned int max             :16;
} avr32_cat_tgacfg1_t;



typedef struct avr32_cat_tgbcfg0_t {
    unsigned int div             :16;
    unsigned int chlen           : 8;
    unsigned int selen           : 8;
} avr32_cat_tgbcfg0_t;



typedef struct avr32_cat_tgbcfg1_t {
    unsigned int                 : 2;
    unsigned int dishift         : 2;
    unsigned int                 : 2;
    unsigned int sync            : 1;
    unsigned int spread          : 1;
    unsigned int dilen           : 8;
    unsigned int max             :16;
} avr32_cat_tgbcfg1_t;



typedef struct avr32_cat_mgcfg0_t {
    unsigned int div             :16;
    unsigned int chlen           : 8;
    unsigned int selen           : 8;
} avr32_cat_mgcfg0_t;



typedef struct avr32_cat_mgcfg1_t {
    unsigned int                 : 2;
    unsigned int dishift         : 2;
    unsigned int                 : 2;
    unsigned int sync            : 1;
    unsigned int spread          : 1;
    unsigned int dilen           : 8;
    unsigned int max             :16;
} avr32_cat_mgcfg1_t;



typedef struct avr32_cat_mgcfg2_t {
    unsigned int acctrl          : 1;
    unsigned int consen          : 3;
    unsigned int                 : 4;
    unsigned int cxdilen         : 8;
    unsigned int                 : 4;
    unsigned int synctim         :12;
} avr32_cat_mgcfg2_t;



typedef struct avr32_cat_sr_t {
    unsigned int                 :22;
    unsigned int acqdone         : 1;
    unsigned int acready         : 1;
    unsigned int                 : 3;
    unsigned int mblreq          : 1;
    unsigned int atstate         : 1;
    unsigned int atsc            : 1;
    unsigned int atcal           : 1;
    unsigned int enabled         : 1;
} avr32_cat_sr_t;



typedef struct avr32_cat_scr_t {
    unsigned int                 :22;
    unsigned int acqdone         : 1;
    unsigned int acready         : 1;
    unsigned int                 : 5;
    unsigned int atsc            : 1;
    unsigned int atcal           : 1;
    unsigned int                 : 1;
} avr32_cat_scr_t;



typedef struct avr32_cat_ier_t {
    unsigned int                 :22;
    unsigned int acqdone         : 1;
    unsigned int acready         : 1;
    unsigned int                 : 5;
    unsigned int atsc            : 1;
    unsigned int atcal           : 1;
    unsigned int                 : 1;
} avr32_cat_ier_t;



typedef struct avr32_cat_idr_t {
    unsigned int                 :22;
    unsigned int acqdone         : 1;
    unsigned int acready         : 1;
    unsigned int                 : 5;
    unsigned int atsc            : 1;
    unsigned int atcal           : 1;
    unsigned int                 : 1;
} avr32_cat_idr_t;



typedef struct avr32_cat_imr_t {
    unsigned int                 :22;
    unsigned int acqdone         : 1;
    unsigned int acready         : 1;
    unsigned int                 : 5;
    unsigned int atsc            : 1;
    unsigned int atcal           : 1;
    unsigned int                 : 1;
} avr32_cat_imr_t;



typedef struct avr32_cat_aisr_t {
    unsigned int                 :30;
    unsigned int acqsel          : 2;
} avr32_cat_aisr_t;



typedef struct avr32_cat_acount_t {
    unsigned int y               : 8;
    unsigned int sporx           : 8;
    unsigned int count           :16;
} avr32_cat_acount_t;



typedef struct avr32_cat_mblen_t {
    unsigned int burst0          : 8;
    unsigned int burst1          : 8;
    unsigned int burst2          : 8;
    unsigned int burst3          : 8;
} avr32_cat_mblen_t;



typedef struct avr32_cat_dics_t {
    unsigned int fsources        : 8;
    unsigned int glen            : 1;
    unsigned int                 : 5;
    unsigned int intvrefsel      : 1;
    unsigned int intrefsel       : 1;
    unsigned int                 : 3;
    unsigned int trim            : 5;
    unsigned int sources         : 8;
} avr32_cat_dics_t;



typedef struct avr32_cat_sscfg_t {
    unsigned int                 :24;
    unsigned int maxdev          : 8;
} avr32_cat_sscfg_t;



typedef struct avr32_cat_csares_t {
    unsigned int                 :15;
    unsigned int res             :17;
} avr32_cat_csares_t;



typedef struct avr32_cat_csbres_t {
    unsigned int                 :15;
    unsigned int res             :17;
} avr32_cat_csbres_t;



typedef struct avr32_cat_atbase_t {
    unsigned int                 :16;
    unsigned int count           :16;
} avr32_cat_atbase_t;



typedef struct avr32_cat_atcurr_t {
    unsigned int                 :16;
    unsigned int count           :16;
} avr32_cat_atcurr_t;



typedef struct avr32_cat_acshi0_t {
    unsigned int                 :20;
    unsigned int shival          :12;
} avr32_cat_acshi0_t;



typedef struct avr32_cat_acshi1_t {
    unsigned int                 :20;
    unsigned int shival          :12;
} avr32_cat_acshi1_t;



typedef struct avr32_cat_acshi2_t {
    unsigned int                 :20;
    unsigned int shival          :12;
} avr32_cat_acshi2_t;



typedef struct avr32_cat_acshi3_t {
    unsigned int                 :20;
    unsigned int shival          :12;
} avr32_cat_acshi3_t;



typedef struct avr32_cat_acshi4_t {
    unsigned int                 :20;
    unsigned int shival          :12;
} avr32_cat_acshi4_t;



typedef struct avr32_cat_acshi5_t {
    unsigned int                 :20;
    unsigned int shival          :12;
} avr32_cat_acshi5_t;



typedef struct avr32_cat_acshi6_t {
    unsigned int                 :20;
    unsigned int shival          :12;
} avr32_cat_acshi6_t;



typedef struct avr32_cat_acshi7_t {
    unsigned int                 :20;
    unsigned int shival          :12;
} avr32_cat_acshi7_t;



typedef struct avr32_cat_parameter_t {
    unsigned int                 : 8;
    unsigned int sp              :24;
} avr32_cat_parameter_t;



typedef struct avr32_cat_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_cat_version_t;



typedef struct avr32_cat_t {
  union {
          unsigned long                  ctrl      ;//0x0000
          avr32_cat_ctrl_t               CTRL      ;
  };
  union {
          unsigned long                  atpins    ;//0x0004
          avr32_cat_atpins_t             ATPINS    ;
  };
  union {
          unsigned long                  pinmode0  ;//0x0008
          avr32_cat_pinmode0_t           PINMODE0  ;
  };
  union {
          unsigned long                  pinmode1  ;//0x000c
          avr32_cat_pinmode1_t           PINMODE1  ;
  };
  union {
          unsigned long                  atcfg0    ;//0x0010
          avr32_cat_atcfg0_t             ATCFG0    ;
  };
  union {
          unsigned long                  atcfg1    ;//0x0014
          avr32_cat_atcfg1_t             ATCFG1    ;
  };
  union {
          unsigned long                  atcfg2    ;//0x0018
          avr32_cat_atcfg2_t             ATCFG2    ;
  };
  union {
          unsigned long                  atcfg3    ;//0x001c
          avr32_cat_atcfg3_t             ATCFG3    ;
  };
  union {
          unsigned long                  tgacfg0   ;//0x0020
          avr32_cat_tgacfg0_t            TGACFG0   ;
  };
  union {
          unsigned long                  tgacfg1   ;//0x0024
          avr32_cat_tgacfg1_t            TGACFG1   ;
  };
  union {
          unsigned long                  tgbcfg0   ;//0x0028
          avr32_cat_tgbcfg0_t            TGBCFG0   ;
  };
  union {
          unsigned long                  tgbcfg1   ;//0x002c
          avr32_cat_tgbcfg1_t            TGBCFG1   ;
  };
  union {
          unsigned long                  mgcfg0    ;//0x0030
          avr32_cat_mgcfg0_t             MGCFG0    ;
  };
  union {
          unsigned long                  mgcfg1    ;//0x0034
          avr32_cat_mgcfg1_t             MGCFG1    ;
  };
  union {
          unsigned long                  mgcfg2    ;//0x0038
          avr32_cat_mgcfg2_t             MGCFG2    ;
  };
  union {
    const unsigned long                  sr        ;//0x003c
    const avr32_cat_sr_t                 SR        ;
  };
  union {
          unsigned long                  scr       ;//0x0040
          avr32_cat_scr_t                SCR       ;
  };
  union {
          unsigned long                  ier       ;//0x0044
          avr32_cat_ier_t                IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0048
          avr32_cat_idr_t                IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x004c
    const avr32_cat_imr_t                IMR       ;
  };
  union {
          unsigned long                  aisr      ;//0x0050
          avr32_cat_aisr_t               AISR      ;
  };
  union {
    const unsigned long                  acount    ;//0x0054
    const avr32_cat_acount_t             ACOUNT    ;
  };
  union {
          unsigned long                  mblen     ;//0x0058
          avr32_cat_mblen_t              MBLEN     ;
  };
  union {
          unsigned long                  dics      ;//0x005c
          avr32_cat_dics_t               DICS      ;
  };
  union {
          unsigned long                  sscfg     ;//0x0060
          avr32_cat_sscfg_t              SSCFG     ;
  };
  union {
          unsigned long                  csares    ;//0x0064
          avr32_cat_csares_t             CSARES    ;
  };
  union {
          unsigned long                  csbres    ;//0x0068
          avr32_cat_csbres_t             CSBRES    ;
  };
  union {
    const unsigned long                  atbase    ;//0x006c
    const avr32_cat_atbase_t             ATBASE    ;
  };
  union {
    const unsigned long                  atcurr    ;//0x0070
    const avr32_cat_atcurr_t             ATCURR    ;
  };
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
  union {
          unsigned long                  acshi0    ;//0x0080
          avr32_cat_acshi0_t             ACSHI0    ;
  };
  union {
          unsigned long                  acshi1    ;//0x0084
          avr32_cat_acshi1_t             ACSHI1    ;
  };
  union {
          unsigned long                  acshi2    ;//0x0088
          avr32_cat_acshi2_t             ACSHI2    ;
  };
  union {
          unsigned long                  acshi3    ;//0x008c
          avr32_cat_acshi3_t             ACSHI3    ;
  };
  union {
          unsigned long                  acshi4    ;//0x0090
          avr32_cat_acshi4_t             ACSHI4    ;
  };
  union {
          unsigned long                  acshi5    ;//0x0094
          avr32_cat_acshi5_t             ACSHI5    ;
  };
  union {
          unsigned long                  acshi6    ;//0x0098
          avr32_cat_acshi6_t             ACSHI6    ;
  };
  union {
          unsigned long                  acshi7    ;//0x009c
          avr32_cat_acshi7_t             ACSHI7    ;
  };
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
  union {
    const unsigned long                  parameter ;//0x00f8
    const avr32_cat_parameter_t          PARAMETER ;
  };
  union {
    const unsigned long                  version   ;//0x00fc
    const avr32_cat_version_t            VERSION   ;
  };
} avr32_cat_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_CAT_200_H_INCLUDED*/
#endif

