/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_DACIFB_TRA_TRL_MASK                             0x80000000
#define AVR32_DACIFB_TRA_TRL_OFFSET                                   31
#define AVR32_DACIFB_TRA_TRL_SIZE                                      1
#define AVR32_DACIFB_TRB                                      0x0000003c
#define AVR32_DACIFB_TRBE                                             25
#define AVR32_DACIFB_TRBE_MASK                                0x02000000
#define AVR32_DACIFB_TRBE_OFFSET                                      25
#define AVR32_DACIFB_TRBE_SIZE                                         1
#define AVR32_DACIFB_TRB_MASK                                 0x800000ff
#define AVR32_DACIFB_TRB_RESETVALUE                           0x00000000
#define AVR32_DACIFB_TRB_TCD                                           0
#define AVR32_DACIFB_TRB_TCD_MASK                             0x000000ff
#define AVR32_DACIFB_TRB_TCD_OFFSET                                    0
#define AVR32_DACIFB_TRB_TCD_SIZE                                      8
#define AVR32_DACIFB_TRB_TRL                                          31
#define AVR32_DACIFB_TRB_TRL_MASK                             0x80000000
#define AVR32_DACIFB_TRB_TRL_OFFSET                                   31
#define AVR32_DACIFB_TRB_TRL_SIZE                                      1
#define AVR32_DACIFB_TRL                                              31
#define AVR32_DACIFB_TRL_MASK                                 0x80000000
#define AVR32_DACIFB_TRL_OFFSET                                       31
#define AVR32_DACIFB_TRL_SIZE                                          1
#define AVR32_DACIFB_UA                                                8
#define AVR32_DACIFB_UA_MASK                                  0x00000100
#define AVR32_DACIFB_UA_OFFSET                                         8
#define AVR32_DACIFB_UA_SIZE                                           1
#define AVR32_DACIFB_UB                                                9
#define AVR32_DACIFB_UB_MASK                                  0x00000200
#define AVR32_DACIFB_UB_OFFSET                                         9
#define AVR32_DACIFB_UB_SIZE                                           1
#define AVR32_DACIFB_VER                                               0
#define AVR32_DACIFB_VERSION                                  0x00000040
#define AVR32_DACIFB_VERSION_MASK                             0x00000fff
#define AVR32_DACIFB_VERSION_RESETVALUE                       0x00000000
#define AVR32_DACIFB_VERSION_VER                                       0
#define AVR32_DACIFB_VERSION_VER_MASK                         0x00000fff
#define AVR32_DACIFB_VERSION_VER_OFFSET                                0
#define AVR32_DACIFB_VERSION_VER_SIZE                                 12
#define AVR32_DACIFB_VER_MASK                                 0x00000fff
#define AVR32_DACIFB_VER_OFFSET                                        0
#define AVR32_DACIFB_VER_SIZE                                         12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_dacifb_cr_t {
    unsigned int                 : 4;
    unsigned int arbe            : 1;
    unsigned int arae            : 1;
    unsigned int trbe            : 1;
    unsigned int trae            : 1;
    unsigned int                 : 6;
    unsigned int boe             : 1;
    unsigned int aoe             : 1;
    unsigned int                 :15;
    unsigned int en              : 1;
} avr32_dacifb_cr_t;



typedef struct avr32_dacifb_cfr_t {
    unsigned int                 : 6;
    unsigned int chc             : 2;
    unsigned int                 : 6;
    unsigned int abe             : 1;
    unsigned int aae             : 1;
    unsigned int                 : 7;
    unsigned int ref             : 1;
    unsigned int                 : 5;
    unsigned int dse             : 1;
    unsigned int dda             : 1;
    unsigned int lp              : 1;
} avr32_dacifb_cfr_t;



typedef struct avr32_dacifb_ecr_t {
    unsigned int                 :23;
    unsigned int eslb            : 1;
    unsigned int                 : 7;
    unsigned int esla            : 1;
} avr32_dacifb_ecr_t;



typedef struct avr32_dacifb_tcr_t {
    unsigned int                 : 5;
    unsigned int presc           : 3;
    unsigned int                 : 1;
    unsigned int chi             : 7;
    unsigned int                 : 4;
    unsigned int chrb            : 4;
    unsigned int                 : 4;
    unsigned int chra            : 4;
} avr32_dacifb_tcr_t;



typedef struct avr32_dacifb_ier_t {
    unsigned int                 :14;
    unsigned int deb             : 1;
    unsigned int dea             : 1;
    unsigned int                 : 6;
    unsigned int ub              : 1;
    unsigned int ua              : 1;
    unsigned int                 : 6;
    unsigned int ob              : 1;
    unsigned int oa              : 1;
} avr32_dacifb_ier_t;



typedef struct avr32_dacifb_idr_t {
    unsigned int                 :14;
    unsigned int deb             : 1;
    unsigned int dea             : 1;
    unsigned int                 : 6;
    unsigned int ub              : 1;
    unsigned int ua              : 1;
    unsigned int                 : 6;
    unsigned int ob              : 1;
    unsigned int oa              : 1;
} avr32_dacifb_idr_t;



typedef struct avr32_dacifb_imr_t {
    unsigned int                 :14;
    unsigned int deb             : 1;
    unsigned int dea             : 1;
    unsigned int                 : 6;
    unsigned int ub              : 1;
    unsigned int ua              : 1;
    unsigned int                 : 6;
    unsigned int ob              : 1;
    unsigned int oa              : 1;
} avr32_dacifb_imr_t;



typedef struct avr32_dacifb_sr_t {
    unsigned int                 :14;
    unsigned int deb             : 1;
    unsigned int dea             : 1;
    unsigned int                 : 6;
    unsigned int ub              : 1;
    unsigned int ua              : 1;
    unsigned int                 : 6;
    unsigned int ob              : 1;
    unsigned int oa              : 1;
} avr32_dacifb_sr_t;



typedef struct avr32_dacifb_scr_t {
    unsigned int                 :14;
    unsigned int deb             : 1;
    unsigned int dea             : 1;
    unsigned int                 : 6;
    unsigned int ub              : 1;
    unsigned int ua              : 1;
    unsigned int                 : 6;
    unsigned int ob              : 1;
    unsigned int oa              : 1;
} avr32_dacifb_scr_t;



typedef struct avr32_dacifb_drca_t {
    unsigned int                 :20;
    unsigned int dsd             : 1;
    unsigned int dsv             : 3;
    unsigned int                 : 7;
    unsigned int drn             : 1;
} avr32_dacifb_drca_t;



typedef struct avr32_dacifb_drcb_t {
    unsigned int                 :20;
    unsigned int dsd             : 1;
    unsigned int dsv             : 3;
    unsigned int                 : 7;
    unsigned int drn             : 1;
} avr32_dacifb_drcb_t;



typedef struct avr32_dacifb_dr0_t {
    unsigned int dcb             :16;
    unsigned int dca             :16;
} avr32_dacifb_dr0_t;



typedef struct avr32_dacifb_dr1_t {
    unsigned int                 :16;
    unsigned int dcb             :16;
} avr32_dacifb_dr1_t;



typedef struct avr32_dacifb_goc_t {
    unsigned int                 :17;
    unsigned int gcr             : 7;
    unsigned int                 : 1;
    unsigned int ocr             : 7;
} avr32_dacifb_goc_t;



typedef struct avr32_dacifb_tra_t {
    unsigned int trl             : 1;
    unsigned int                 :23;
    unsigned int tcd             : 8;
} avr32_dacifb_tra_t;



typedef struct avr32_dacifb_trb_t {
    unsigned int trl             : 1;
    unsigned int                 :23;
    unsigned int tcd             : 8;
} avr32_dacifb_trb_t;



typedef struct avr32_dacifb_version_t {
    unsigned int                 :20;
    unsigned int ver             :12;
} avr32_dacifb_version_t;



typedef struct avr32_dacifb_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_dacifb_cr_t              CR        ;
  };
  union {
          unsigned long                  cfr       ;//0x0004
          avr32_dacifb_cfr_t             CFR       ;
  };
  union {
          unsigned long                  ecr       ;//0x0008
          avr32_dacifb_ecr_t             ECR       ;
  };
  union {
          unsigned long                  tcr       ;//0x000c
          avr32_dacifb_tcr_t             TCR       ;
  };
  union {
          unsigned long                  ier       ;//0x0010
          avr32_dacifb_ier_t             IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0014
          avr32_dacifb_idr_t             IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0018
    const avr32_dacifb_imr_t             IMR       ;
  };
  union {
    const unsigned long                  sr        ;//0x001c
    const avr32_dacifb_sr_t              SR        ;
  };
  union {
          unsigned long                  scr       ;//0x0020
          avr32_dacifb_scr_t             SCR       ;
  };
  union {
          unsigned long                  drca      ;//0x0024
          avr32_dacifb_drca_t            DRCA      ;
  };
  union {
          unsigned long                  drcb      ;//0x0028
          avr32_dacifb_drcb_t            DRCB      ;
  };
  union {
          unsigned long                  dr0       ;//0x002c
          avr32_dacifb_dr0_t             DR0       ;
  };
  union {
          unsigned long                  dr1       ;//0x0030
          avr32_dacifb_dr1_t             DR1       ;
  };
  union {
          unsigned long                  goc       ;//0x0034
          avr32_dacifb_goc_t             GOC       ;
  };
  union {
          unsigned long                  tra       ;//0x0038
          avr32_dacifb_tra_t             TRA       ;
  };
  union {
          unsigned long                  trb       ;//0x003c
          avr32_dacifb_trb_t             TRB       ;
  };
  union {
    const unsigned long                  version   ;//0x0040
    const avr32_dacifb_version_t         VERSION   ;
  };
} avr32_dacifb_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_DACIFB_100_H_INCLUDED*/
#endif

