/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_DMACA_STATUSSRCTRAN_STATUS0_SIZE                        1
#define AVR32_DMACA_STATUSSRCTRAN_STATUS1                             1
#define AVR32_DMACA_STATUSSRCTRAN_STATUS1_MASK               0x00000002
#define AVR32_DMACA_STATUSSRCTRAN_STATUS1_OFFSET                      1
#define AVR32_DMACA_STATUSSRCTRAN_STATUS1_SIZE                        1
#define AVR32_DMACA_STATUSSRCTRAN_STATUS2                             2
#define AVR32_DMACA_STATUSSRCTRAN_STATUS2_MASK               0x00000004
#define AVR32_DMACA_STATUSSRCTRAN_STATUS2_OFFSET                      2
#define AVR32_DMACA_STATUSSRCTRAN_STATUS2_SIZE                        1
#define AVR32_DMACA_STATUSTFR                                0x000002e8
#define AVR32_DMACA_STATUSTFR_STATUS0                                 0
#define AVR32_DMACA_STATUSTFR_STATUS0_MASK                   0x00000001
#define AVR32_DMACA_STATUSTFR_STATUS0_OFFSET                          0
#define AVR32_DMACA_STATUSTFR_STATUS0_SIZE                            1
#define AVR32_DMACA_STATUSTFR_STATUS1                                 1
#define AVR32_DMACA_STATUSTFR_STATUS1_MASK                   0x00000002
#define AVR32_DMACA_STATUSTFR_STATUS1_OFFSET                          1
#define AVR32_DMACA_STATUSTFR_STATUS1_SIZE                            1
#define AVR32_DMACA_STATUSTFR_STATUS2                                 2
#define AVR32_DMACA_STATUSTFR_STATUS2_MASK                   0x00000004
#define AVR32_DMACA_STATUSTFR_STATUS2_OFFSET                          2
#define AVR32_DMACA_STATUSTFR_STATUS2_SIZE                            1
#define AVR32_DMACA_S_GATH_EN                                        17
#define AVR32_DMACA_S_GATH_EN_MASK                           0x00020000
#define AVR32_DMACA_S_GATH_EN_OFFSET                                 17
#define AVR32_DMACA_S_GATH_EN_SIZE                                    1
#define AVR32_DMACA_S_SG_REQ                                          0
#define AVR32_DMACA_S_SG_REQ_MASK                            0x000000ff
#define AVR32_DMACA_S_SG_REQ_OFFSET                                   0
#define AVR32_DMACA_S_SG_REQ_SIZE                                     8
#define AVR32_DMACA_TEST_SLV_IF                                       0
#define AVR32_DMACA_TEST_SLV_IF_MASK                         0x00000001
#define AVR32_DMACA_TEST_SLV_IF_OFFSET                                0
#define AVR32_DMACA_TEST_SLV_IF_SIZE                                  1
#define AVR32_DMACA_TFR                                               0
#define AVR32_DMACA_TFR_MASK                                 0x00000001
#define AVR32_DMACA_TFR_OFFSET                                        0
#define AVR32_DMACA_TFR_SIZE                                          1
#define AVR32_DMACA_TT_FC                                            20
#define AVR32_DMACA_TT_FC_MASK                               0x00700000
#define AVR32_DMACA_TT_FC_OFFSET                                     20
#define AVR32_DMACA_TT_FC_SIZE                                        3




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_dmaca_llp0_t {
    unsigned int loc             :30;
    unsigned int lms             : 2;
} avr32_dmaca_llp0_t;



typedef struct avr32_dmaca_ctl0l_t {
    unsigned int                 : 3;
    unsigned int llp_s_en        : 1;
    unsigned int llp_d_en        : 1;
    unsigned int sms             : 2;
    unsigned int dms             : 2;
    unsigned int tt_fc           : 3;
    unsigned int                 : 1;
    unsigned int d_scat_en       : 1;
    unsigned int s_gath_en       : 1;
    unsigned int src_msize       : 3;
    unsigned int dst_msize       : 3;
    unsigned int sinc            : 2;
    unsigned int dinc            : 2;
    unsigned int src_tr_width    : 3;
    unsigned int dst_tr_width    : 3;
    unsigned int int_en          : 1;
} avr32_dmaca_ctl0l_t;



typedef struct avr32_dmaca_ctl0h_t {
    unsigned int                 :19;
    unsigned int done            : 1;
    unsigned int block_ts        :12;
} avr32_dmaca_ctl0h_t;



typedef struct avr32_dmaca_cfg0l_t {
    unsigned int reload_ds       : 1;
    unsigned int reload_sr       : 1;
    unsigned int max_abrst       :10;
    unsigned int sr_hs_pol       : 1;
    unsigned int ds_hs_pol       : 1;
    unsigned int lock_b          : 1;
    unsigned int lock_ch         : 1;
    unsigned int lock_b_l        : 2;
    unsigned int lock_ch_l       : 2;
    unsigned int hs_sel_src      : 1;
    unsigned int hs_sel_dst      : 1;
    unsigned int fifo_empty      : 1;
    unsigned int ch_susp         : 1;
    unsigned int ch_prior        : 3;
    unsigned int                 : 5;
} avr32_dmaca_cfg0l_t;



typedef struct avr32_dmaca_cfg0h_t {
    unsigned int                 :17;
    unsigned int dest_per        : 4;
    unsigned int src_per         : 4;
    unsigned int ss_upd_en       : 1;
    unsigned int ds_upd_en       : 1;
    unsigned int protctl         : 3;
    unsigned int fifo_mode       : 1;
    unsigned int fcmode          : 1;
} avr32_dmaca_cfg0h_t;



typedef struct avr32_dmaca_llp1_t {
    unsigned int loc             :30;
    unsigned int lms             : 2;
} avr32_dmaca_llp1_t;



typedef struct avr32_dmaca_ctl1l_t {
    unsigned int                 : 3;
    unsigned int llp_s_en        : 1;
    unsigned int llp_d_en        : 1;
    unsigned int sms             : 2;
    unsigned int dms             : 2;
    unsigned int tt_fc           : 3;
    unsigned int                 : 1;
    unsigned int d_scat_en       : 1;
    unsigned int s_gath_en       : 1;
    unsigned int src_msize       : 3;
    unsigned int dst_msize       : 3;
    unsigned int sinc            : 2;
    unsigned int dinc            : 2;
    unsigned int src_tr_width    : 3;
    unsigned int dst_tr_width    : 3;
    unsigned int int_en          : 1;
} avr32_dmaca_ctl1l_t;



typedef struct avr32_dmaca_ctl1h_t {
    unsigned int                 :19;
    unsigned int done            : 1;
    unsigned int block_ts        :12;
} avr32_dmaca_ctl1h_t;



typedef struct avr32_dmaca_cfg1l_t {
    unsigned int reload_ds       : 1;
    unsigned int reload_sr       : 1;
    unsigned int max_abrst       :10;
    unsigned int sr_hs_pol       : 1;
    unsigned int ds_hs_pol       : 1;
    unsigned int lock_b          : 1;
    unsigned int lock_ch         : 1;
    unsigned int lock_b_l        : 2;
    unsigned int lock_ch_l       : 2;
    unsigned int hs_sel_src      : 1;
    unsigned int hs_sel_dst      : 1;
    unsigned int fifo_empty      : 1;
    unsigned int ch_susp         : 1;
    unsigned int ch_prior        : 3;
    unsigned int                 : 5;
} avr32_dmaca_cfg1l_t;



typedef struct avr32_dmaca_cfg1h_t {
    unsigned int                 :17;
    unsigned int dest_per        : 4;
    unsigned int src_per         : 4;
    unsigned int ss_upd_en       : 1;
    unsigned int ds_upd_en       : 1;
    unsigned int protctl         : 3;
    unsigned int fifo_mode       : 1;
    unsigned int fcmode          : 1;
} avr32_dmaca_cfg1h_t;



typedef struct avr32_dmaca_llp2_t {
    unsigned int loc             :30;
    unsigned int lms             : 2;
} avr32_dmaca_llp2_t;



typedef struct avr32_dmaca_ctl2l_t {
    unsigned int                 : 3;
    unsigned int llp_s_en        : 1;
    unsigned int llp_d_en        : 1;
    unsigned int sms             : 2;
    unsigned int dms             : 2;
    unsigned int tt_fc           : 3;
    unsigned int                 : 1;
    unsigned int d_scat_en       : 1;
    unsigned int s_gath_en       : 1;
    unsigned int src_msize       : 3;
    unsigned int dst_msize       : 3;
    unsigned int sinc            : 2;
    unsigned int dinc            : 2;
    unsigned int src_tr_width    : 3;
    unsigned int dst_tr_width    : 3;
    unsigned int int_en          : 1;
} avr32_dmaca_ctl2l_t;



typedef struct avr32_dmaca_ctl2h_t {
    unsigned int                 :19;
    unsigned int done            : 1;
    unsigned int block_ts        :12;
} avr32_dmaca_ctl2h_t;



typedef struct avr32_dmaca_cfg2l_t {
    unsigned int reload_ds       : 1;
    unsigned int reload_sr       : 1;
    unsigned int max_abrst       :10;
    unsigned int sr_hs_pol       : 1;
    unsigned int ds_hs_pol       : 1;
    unsigned int lock_b          : 1;
    unsigned int lock_ch         : 1;
    unsigned int lock_b_l        : 2;
    unsigned int lock_ch_l       : 2;
    unsigned int hs_sel_src      : 1;
    unsigned int hs_sel_dst      : 1;
    unsigned int fifo_empty      : 1;
    unsigned int ch_susp         : 1;
    unsigned int ch_prior        : 3;
    unsigned int                 : 5;
} avr32_dmaca_cfg2l_t;



typedef struct avr32_dmaca_cfg2h_t {
    unsigned int                 :17;
    unsigned int dest_per        : 4;
    unsigned int src_per         : 4;
    unsigned int ss_upd_en       : 1;
    unsigned int ds_upd_en       : 1;
    unsigned int protctl         : 3;
    unsigned int fifo_mode       : 1;
    unsigned int fcmode          : 1;
} avr32_dmaca_cfg2h_t;



typedef struct avr32_dmaca_rawtfr_t {
    unsigned int                 :29;
    unsigned int raw2            : 1;
    unsigned int raw1            : 1;
    unsigned int raw0            : 1;
} avr32_dmaca_rawtfr_t;



typedef struct avr32_dmaca_rawblock_t {
    unsigned int                 :29;
    unsigned int raw2            : 1;
    unsigned int raw1            : 1;
    unsigned int raw0            : 1;
} avr32_dmaca_rawblock_t;



typedef struct avr32_dmaca_rawsrctran_t {
    unsigned int                 :29;
    unsigned int raw2            : 1;
    unsigned int raw1            : 1;
    unsigned int raw0            : 1;
} avr32_dmaca_rawsrctran_t;



typedef struct avr32_dmaca_rawdsttran_t {
    unsigned int                 :29;
    unsigned int raw2            : 1;
    unsigned int raw1            : 1;
    unsigned int raw0            : 1;
} avr32_dmaca_rawdsttran_t;



typedef struct avr32_dmaca_rawerr_t {
    unsigned int                 :29;
    unsigned int raw2            : 1;
    unsigned int raw1            : 1;
    unsigned int raw0            : 1;
} avr32_dmaca_rawerr_t;



typedef struct avr32_dmaca_statustfr_t {
    unsigned int                 :29;
    unsigned int status2         : 1;
    unsigned int status1         : 1;
    unsigned int status0         : 1;
} avr32_dmaca_statustfr_t;



typedef struct avr32_dmaca_statusblock_t {
    unsigned int                 :29;
    unsigned int status2         : 1;
    unsigned int status1         : 1;
    unsigned int status0         : 1;
} avr32_dmaca_statusblock_t;



typedef struct avr32_dmaca_statussrctran_t {
    unsigned int                 :29;
    unsigned int status2         : 1;
    unsigned int status1         : 1;
    unsigned int status0         : 1;
} avr32_dmaca_statussrctran_t;



typedef struct avr32_dmaca_statusdsttran_t {
    unsigned int                 :29;
    unsigned int status2         : 1;
    unsigned int status1         : 1;
    unsigned int status0         : 1;
} avr32_dmaca_statusdsttran_t;



typedef struct avr32_dmaca_statuserr_t {
    unsigned int                 :29;
    unsigned int status2         : 1;
    unsigned int status1         : 1;
    unsigned int status0         : 1;
} avr32_dmaca_statuserr_t;



typedef struct avr32_dmaca_masktfr_t {
    unsigned int                 :21;
    unsigned int int_m_we2       : 1;
    unsigned int int_m_we1       : 1;
    unsigned int int_m_we0       : 1;
    unsigned int                 : 5;
    unsigned int int_mask2       : 1;
    unsigned int int_mask1       : 1;
    unsigned int int_mask0       : 1;
} avr32_dmaca_masktfr_t;



typedef struct avr32_dmaca_maskblock_t {
    unsigned int                 :21;
    unsigned int int_m_we2       : 1;
    unsigned int int_m_we1       : 1;
    unsigned int int_m_we0       : 1;
    unsigned int                 : 5;
    unsigned int int_mask2       : 1;
    unsigned int int_mask1       : 1;
    unsigned int int_mask0       : 1;
} avr32_dmaca_maskblock_t;



typedef struct avr32_dmaca_masksrctran_t {
    unsigned int                 :21;
    unsigned int int_m_we2       : 1;
    unsigned int int_m_we1       : 1;
    unsigned int int_m_we0       : 1;
    unsigned int                 : 5;
    unsigned int int_mask2       : 1;
    unsigned int int_mask1       : 1;
    unsigned int int_mask0       : 1;
} avr32_dmaca_masksrctran_t;



typedef struct avr32_dmaca_maskdsttran_t {
    unsigned int                 :21;
    unsigned int int_m_we2       : 1;
    unsigned int int_m_we1       : 1;
    unsigned int int_m_we0       : 1;
    unsigned int                 : 5;
    unsigned int int_mask2       : 1;
    unsigned int int_mask1       : 1;
    unsigned int int_mask0       : 1;
} avr32_dmaca_maskdsttran_t;



typedef struct avr32_dmaca_maskerr_t {
    unsigned int                 :21;
    unsigned int int_m_we2       : 1;
    unsigned int int_m_we1       : 1;
    unsigned int int_m_we0       : 1;
    unsigned int                 : 5;
    unsigned int int_mask2       : 1;
    unsigned int int_mask1       : 1;
    unsigned int int_mask0       : 1;
} avr32_dmaca_maskerr_t;



typedef struct avr32_dmaca_cleartfr_t {
    unsigned int                 :29;
    unsigned int clear2          : 1;
    unsigned int clear1          : 1;
    unsigned int clear0          : 1;
} avr32_dmaca_cleartfr_t;



typedef struct avr32_dmaca_clearblock_t {
    unsigned int                 :29;
    unsigned int clear2          : 1;
    unsigned int clear1          : 1;
    unsigned int clear0          : 1;
} avr32_dmaca_clearblock_t;



typedef struct avr32_dmaca_clearsrctran_t {
    unsigned int                 :29;
    unsigned int clear2          : 1;
    unsigned int clear1          : 1;
    unsigned int clear0          : 1;
} avr32_dmaca_clearsrctran_t;



typedef struct avr32_dmaca_cleardsttran_t {
    unsigned int                 :29;
    unsigned int clear2          : 1;
    unsigned int clear1          : 1;
    unsigned int clear0          : 1;
} avr32_dmaca_cleardsttran_t;



typedef struct avr32_dmaca_clearerr_t {
    unsigned int                 :29;
    unsigned int clear2          : 1;
    unsigned int clear1          : 1;
    unsigned int clear0          : 1;
} avr32_dmaca_clearerr_t;



typedef struct avr32_dmaca_statusint_t {
    unsigned int                 :27;
    unsigned int err             : 1;
    unsigned int dstt            : 1;
    unsigned int srct            : 1;
    unsigned int block           : 1;
    unsigned int tfr             : 1;
} avr32_dmaca_statusint_t;



typedef struct avr32_dmaca_reqsrcreg_t {
    unsigned int                 :16;
    unsigned int req_we          : 8;
    unsigned int src_req         : 8;
} avr32_dmaca_reqsrcreg_t;



typedef struct avr32_dmaca_reqdstreg_t {
    unsigned int                 :16;
    unsigned int req_we          : 8;
    unsigned int dst_req         : 8;
} avr32_dmaca_reqdstreg_t;



typedef struct avr32_dmaca_sglreqsrcreg_t {
    unsigned int                 :16;
    unsigned int req_we          : 8;
    unsigned int s_sg_req        : 8;
} avr32_dmaca_sglreqsrcreg_t;



typedef struct avr32_dmaca_sglreqdstreg_t {
    unsigned int                 :16;
    unsigned int req_we          : 8;
    unsigned int d_sg_req        : 8;
} avr32_dmaca_sglreqdstreg_t;



typedef struct avr32_dmaca_lstsrcreqreg_t {
    unsigned int                 :16;
    unsigned int lstsr_we        : 8;
    unsigned int lstsrc          : 8;
} avr32_dmaca_lstsrcreqreg_t;



typedef struct avr32_dmaca_lstdstreqreg_t {
    unsigned int                 :16;
    unsigned int lstds_we        : 8;
    unsigned int lstdst          : 8;
} avr32_dmaca_lstdstreqreg_t;



typedef struct avr32_dmaca_dmacfgreg_t {
    unsigned int                 :31;
    unsigned int dma_en          : 1;
} avr32_dmaca_dmacfgreg_t;



typedef struct avr32_dmaca_chenreg_t {
    unsigned int                 :16;
    unsigned int ch_en_we        : 8;
    unsigned int ch_en           : 8;
} avr32_dmaca_chenreg_t;



typedef struct avr32_dmaca_dmatestreg_t {
    unsigned int                 :31;
    unsigned int test_slv_if     : 1;
} avr32_dmaca_dmatestreg_t;



typedef struct avr32_dmaca_t {
          unsigned long                  sar0      ;//0x0000
          unsigned int                   :32       ;//0x0004
          unsigned long                  dar0      ;//0x0008
          unsigned int                   :32       ;//0x000c
  union {
          unsigned long                  llp0      ;//0x0010
          avr32_dmaca_llp0_t             LLP0      ;
  };
          unsigned int                   :32       ;//0x0014
  union {
          unsigned long                  ctl0l     ;//0x0018
          avr32_dmaca_ctl0l_t            CTL0L     ;
  };
  union {
          unsigned long                  ctl0h     ;//0x001c
          avr32_dmaca_ctl0h_t            CTL0H     ;
  };
          unsigned int                   :32       ;//0x0020
          unsigned int                   :32       ;//0x0024
          unsigned int                   :32       ;//0x0028
          unsigned int                   :32       ;//0x002c
          unsigned int                   :32       ;//0x0030
          unsigned int                   :32       ;//0x0034
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
  union {
          unsigned long                  cfg0l     ;//0x0040
          avr32_dmaca_cfg0l_t            CFG0L     ;
  };
  union {
          unsigned long                  cfg0h     ;//0x0044
          avr32_dmaca_cfg0h_t            CFG0H     ;
  };
          unsigned int                   :32       ;//0x0048
          unsigned int                   :32       ;//0x004c
          unsigned int                   :32       ;//0x0050
          unsigned int                   :32       ;//0x0054
          unsigned long                  sar1      ;//0x0058
          unsigned int                   :32       ;//0x005c
          unsigned long                  dar1      ;//0x0060
          unsigned int                   :32       ;//0x0064
  union {
          unsigned long                  llp1      ;//0x0068
          avr32_dmaca_llp1_t             LLP1      ;
  };
          unsigned int                   :32       ;//0x006c
  union {
          unsigned long                  ctl1l     ;//0x0070
          avr32_dmaca_ctl1l_t            CTL1L     ;
  };
  union {
          unsigned long                  ctl1h     ;//0x0074
          avr32_dmaca_ctl1h_t            CTL1H     ;
  };
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
  union {
          unsigned long                  cfg1l     ;//0x0098
          avr32_dmaca_cfg1l_t            CFG1L     ;
  };
  union {
          unsigned long                  cfg1h     ;//0x009c
          avr32_dmaca_cfg1h_t            CFG1H     ;
  };
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned long                  sar2      ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned long                  dar2      ;//0x00b8
          unsigned int                   :32       ;//0x00bc
  union {
          unsigned long                  llp2      ;//0x00c0
          avr32_dmaca_llp2_t             LLP2      ;
  };
          unsigned int                   :32       ;//0x00c4
  union {
          unsigned long                  ctl2l     ;//0x00c8
          avr32_dmaca_ctl2l_t            CTL2L     ;
  };
  union {
          unsigned long                  ctl2h     ;//0x00cc
          avr32_dmaca_ctl2h_t            CTL2H     ;
  };
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
  union {
          unsigned long                  cfg2l     ;//0x00f0
          avr32_dmaca_cfg2l_t            CFG2L     ;
  };
  union {
          unsigned long                  cfg2h     ;//0x00f4
          avr32_dmaca_cfg2h_t            CFG2H     ;
  };
          unsigned int                   :32       ;//0x00f8
          unsigned int                   :32       ;//0x00fc
          unsigned int                   :32       ;//0x0100
          unsigned int                   :32       ;//0x0104
          unsigned int                   :32       ;//0x0108
          unsigned int                   :32       ;//0x010c
          unsigned int                   :32       ;//0x0110
          unsigned int                   :32       ;//0x0114
          unsigned int                   :32       ;//0x0118
          unsigned int                   :32       ;//0x011c
          unsigned int                   :32       ;//0x0120
          unsigned int                   :32       ;//0x0124
          unsigned int                   :32       ;//0x0128
          unsigned int                   :32       ;//0x012c
          unsigned int                   :32       ;//0x0130
          unsigned int                   :32       ;//0x0134
          unsigned int                   :32       ;//0x0138
          unsigned int                   :32       ;//0x013c
          unsigned int                   :32       ;//0x0140
          unsigned int                   :32       ;//0x0144
          unsigned int                   :32       ;//0x0148
          unsigned int                   :32       ;//0x014c
          unsigned int                   :32       ;//0x0150
          unsigned int                   :32       ;//0x0154
          unsigned int                   :32       ;//0x0158
          unsigned int                   :32       ;//0x015c
          unsigned int                   :32       ;//0x0160
          unsigned int                   :32       ;//0x0164
          unsigned int                   :32       ;//0x0168
          unsigned int                   :32       ;//0x016c
          unsigned int                   :32       ;//0x0170
          unsigned int                   :32       ;//0x0174
          unsigned int                   :32       ;//0x0178
          unsigned int                   :32       ;//0x017c
          unsigned int                   :32       ;//0x0180
          unsigned int                   :32       ;//0x0184
          unsigned int                   :32       ;//0x0188
          unsigned int                   :32       ;//0x018c
          unsigned int                   :32       ;//0x0190
          unsigned int                   :32       ;//0x0194
          unsigned int                   :32       ;//0x0198
          unsigned int                   :32       ;//0x019c
          unsigned int                   :32       ;//0x01a0
          unsigned int                   :32       ;//0x01a4
          unsigned int                   :32       ;//0x01a8
          unsigned int                   :32       ;//0x01ac
          unsigned int                   :32       ;//0x01b0
          unsigned int                   :32       ;//0x01b4
          unsigned int                   :32       ;//0x01b8
          unsigned int                   :32       ;//0x01bc
          unsigned int                   :32       ;//0x01c0
          unsigned int                   :32       ;//0x01c4
          unsigned int                   :32       ;//0x01c8
          unsigned int                   :32       ;//0x01cc
          unsigned int                   :32       ;//0x01d0
          unsigned int                   :32       ;//0x01d4
          unsigned int                   :32       ;//0x01d8
          unsigned int                   :32       ;//0x01dc
          unsigned int                   :32       ;//0x01e0
          unsigned int                   :32       ;//0x01e4
          unsigned int                   :32       ;//0x01e8
          unsigned int                   :32       ;//0x01ec
          unsigned int                   :32       ;//0x01f0
          unsigned int                   :32       ;//0x01f4
          unsigned int                   :32       ;//0x01f8
          unsigned int                   :32       ;//0x01fc
          unsigned int                   :32       ;//0x0200
          unsigned int                   :32       ;//0x0204
          unsigned int                   :32       ;//0x0208
          unsigned int                   :32       ;//0x020c
          unsigned int                   :32       ;//0x0210
          unsigned int                   :32       ;//0x0214
          unsigned int                   :32       ;//0x0218
          unsigned int                   :32       ;//0x021c
          unsigned int                   :32       ;//0x0220
          unsigned int                   :32       ;//0x0224
          unsigned int                   :32       ;//0x0228
          unsigned int                   :32       ;//0x022c
          unsigned int                   :32       ;//0x0230
          unsigned int                   :32       ;//0x0234
          unsigned int                   :32       ;//0x0238
          unsigned int                   :32       ;//0x023c
          unsigned int                   :32       ;//0x0240
          unsigned int                   :32       ;//0x0244
          unsigned int                   :32       ;//0x0248
          unsigned int                   :32       ;//0x024c
          unsigned int                   :32       ;//0x0250
          unsigned int                   :32       ;//0x0254
          unsigned int                   :32       ;//0x0258
          unsigned int                   :32       ;//0x025c
          unsigned int                   :32       ;//0x0260
          unsigned int                   :32       ;//0x0264
          unsigned int                   :32       ;//0x0268
          unsigned int                   :32       ;//0x026c
          unsigned int                   :32       ;//0x0270
          unsigned int                   :32       ;//0x0274
          unsigned int                   :32       ;//0x0278
          unsigned int                   :32       ;//0x027c
          unsigned int                   :32       ;//0x0280
          unsigned int                   :32       ;//0x0284
          unsigned int                   :32       ;//0x0288
          unsigned int                   :32       ;//0x028c
          unsigned int                   :32       ;//0x0290
          unsigned int                   :32       ;//0x0294
          unsigned int                   :32       ;//0x0298
          unsigned int                   :32       ;//0x029c
          unsigned int                   :32       ;//0x02a0
          unsigned int                   :32       ;//0x02a4
          unsigned int                   :32       ;//0x02a8
          unsigned int                   :32       ;//0x02ac
          unsigned int                   :32       ;//0x02b0
          unsigned int                   :32       ;//0x02b4
          unsigned int                   :32       ;//0x02b8
          unsigned int                   :32       ;//0x02bc
  union {
    const unsigned long                  rawtfr    ;//0x02c0
    const avr32_dmaca_rawtfr_t           RAWTFR    ;
  };
          unsigned int                   :32       ;//0x02c4
  union {
    const unsigned long                  rawblock  ;//0x02c8
    const avr32_dmaca_rawblock_t         RAWBLOCK  ;
  };
          unsigned int                   :32       ;//0x02cc
  union {
    const unsigned long                  rawsrctran;//0x02d0
    const avr32_dmaca_rawsrctran_t       RAWSRCTRAN;
  };
          unsigned int                   :32       ;//0x02d4
  union {
    const unsigned long                  rawdsttran;//0x02d8
    const avr32_dmaca_rawdsttran_t       RAWDSTTRAN;
  };
          unsigned int                   :32       ;//0x02dc
  union {
    const unsigned long                  rawerr    ;//0x02e0
    const avr32_dmaca_rawerr_t           RAWERR    ;
  };
          unsigned int                   :32       ;//0x02e4
  union {
    const unsigned long                  statustfr ;//0x02e8
    const avr32_dmaca_statustfr_t        STATUSTFR ;
  };
          unsigned int                   :32       ;//0x02ec
  union {
    const unsigned long                  statusblock;//0x02f0
    const avr32_dmaca_statusblock_t      STATUSBLOCK;
  };
          unsigned int                   :32       ;//0x02f4
  union {
    const unsigned long                  statussrctran;//0x02f8
    const avr32_dmaca_statussrctran_t    STATUSSRCTRAN;
  };
          unsigned int                   :32       ;//0x02fc
  union {
    const unsigned long                  statusdsttran;//0x0300
    const avr32_dmaca_statusdsttran_t    STATUSDSTTRAN;
  };
          unsigned int                   :32       ;//0x0304
  union {
    const unsigned long                  statuserr ;//0x0308
    const avr32_dmaca_statuserr_t        STATUSERR ;
  };
          unsigned int                   :32       ;//0x030c
  union {
          unsigned long                  masktfr   ;//0x0310
          avr32_dmaca_masktfr_t          MASKTFR   ;
  };
          unsigned int                   :32       ;//0x0314
  union {
          unsigned long                  maskblock ;//0x0318
          avr32_dmaca_maskblock_t        MASKBLOCK ;
  };
          unsigned int                   :32       ;//0x031c
  union {
          unsigned long                  masksrctran;//0x0320
          avr32_dmaca_masksrctran_t      MASKSRCTRAN;
  };
          unsigned int                   :32       ;//0x0324
  union {
          unsigned long                  maskdsttran;//0x0328
          avr32_dmaca_maskdsttran_t      MASKDSTTRAN;
  };
          unsigned int                   :32       ;//0x032c
  union {
          unsigned long                  maskerr   ;//0x0330
          avr32_dmaca_maskerr_t          MASKERR   ;
  };
          unsigned int                   :32       ;//0x0334
  union {
          unsigned long                  cleartfr  ;//0x0338
          avr32_dmaca_cleartfr_t         CLEARTFR  ;
  };
          unsigned int                   :32       ;//0x033c
  union {
          unsigned long                  clearblock;//0x0340
          avr32_dmaca_clearblock_t       CLEARBLOCK;
  };
          unsigned int                   :32       ;//0x0344
  union {
          unsigned long                  clearsrctran;//0x0348
          avr32_dmaca_clearsrctran_t     CLEARSRCTRAN;
  };
          unsigned int                   :32       ;//0x034c
  union {
          unsigned long                  cleardsttran;//0x0350
          avr32_dmaca_cleardsttran_t     CLEARDSTTRAN;
  };
          unsigned int                   :32       ;//0x0354
  union {
          unsigned long                  clearerr  ;//0x0358
          avr32_dmaca_clearerr_t         CLEARERR  ;
  };
          unsigned int                   :32       ;//0x035c
  union {
    const unsigned long                  statusint ;//0x0360
    const avr32_dmaca_statusint_t        STATUSINT ;
  };
          unsigned int                   :32       ;//0x0364
  union {
          unsigned long                  reqsrcreg ;//0x0368
          avr32_dmaca_reqsrcreg_t        REQSRCREG ;
  };
          unsigned int                   :32       ;//0x036c
  union {
          unsigned long                  reqdstreg ;//0x0370
          avr32_dmaca_reqdstreg_t        REQDSTREG ;
  };
          unsigned int                   :32       ;//0x0374
  union {
          unsigned long                  sglreqsrcreg;//0x0378
          avr32_dmaca_sglreqsrcreg_t     SGLREQSRCREG;
  };
          unsigned int                   :32       ;//0x037c
  union {
          unsigned long                  sglreqdstreg;//0x0380
          avr32_dmaca_sglreqdstreg_t     SGLREQDSTREG;
  };
          unsigned int                   :32       ;//0x0384
  union {
          unsigned long                  lstsrcreqreg;//0x0388
          avr32_dmaca_lstsrcreqreg_t     LSTSRCREQREG;
  };
          unsigned int                   :32       ;//0x038c
  union {
          unsigned long                  lstdstreqreg;//0x0390
          avr32_dmaca_lstdstreqreg_t     LSTDSTREQREG;
  };
          unsigned int                   :32       ;//0x0394
  union {
          unsigned long                  dmacfgreg ;//0x0398
          avr32_dmaca_dmacfgreg_t        DMACFGREG ;
  };
          unsigned int                   :32       ;//0x039c
  union {
          unsigned long                  chenreg   ;//0x03a0
          avr32_dmaca_chenreg_t          CHENREG   ;
  };
          unsigned int                   :32       ;//0x03a4
          unsigned long                  idreg     ;//0x03a8
          unsigned int                   :32       ;//0x03ac
  union {
          unsigned long                  dmatestreg;//0x03b0
          avr32_dmaca_dmatestreg_t       DMATESTREG;
  };
} avr32_dmaca_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_DMACA_206A_H_INCLUDED*/
#endif

