/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_ECCHRS_WORDADDR15_MASK                          0x000007f8
#define AVR32_ECCHRS_WORDADDR15_OFFSET                                 3
#define AVR32_ECCHRS_WORDADDR15_SIZE                                   8
#define AVR32_ECCHRS_WORDADDR1_MASK                           0x00000ff8
#define AVR32_ECCHRS_WORDADDR1_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR1_SIZE                                    9
#define AVR32_ECCHRS_WORDADDR2                                         3
#define AVR32_ECCHRS_WORDADDR2_MASK                           0x00000ff8
#define AVR32_ECCHRS_WORDADDR2_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR2_SIZE                                    9
#define AVR32_ECCHRS_WORDADDR3                                         3
#define AVR32_ECCHRS_WORDADDR3_MASK                           0x00000ff8
#define AVR32_ECCHRS_WORDADDR3_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR3_SIZE                                    9
#define AVR32_ECCHRS_WORDADDR4                                         3
#define AVR32_ECCHRS_WORDADDR4_MASK                           0x00000ff8
#define AVR32_ECCHRS_WORDADDR4_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR4_SIZE                                    9
#define AVR32_ECCHRS_WORDADDR5                                         3
#define AVR32_ECCHRS_WORDADDR5_MASK                           0x00000ff8
#define AVR32_ECCHRS_WORDADDR5_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR5_SIZE                                    9
#define AVR32_ECCHRS_WORDADDR6                                         3
#define AVR32_ECCHRS_WORDADDR6_MASK                           0x00000ff8
#define AVR32_ECCHRS_WORDADDR6_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR6_SIZE                                    9
#define AVR32_ECCHRS_WORDADDR7                                         3
#define AVR32_ECCHRS_WORDADDR7_MASK                           0x00000ff8
#define AVR32_ECCHRS_WORDADDR7_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR7_SIZE                                    9
#define AVR32_ECCHRS_WORDADDR8                                         3
#define AVR32_ECCHRS_WORDADDR8_MASK                           0x000007f8
#define AVR32_ECCHRS_WORDADDR8_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR8_SIZE                                    8
#define AVR32_ECCHRS_WORDADDR9                                         3
#define AVR32_ECCHRS_WORDADDR9_MASK                           0x000007f8
#define AVR32_ECCHRS_WORDADDR9_OFFSET                                  3
#define AVR32_ECCHRS_WORDADDR9_SIZE                                    8
#define AVR32_ECCHRS_WORDADDR_MASK                            0x0000fff0
#define AVR32_ECCHRS_WORDADDR_OFFSET                                   4
#define AVR32_ECCHRS_WORDADDR_SIZE                                    12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_ecchrs_ctrl_t {
    unsigned int                 :31;
    unsigned int rst             : 1;
} avr32_ecchrs_ctrl_t;



typedef struct avr32_ecchrs_md_t {
    unsigned int                 :21;
    unsigned int corrs4          : 1;
    unsigned int                 : 1;
    unsigned int freeze          : 1;
    unsigned int                 : 1;
    unsigned int typecorrec      : 3;
    unsigned int                 : 1;
    unsigned int pagesize        : 3;
} avr32_ecchrs_md_t;



typedef union avr32_ecchrs_sr1_t {
  struct {
    unsigned int                 : 1;
    unsigned int mulerr7         : 1;
    unsigned int eccerr7         : 1;
    unsigned int recerr7         : 1;
    unsigned int                 : 1;
    unsigned int mulerr6         : 1;
    unsigned int eccerr6         : 1;
    unsigned int recerr6         : 1;
    unsigned int                 : 1;
    unsigned int mulerr5         : 1;
    unsigned int eccerr5         : 1;
    unsigned int recerr5         : 1;
    unsigned int                 : 1;
    unsigned int mulerr4         : 1;
    unsigned int eccerr4         : 1;
    unsigned int recerr4         : 1;
    unsigned int                 : 1;
    unsigned int mulerr3         : 1;
    unsigned int eccerr3         : 1;
    unsigned int recerr3         : 1;
    unsigned int                 : 1;
    unsigned int mulerr2         : 1;
    unsigned int eccerr2         : 1;
    unsigned int recerr2         : 1;
    unsigned int                 : 1;
    unsigned int mulerr1         : 1;
    unsigned int eccerr1         : 1;
    unsigned int recerr1         : 1;
    unsigned int                 : 1;
    unsigned int mulerr0         : 1;
    unsigned int eccerr0         : 1;
    unsigned int recerr0         : 1;
  } ecc1;
  struct {
    unsigned int                 :24;
    unsigned int syn_vec         : 8;
  } ecc4;
} avr32_ecchrs_sr1_t;



typedef union avr32_ecchrs_pr0_t {
  struct {
    unsigned int                 :16;
    unsigned int wordaddr        :12;
    unsigned int bitaddr         : 4;
  } ecc1_per_page;
  struct {
    unsigned int                 : 8;
    unsigned int nparity0        :12;
    unsigned int wordaddr0       : 9;
    unsigned int bitaddr0        : 3;
  } ecc1_per_block;
} avr32_ecchrs_pr0_t;



typedef union avr32_ecchrs_pr1_t {
  struct {
    unsigned int                 :16;
    unsigned int nparity         :16;
  } ecc1_per_page;
  struct {
    unsigned int                 : 8;
    unsigned int nparity1        :12;
    unsigned int wordaddr1       : 9;
    unsigned int bitaddr1        : 3;
  } ecc1_per_block;
} avr32_ecchrs_pr1_t;



typedef union avr32_ecchrs_sr2_t {
  struct {
    unsigned int                 : 1;
    unsigned int mulerr15        : 1;
    unsigned int eccerr15        : 1;
    unsigned int recerr15        : 1;
    unsigned int                 : 1;
    unsigned int mulerr14        : 1;
    unsigned int eccerr14        : 1;
    unsigned int recerr14        : 1;
    unsigned int                 : 1;
    unsigned int mulerr13        : 1;
    unsigned int eccerr13        : 1;
    unsigned int recerr13        : 1;
    unsigned int                 : 1;
    unsigned int mulerr12        : 1;
    unsigned int eccerr12        : 1;
    unsigned int recerr12        : 1;
    unsigned int                 : 1;
    unsigned int mulerr11        : 1;
    unsigned int eccerr11        : 1;
    unsigned int recerr11        : 1;
    unsigned int                 : 1;
    unsigned int mulerr10        : 1;
    unsigned int eccerr10        : 1;
    unsigned int recerr10        : 1;
    unsigned int                 : 1;
    unsigned int mulerr9         : 1;
    unsigned int eccerr9         : 1;
    unsigned int recerr9         : 1;
    unsigned int                 : 1;
    unsigned int mulerr8         : 1;
    unsigned int eccerr8         : 1;
    unsigned int recerr8         : 1;
  } ecc1;
  struct {
    unsigned int                 :28;
    unsigned int mulerr          : 1;
    unsigned int recerr          : 3;
  } ecc4;
} avr32_ecchrs_sr2_t;



typedef struct avr32_ecchrs_pr2_t {
    unsigned int                 : 8;
    unsigned int nparity2        :12;
    unsigned int wordaddr2       : 9;
    unsigned int bitaddr2        : 3;
} avr32_ecchrs_pr2_t;



typedef struct avr32_ecchrs_pr3_t {
    unsigned int                 : 8;
    unsigned int nparity3        :12;
    unsigned int wordaddr3       : 9;
    unsigned int bitaddr3        : 3;
} avr32_ecchrs_pr3_t;



typedef struct avr32_ecchrs_pr4_t {
    unsigned int                 : 8;
    unsigned int nparity4        :12;
    unsigned int wordaddr4       : 9;
    unsigned int bitaddr4        : 3;
} avr32_ecchrs_pr4_t;



typedef struct avr32_ecchrs_pr5_t {
    unsigned int                 : 8;
    unsigned int nparity5        :12;
    unsigned int wordaddr5       : 9;
    unsigned int bitaddr5        : 3;
} avr32_ecchrs_pr5_t;



typedef struct avr32_ecchrs_pr6_t {
    unsigned int                 : 8;
    unsigned int nparity6        :12;
    unsigned int wordaddr6       : 9;
    unsigned int bitaddr6        : 3;
} avr32_ecchrs_pr6_t;



typedef struct avr32_ecchrs_pr7_t {
    unsigned int                 : 8;
    unsigned int nparity7        :12;
    unsigned int wordaddr7       : 9;
    unsigned int bitaddr7        : 3;
} avr32_ecchrs_pr7_t;



typedef struct avr32_ecchrs_pr8_t {
    unsigned int                 : 9;
    unsigned int nparity8        :11;
    unsigned int                 : 1;
    unsigned int wordaddr8       : 8;
    unsigned int bitaddr8        : 3;
} avr32_ecchrs_pr8_t;



typedef struct avr32_ecchrs_pr9_t {
    unsigned int                 : 9;
    unsigned int nparity9        :11;
    unsigned int                 : 1;
    unsigned int wordaddr9       : 8;
    unsigned int bitaddr9        : 3;
} avr32_ecchrs_pr9_t;



typedef struct avr32_ecchrs_pr10_t {
    unsigned int                 : 9;
    unsigned int nparity10       :11;
    unsigned int                 : 1;
    unsigned int wordaddr10      : 8;
    unsigned int bitaddr10       : 3;
} avr32_ecchrs_pr10_t;



typedef struct avr32_ecchrs_pr11_t {
    unsigned int                 : 9;
    unsigned int nparity11       :11;
    unsigned int                 : 1;
    unsigned int wordaddr11      : 8;
    unsigned int bitaddr11       : 3;
} avr32_ecchrs_pr11_t;



typedef struct avr32_ecchrs_pr12_t {
    unsigned int                 : 9;
    unsigned int nparity12       :11;
    unsigned int                 : 1;
    unsigned int wordaddr12      : 8;
    unsigned int bitaddr12       : 3;
} avr32_ecchrs_pr12_t;



typedef struct avr32_ecchrs_pr13_t {
    unsigned int                 : 9;
    unsigned int nparity13       :11;
    unsigned int                 : 1;
    unsigned int wordaddr13      : 8;
    unsigned int bitaddr13       : 3;
} avr32_ecchrs_pr13_t;



typedef struct avr32_ecchrs_pr14_t {
    unsigned int                 : 9;
    unsigned int nparity14       :11;
    unsigned int                 : 1;
    unsigned int wordaddr14      : 8;
    unsigned int bitaddr14       : 3;
} avr32_ecchrs_pr14_t;



typedef struct avr32_ecchrs_pr15_t {
    unsigned int                 : 9;
    unsigned int nparity15       :11;
    unsigned int                 : 1;
    unsigned int wordaddr15      : 8;
    unsigned int bitaddr15       : 3;
} avr32_ecchrs_pr15_t;



typedef union avr32_ecchrs_cwps00_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword00      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd00       : 8;
  } page_read;
} avr32_ecchrs_cwps00_t;



typedef union avr32_ecchrs_cwps01_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword01      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd01       : 8;
  } page_read;
} avr32_ecchrs_cwps01_t;



typedef union avr32_ecchrs_cwps02_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword02      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd02       : 8;
  } page_read;
} avr32_ecchrs_cwps02_t;



typedef union avr32_ecchrs_cwps03_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword03      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd03       : 8;
  } page_read;
} avr32_ecchrs_cwps03_t;



typedef union avr32_ecchrs_cwps04_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword04      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd04       : 8;
  } page_read;
} avr32_ecchrs_cwps04_t;



typedef union avr32_ecchrs_cwps05_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword05      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd05       : 8;
  } page_read;
} avr32_ecchrs_cwps05_t;



typedef union avr32_ecchrs_cwps06_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword06      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd06       : 8;
  } page_read;
} avr32_ecchrs_cwps06_t;



typedef union avr32_ecchrs_cwps07_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword07      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd07       : 8;
  } page_read;
} avr32_ecchrs_cwps07_t;



typedef union avr32_ecchrs_cwps08_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword08      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd08       : 8;
  } page_read;
} avr32_ecchrs_cwps08_t;



typedef union avr32_ecchrs_cwps09_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword09      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd09       : 8;
  } page_read;
} avr32_ecchrs_cwps09_t;



typedef union avr32_ecchrs_cwps10_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword10      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd10       : 8;
  } page_read;
} avr32_ecchrs_cwps10_t;



typedef union avr32_ecchrs_cwps11_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword11      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd11       : 8;
  } page_read;
} avr32_ecchrs_cwps11_t;



typedef union avr32_ecchrs_cwps12_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword12      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd12       : 8;
  } page_read;
} avr32_ecchrs_cwps12_t;



typedef union avr32_ecchrs_cwps13_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword13      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd13       : 8;
  } page_read;
} avr32_ecchrs_cwps13_t;



typedef union avr32_ecchrs_cwps14_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword14      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd14       : 8;
  } page_read;
} avr32_ecchrs_cwps14_t;



typedef union avr32_ecchrs_cwps15_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword15      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd15       : 8;
  } page_read;
} avr32_ecchrs_cwps15_t;



typedef union avr32_ecchrs_cwps16_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword16      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd16       : 8;
  } page_read;
} avr32_ecchrs_cwps16_t;



typedef union avr32_ecchrs_cwps17_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword17      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd17       : 8;
  } page_read;
} avr32_ecchrs_cwps17_t;



typedef union avr32_ecchrs_cwps18_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword18      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd18       : 8;
  } page_read;
} avr32_ecchrs_cwps18_t;



typedef union avr32_ecchrs_cwps19_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword19      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd19       : 8;
  } page_read;
} avr32_ecchrs_cwps19_t;



typedef union avr32_ecchrs_cwps20_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword20      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd20       : 8;
  } page_read;
} avr32_ecchrs_cwps20_t;



typedef union avr32_ecchrs_cwps21_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword21      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd21       : 8;
  } page_read;
} avr32_ecchrs_cwps21_t;



typedef union avr32_ecchrs_cwps22_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword22      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd22       : 8;
  } page_read;
} avr32_ecchrs_cwps22_t;



typedef union avr32_ecchrs_cwps23_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword23      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd23       : 8;
  } page_read;
} avr32_ecchrs_cwps23_t;



typedef union avr32_ecchrs_cwps24_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword24      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd24       : 8;
  } page_read;
} avr32_ecchrs_cwps24_t;



typedef union avr32_ecchrs_cwps25_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword25      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd25       : 8;
  } page_read;
} avr32_ecchrs_cwps25_t;



typedef union avr32_ecchrs_cwps26_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword26      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd26       : 8;
  } page_read;
} avr32_ecchrs_cwps26_t;



typedef union avr32_ecchrs_cwps27_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword27      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd27       : 8;
  } page_read;
} avr32_ecchrs_cwps27_t;



typedef union avr32_ecchrs_cwps28_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword28      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd28       : 8;
  } page_read;
} avr32_ecchrs_cwps28_t;



typedef union avr32_ecchrs_cwps29_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword29      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd29       : 8;
  } page_read;
} avr32_ecchrs_cwps29_t;



typedef union avr32_ecchrs_cwps30_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword30      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd30       : 8;
  } page_read;
} avr32_ecchrs_cwps30_t;



typedef union avr32_ecchrs_cwps31_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword31      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd31       : 8;
  } page_read;
} avr32_ecchrs_cwps31_t;



typedef union avr32_ecchrs_cwps32_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword32      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd32       : 8;
  } page_read;
} avr32_ecchrs_cwps32_t;



typedef union avr32_ecchrs_cwps33_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword33      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd33       : 8;
  } page_read;
} avr32_ecchrs_cwps33_t;



typedef union avr32_ecchrs_cwps34_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword34      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd34       : 8;
  } page_read;
} avr32_ecchrs_cwps34_t;



typedef union avr32_ecchrs_cwps35_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword35      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd35       : 8;
  } page_read;
} avr32_ecchrs_cwps35_t;



typedef union avr32_ecchrs_cwps36_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword36      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd36       : 8;
  } page_read;
} avr32_ecchrs_cwps36_t;



typedef union avr32_ecchrs_cwps37_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword37      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd37       : 8;
  } page_read;
} avr32_ecchrs_cwps37_t;



typedef union avr32_ecchrs_cwps38_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword38      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd38       : 8;
  } page_read;
} avr32_ecchrs_cwps38_t;



typedef union avr32_ecchrs_cwps39_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword39      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd39       : 8;
  } page_read;
} avr32_ecchrs_cwps39_t;



typedef union avr32_ecchrs_cwps40_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword40      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd40       : 8;
  } page_read;
} avr32_ecchrs_cwps40_t;



typedef union avr32_ecchrs_cwps41_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword41      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd41       : 8;
  } page_read;
} avr32_ecchrs_cwps41_t;



typedef union avr32_ecchrs_cwps42_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword42      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd42       : 8;
  } page_read;
} avr32_ecchrs_cwps42_t;



typedef union avr32_ecchrs_cwps43_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword43      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd43       : 8;
  } page_read;
} avr32_ecchrs_cwps43_t;



typedef union avr32_ecchrs_cwps44_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword44      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd44       : 8;
  } page_read;
} avr32_ecchrs_cwps44_t;



typedef union avr32_ecchrs_cwps45_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword45      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd45       : 8;
  } page_read;
} avr32_ecchrs_cwps45_t;



typedef union avr32_ecchrs_cwps46_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword46      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd46       : 8;
  } page_read;
} avr32_ecchrs_cwps46_t;



typedef union avr32_ecchrs_cwps47_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword47      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd47       : 8;
  } page_read;
} avr32_ecchrs_cwps47_t;



typedef union avr32_ecchrs_cwps48_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword48      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd48       : 8;
  } page_read;
} avr32_ecchrs_cwps48_t;



typedef union avr32_ecchrs_cwps49_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword49      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd49       : 8;
  } page_read;
} avr32_ecchrs_cwps49_t;



typedef union avr32_ecchrs_cwps50_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword50      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd50       : 8;
  } page_read;
} avr32_ecchrs_cwps50_t;



typedef union avr32_ecchrs_cwps51_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword51      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd51       : 8;
  } page_read;
} avr32_ecchrs_cwps51_t;



typedef union avr32_ecchrs_cwps52_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword52      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd52       : 8;
  } page_read;
} avr32_ecchrs_cwps52_t;



typedef union avr32_ecchrs_cwps53_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword53      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd53       : 8;
  } page_read;
} avr32_ecchrs_cwps53_t;



typedef union avr32_ecchrs_cwps54_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword54      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd54       : 8;
  } page_read;
} avr32_ecchrs_cwps54_t;



typedef union avr32_ecchrs_cwps55_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword55      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd55       : 8;
  } page_read;
} avr32_ecchrs_cwps55_t;



typedef union avr32_ecchrs_cwps56_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword56      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd56       : 8;
  } page_read;
} avr32_ecchrs_cwps56_t;



typedef union avr32_ecchrs_cwps57_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword57      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd57       : 8;
  } page_read;
} avr32_ecchrs_cwps57_t;



typedef union avr32_ecchrs_cwps58_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword58      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd58       : 8;
  } page_read;
} avr32_ecchrs_cwps58_t;



typedef union avr32_ecchrs_cwps59_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword59      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd59       : 8;
  } page_read;
} avr32_ecchrs_cwps59_t;



typedef union avr32_ecchrs_cwps60_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword60      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd60       : 8;
  } page_read;
} avr32_ecchrs_cwps60_t;



typedef union avr32_ecchrs_cwps61_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword61      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd61       : 8;
  } page_read;
} avr32_ecchrs_cwps61_t;



typedef union avr32_ecchrs_cwps62_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword62      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd62       : 8;
  } page_read;
} avr32_ecchrs_cwps62_t;



typedef union avr32_ecchrs_cwps63_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword63      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd63       : 8;
  } page_read;
} avr32_ecchrs_cwps63_t;



typedef union avr32_ecchrs_cwps64_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword64      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd64       : 8;
  } page_read;
} avr32_ecchrs_cwps64_t;



typedef union avr32_ecchrs_cwps65_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword65      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd65       : 8;
  } page_read;
} avr32_ecchrs_cwps65_t;



typedef union avr32_ecchrs_cwps66_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword66      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd66       : 8;
  } page_read;
} avr32_ecchrs_cwps66_t;



typedef union avr32_ecchrs_cwps67_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword67      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd67       : 8;
  } page_read;
} avr32_ecchrs_cwps67_t;



typedef union avr32_ecchrs_cwps68_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword68      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd68       : 8;
  } page_read;
} avr32_ecchrs_cwps68_t;



typedef union avr32_ecchrs_cwps69_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword69      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd69       : 8;
  } page_read;
} avr32_ecchrs_cwps69_t;



typedef union avr32_ecchrs_cwps70_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword70      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd70       : 8;
  } page_read;
} avr32_ecchrs_cwps70_t;



typedef union avr32_ecchrs_cwps71_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword71      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd71       : 8;
  } page_read;
} avr32_ecchrs_cwps71_t;



typedef union avr32_ecchrs_cwps72_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword72      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd72       : 8;
  } page_read;
} avr32_ecchrs_cwps72_t;



typedef union avr32_ecchrs_cwps73_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword73      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd73       : 8;
  } page_read;
} avr32_ecchrs_cwps73_t;



typedef union avr32_ecchrs_cwps74_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword74      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd74       : 8;
  } page_read;
} avr32_ecchrs_cwps74_t;



typedef union avr32_ecchrs_cwps75_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword75      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd75       : 8;
  } page_read;
} avr32_ecchrs_cwps75_t;



typedef union avr32_ecchrs_cwps76_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword76      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd76       : 8;
  } page_read;
} avr32_ecchrs_cwps76_t;



typedef union avr32_ecchrs_cwps77_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword77      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd77       : 8;
  } page_read;
} avr32_ecchrs_cwps77_t;



typedef union avr32_ecchrs_cwps78_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword78      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd78       : 8;
  } page_read;
} avr32_ecchrs_cwps78_t;



typedef union avr32_ecchrs_cwps79_t {
  struct {
    unsigned int                 :24;
    unsigned int codeword79      : 8;
  } page_write;
  struct {
    unsigned int                 :24;
    unsigned int parsynd79       : 8;
  } page_read;
} avr32_ecchrs_cwps79_t;



typedef struct avr32_ecchrs_mdata0_t {
    unsigned int                 :22;
    unsigned int maskdata0       :10;
} avr32_ecchrs_mdata0_t;



typedef struct avr32_ecchrs_mdata1_t {
    unsigned int                 :22;
    unsigned int maskdata1       :10;
} avr32_ecchrs_mdata1_t;



typedef struct avr32_ecchrs_mdata2_t {
    unsigned int                 :22;
    unsigned int maskdata2       :10;
} avr32_ecchrs_mdata2_t;



typedef struct avr32_ecchrs_mdata3_t {
    unsigned int                 :22;
    unsigned int maskdata3       :10;
} avr32_ecchrs_mdata3_t;



typedef struct avr32_ecchrs_adoff0_t {
    unsigned int                 :22;
    unsigned int offset0         :10;
} avr32_ecchrs_adoff0_t;



typedef struct avr32_ecchrs_adoff1_t {
    unsigned int                 :22;
    unsigned int offset1         :10;
} avr32_ecchrs_adoff1_t;



typedef struct avr32_ecchrs_adoff2_t {
    unsigned int                 :22;
    unsigned int offset2         :10;
} avr32_ecchrs_adoff2_t;



typedef struct avr32_ecchrs_adoff3_t {
    unsigned int                 :22;
    unsigned int offset3         :10;
} avr32_ecchrs_adoff3_t;



typedef struct avr32_ecchrs_rs4_ier_t {
    unsigned int                 :31;
    unsigned int endcor          : 1;
} avr32_ecchrs_rs4_ier_t;



typedef struct avr32_ecchrs_rs4_idr_t {
    unsigned int                 :31;
    unsigned int endcor          : 1;
} avr32_ecchrs_rs4_idr_t;



typedef struct avr32_ecchrs_rs4_imr_t {
    unsigned int                 :31;
    unsigned int endcor          : 1;
} avr32_ecchrs_rs4_imr_t;



typedef struct avr32_ecchrs_rs4_isr_t {
    unsigned int                 :31;
    unsigned int endcor          : 1;
} avr32_ecchrs_rs4_isr_t;



typedef struct avr32_ecchrs_rs4_iscr_t {
    unsigned int                 :31;
    unsigned int endcor          : 1;
} avr32_ecchrs_rs4_iscr_t;



typedef struct avr32_ecchrs_version_t {
    unsigned int                 :13;
    unsigned int variant         : 3;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_ecchrs_version_t;



typedef struct avr32_ecchrs_t {
  union {
          unsigned long                  ctrl      ;//0x0000
          avr32_ecchrs_ctrl_t            CTRL      ;
  };
  union {
          unsigned long                  md        ;//0x0004
          avr32_ecchrs_md_t              MD        ;
  };
  union {
    const unsigned long                  sr1       ;//0x0008
    const avr32_ecchrs_sr1_t             SR1       ;
  };
  union {
    const unsigned long                  pr0       ;//0x000c
    const avr32_ecchrs_pr0_t             PR0       ;
  };
  union {
    const unsigned long                  pr1       ;//0x0010
    const avr32_ecchrs_pr1_t             PR1       ;
  };
  union {
    const unsigned long                  sr2       ;//0x0014
    const avr32_ecchrs_sr2_t             SR2       ;
  };
  union {
    const unsigned long                  pr2       ;//0x0018
    const avr32_ecchrs_pr2_t             PR2       ;
  };
  union {
    const unsigned long                  pr3       ;//0x001c
    const avr32_ecchrs_pr3_t             PR3       ;
  };
  union {
    const unsigned long                  pr4       ;//0x0020
    const avr32_ecchrs_pr4_t             PR4       ;
  };
  union {
    const unsigned long                  pr5       ;//0x0024
    const avr32_ecchrs_pr5_t             PR5       ;
  };
  union {
    const unsigned long                  pr6       ;//0x0028
    const avr32_ecchrs_pr6_t             PR6       ;
  };
  union {
    const unsigned long                  pr7       ;//0x002c
    const avr32_ecchrs_pr7_t             PR7       ;
  };
  union {
    const unsigned long                  pr8       ;//0x0030
    const avr32_ecchrs_pr8_t             PR8       ;
  };
  union {
    const unsigned long                  pr9       ;//0x0034
    const avr32_ecchrs_pr9_t             PR9       ;
  };
  union {
    const unsigned long                  pr10      ;//0x0038
    const avr32_ecchrs_pr10_t            PR10      ;
  };
  union {
    const unsigned long                  pr11      ;//0x003c
    const avr32_ecchrs_pr11_t            PR11      ;
  };
  union {
    const unsigned long                  pr12      ;//0x0040
    const avr32_ecchrs_pr12_t            PR12      ;
  };
  union {
    const unsigned long                  pr13      ;//0x0044
    const avr32_ecchrs_pr13_t            PR13      ;
  };
  union {
    const unsigned long                  pr14      ;//0x0048
    const avr32_ecchrs_pr14_t            PR14      ;
  };
  union {
    const unsigned long                  pr15      ;//0x004c
    const avr32_ecchrs_pr15_t            PR15      ;
  };
  union {
    const unsigned long                  cwps00    ;//0x0050
    const avr32_ecchrs_cwps00_t          CWPS00    ;
  };
  union {
    const unsigned long                  cwps01    ;//0x0054
    const avr32_ecchrs_cwps01_t          CWPS01    ;
  };
  union {
    const unsigned long                  cwps02    ;//0x0058
    const avr32_ecchrs_cwps02_t          CWPS02    ;
  };
  union {
    const unsigned long                  cwps03    ;//0x005c
    const avr32_ecchrs_cwps03_t          CWPS03    ;
  };
  union {
    const unsigned long                  cwps04    ;//0x0060
    const avr32_ecchrs_cwps04_t          CWPS04    ;
  };
  union {
    const unsigned long                  cwps05    ;//0x0064
    const avr32_ecchrs_cwps05_t          CWPS05    ;
  };
  union {
    const unsigned long                  cwps06    ;//0x0068
    const avr32_ecchrs_cwps06_t          CWPS06    ;
  };
  union {
    const unsigned long                  cwps07    ;//0x006c
    const avr32_ecchrs_cwps07_t          CWPS07    ;
  };
  union {
    const unsigned long                  cwps08    ;//0x0070
    const avr32_ecchrs_cwps08_t          CWPS08    ;
  };
  union {
    const unsigned long                  cwps09    ;//0x0074
    const avr32_ecchrs_cwps09_t          CWPS09    ;
  };
  union {
    const unsigned long                  cwps10    ;//0x0078
    const avr32_ecchrs_cwps10_t          CWPS10    ;
  };
  union {
    const unsigned long                  cwps11    ;//0x007c
    const avr32_ecchrs_cwps11_t          CWPS11    ;
  };
  union {
    const unsigned long                  cwps12    ;//0x0080
    const avr32_ecchrs_cwps12_t          CWPS12    ;
  };
  union {
    const unsigned long                  cwps13    ;//0x0084
    const avr32_ecchrs_cwps13_t          CWPS13    ;
  };
  union {
    const unsigned long                  cwps14    ;//0x0088
    const avr32_ecchrs_cwps14_t          CWPS14    ;
  };
  union {
    const unsigned long                  cwps15    ;//0x008c
    const avr32_ecchrs_cwps15_t          CWPS15    ;
  };
  union {
    const unsigned long                  cwps16    ;//0x0090
    const avr32_ecchrs_cwps16_t          CWPS16    ;
  };
  union {
    const unsigned long                  cwps17    ;//0x0094
    const avr32_ecchrs_cwps17_t          CWPS17    ;
  };
  union {
    const unsigned long                  cwps18    ;//0x0098
    const avr32_ecchrs_cwps18_t          CWPS18    ;
  };
  union {
    const unsigned long                  cwps19    ;//0x009c
    const avr32_ecchrs_cwps19_t          CWPS19    ;
  };
  union {
    const unsigned long                  cwps20    ;//0x00a0
    const avr32_ecchrs_cwps20_t          CWPS20    ;
  };
  union {
    const unsigned long                  cwps21    ;//0x00a4
    const avr32_ecchrs_cwps21_t          CWPS21    ;
  };
  union {
    const unsigned long                  cwps22    ;//0x00a8
    const avr32_ecchrs_cwps22_t          CWPS22    ;
  };
  union {
    const unsigned long                  cwps23    ;//0x00ac
    const avr32_ecchrs_cwps23_t          CWPS23    ;
  };
  union {
    const unsigned long                  cwps24    ;//0x00b0
    const avr32_ecchrs_cwps24_t          CWPS24    ;
  };
  union {
    const unsigned long                  cwps25    ;//0x00b4
    const avr32_ecchrs_cwps25_t          CWPS25    ;
  };
  union {
    const unsigned long                  cwps26    ;//0x00b8
    const avr32_ecchrs_cwps26_t          CWPS26    ;
  };
  union {
    const unsigned long                  cwps27    ;//0x00bc
    const avr32_ecchrs_cwps27_t          CWPS27    ;
  };
  union {
    const unsigned long                  cwps28    ;//0x00c0
    const avr32_ecchrs_cwps28_t          CWPS28    ;
  };
  union {
    const unsigned long                  cwps29    ;//0x00c4
    const avr32_ecchrs_cwps29_t          CWPS29    ;
  };
  union {
    const unsigned long                  cwps30    ;//0x00c8
    const avr32_ecchrs_cwps30_t          CWPS30    ;
  };
  union {
    const unsigned long                  cwps31    ;//0x00cc
    const avr32_ecchrs_cwps31_t          CWPS31    ;
  };
  union {
    const unsigned long                  cwps32    ;//0x00d0
    const avr32_ecchrs_cwps32_t          CWPS32    ;
  };
  union {
    const unsigned long                  cwps33    ;//0x00d4
    const avr32_ecchrs_cwps33_t          CWPS33    ;
  };
  union {
    const unsigned long                  cwps34    ;//0x00d8
    const avr32_ecchrs_cwps34_t          CWPS34    ;
  };
  union {
    const unsigned long                  cwps35    ;//0x00dc
    const avr32_ecchrs_cwps35_t          CWPS35    ;
  };
  union {
    const unsigned long                  cwps36    ;//0x00e0
    const avr32_ecchrs_cwps36_t          CWPS36    ;
  };
  union {
    const unsigned long                  cwps37    ;//0x00e4
    const avr32_ecchrs_cwps37_t          CWPS37    ;
  };
  union {
    const unsigned long                  cwps38    ;//0x00e8
    const avr32_ecchrs_cwps38_t          CWPS38    ;
  };
  union {
    const unsigned long                  cwps39    ;//0x00ec
    const avr32_ecchrs_cwps39_t          CWPS39    ;
  };
  union {
    const unsigned long                  cwps40    ;//0x00f0
    const avr32_ecchrs_cwps40_t          CWPS40    ;
  };
  union {
    const unsigned long                  cwps41    ;//0x00f4
    const avr32_ecchrs_cwps41_t          CWPS41    ;
  };
  union {
    const unsigned long                  cwps42    ;//0x00f8
    const avr32_ecchrs_cwps42_t          CWPS42    ;
  };
  union {
    const unsigned long                  cwps43    ;//0x00fc
    const avr32_ecchrs_cwps43_t          CWPS43    ;
  };
  union {
    const unsigned long                  cwps44    ;//0x0100
    const avr32_ecchrs_cwps44_t          CWPS44    ;
  };
  union {
    const unsigned long                  cwps45    ;//0x0104
    const avr32_ecchrs_cwps45_t          CWPS45    ;
  };
  union {
    const unsigned long                  cwps46    ;//0x0108
    const avr32_ecchrs_cwps46_t          CWPS46    ;
  };
  union {
    const unsigned long                  cwps47    ;//0x010c
    const avr32_ecchrs_cwps47_t          CWPS47    ;
  };
  union {
    const unsigned long                  cwps48    ;//0x0110
    const avr32_ecchrs_cwps48_t          CWPS48    ;
  };
  union {
    const unsigned long                  cwps49    ;//0x0114
    const avr32_ecchrs_cwps49_t          CWPS49    ;
  };
  union {
    const unsigned long                  cwps50    ;//0x0118
    const avr32_ecchrs_cwps50_t          CWPS50    ;
  };
  union {
    const unsigned long                  cwps51    ;//0x011c
    const avr32_ecchrs_cwps51_t          CWPS51    ;
  };
  union {
    const unsigned long                  cwps52    ;//0x0120
    const avr32_ecchrs_cwps52_t          CWPS52    ;
  };
  union {
    const unsigned long                  cwps53    ;//0x0124
    const avr32_ecchrs_cwps53_t          CWPS53    ;
  };
  union {
    const unsigned long                  cwps54    ;//0x0128
    const avr32_ecchrs_cwps54_t          CWPS54    ;
  };
  union {
    const unsigned long                  cwps55    ;//0x012c
    const avr32_ecchrs_cwps55_t          CWPS55    ;
  };
  union {
    const unsigned long                  cwps56    ;//0x0130
    const avr32_ecchrs_cwps56_t          CWPS56    ;
  };
  union {
    const unsigned long                  cwps57    ;//0x0134
    const avr32_ecchrs_cwps57_t          CWPS57    ;
  };
  union {
    const unsigned long                  cwps58    ;//0x0138
    const avr32_ecchrs_cwps58_t          CWPS58    ;
  };
  union {
    const unsigned long                  cwps59    ;//0x013c
    const avr32_ecchrs_cwps59_t          CWPS59    ;
  };
  union {
    const unsigned long                  cwps60    ;//0x0140
    const avr32_ecchrs_cwps60_t          CWPS60    ;
  };
  union {
    const unsigned long                  cwps61    ;//0x0144
    const avr32_ecchrs_cwps61_t          CWPS61    ;
  };
  union {
    const unsigned long                  cwps62    ;//0x0148
    const avr32_ecchrs_cwps62_t          CWPS62    ;
  };
  union {
    const unsigned long                  cwps63    ;//0x014c
    const avr32_ecchrs_cwps63_t          CWPS63    ;
  };
  union {
    const unsigned long                  cwps64    ;//0x0150
    const avr32_ecchrs_cwps64_t          CWPS64    ;
  };
  union {
    const unsigned long                  cwps65    ;//0x0154
    const avr32_ecchrs_cwps65_t          CWPS65    ;
  };
  union {
    const unsigned long                  cwps66    ;//0x0158
    const avr32_ecchrs_cwps66_t          CWPS66    ;
  };
  union {
    const unsigned long                  cwps67    ;//0x015c
    const avr32_ecchrs_cwps67_t          CWPS67    ;
  };
  union {
    const unsigned long                  cwps68    ;//0x0160
    const avr32_ecchrs_cwps68_t          CWPS68    ;
  };
  union {
    const unsigned long                  cwps69    ;//0x0164
    const avr32_ecchrs_cwps69_t          CWPS69    ;
  };
  union {
    const unsigned long                  cwps70    ;//0x0168
    const avr32_ecchrs_cwps70_t          CWPS70    ;
  };
  union {
    const unsigned long                  cwps71    ;//0x016c
    const avr32_ecchrs_cwps71_t          CWPS71    ;
  };
  union {
    const unsigned long                  cwps72    ;//0x0170
    const avr32_ecchrs_cwps72_t          CWPS72    ;
  };
  union {
    const unsigned long                  cwps73    ;//0x0174
    const avr32_ecchrs_cwps73_t          CWPS73    ;
  };
  union {
    const unsigned long                  cwps74    ;//0x0178
    const avr32_ecchrs_cwps74_t          CWPS74    ;
  };
  union {
    const unsigned long                  cwps75    ;//0x017c
    const avr32_ecchrs_cwps75_t          CWPS75    ;
  };
  union {
    const unsigned long                  cwps76    ;//0x0180
    const avr32_ecchrs_cwps76_t          CWPS76    ;
  };
  union {
    const unsigned long                  cwps77    ;//0x0184
    const avr32_ecchrs_cwps77_t          CWPS77    ;
  };
  union {
    const unsigned long                  cwps78    ;//0x0188
    const avr32_ecchrs_cwps78_t          CWPS78    ;
  };
  union {
    const unsigned long                  cwps79    ;//0x018c
    const avr32_ecchrs_cwps79_t          CWPS79    ;
  };
  union {
    const unsigned long                  mdata0    ;//0x0190
    const avr32_ecchrs_mdata0_t          MDATA0    ;
  };
  union {
    const unsigned long                  mdata1    ;//0x0194
    const avr32_ecchrs_mdata1_t          MDATA1    ;
  };
  union {
    const unsigned long                  mdata2    ;//0x0198
    const avr32_ecchrs_mdata2_t          MDATA2    ;
  };
  union {
    const unsigned long                  mdata3    ;//0x019c
    const avr32_ecchrs_mdata3_t          MDATA3    ;
  };
  union {
    const unsigned long                  adoff0    ;//0x01a0
    const avr32_ecchrs_adoff0_t          ADOFF0    ;
  };
  union {
    const unsigned long                  adoff1    ;//0x01a4
    const avr32_ecchrs_adoff1_t          ADOFF1    ;
  };
  union {
    const unsigned long                  adoff2    ;//0x01a8
    const avr32_ecchrs_adoff2_t          ADOFF2    ;
  };
  union {
    const unsigned long                  adoff3    ;//0x01ac
    const avr32_ecchrs_adoff3_t          ADOFF3    ;
  };
  union {
          unsigned long                  rs4_ier   ;//0x01b0
          avr32_ecchrs_rs4_ier_t         RS4_IER   ;
  };
  union {
          unsigned long                  rs4_idr   ;//0x01b4
          avr32_ecchrs_rs4_idr_t         RS4_IDR   ;
  };
  union {
    const unsigned long                  rs4_imr   ;//0x01b8
    const avr32_ecchrs_rs4_imr_t         RS4_IMR   ;
  };
  union {
    const unsigned long                  rs4_isr   ;//0x01bc
    const avr32_ecchrs_rs4_isr_t         RS4_ISR   ;
  };
  union {
          unsigned long                  rs4_iscr  ;//0x01c0
          avr32_ecchrs_rs4_iscr_t        RS4_ISCR  ;
  };
          unsigned int                   :32       ;//0x01c4
          unsigned int                   :32       ;//0x01c8
          unsigned int                   :32       ;//0x01cc
          unsigned int                   :32       ;//0x01d0
          unsigned int                   :32       ;//0x01d4
          unsigned int                   :32       ;//0x01d8
          unsigned int                   :32       ;//0x01dc
          unsigned int                   :32       ;//0x01e0
          unsigned int                   :32       ;//0x01e4
          unsigned int                   :32       ;//0x01e8
          unsigned int                   :32       ;//0x01ec
          unsigned int                   :32       ;//0x01f0
          unsigned int                   :32       ;//0x01f4
          unsigned int                   :32       ;//0x01f8
  union {
    const unsigned long                  version   ;//0x01fc
    const avr32_ecchrs_version_t         VERSION   ;
  };
} avr32_ecchrs_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_ECCHRS_100_H_INCLUDED*/
#endif

