/*****************************************************************************
 *
 * Copyright (C) 2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_HMATRIXB_SFR6_SFR_SIZE                                    32
#define AVR32_HMATRIXB_SFR7                                     0x0000012c
#define AVR32_HMATRIXB_SFR7_MASK                                0xffffffff
#define AVR32_HMATRIXB_SFR7_RESETVALUE                          0x00000000
#define AVR32_HMATRIXB_SFR7_SFR                                          0
#define AVR32_HMATRIXB_SFR7_SFR_MASK                            0xffffffff
#define AVR32_HMATRIXB_SFR7_SFR_OFFSET                                   0
#define AVR32_HMATRIXB_SFR7_SFR_SIZE                                    32
#define AVR32_HMATRIXB_SFR8                                     0x00000130
#define AVR32_HMATRIXB_SFR8_MASK                                0xffffffff
#define AVR32_HMATRIXB_SFR8_RESETVALUE                          0x00000000
#define AVR32_HMATRIXB_SFR8_SFR                                          0
#define AVR32_HMATRIXB_SFR8_SFR_MASK                            0xffffffff
#define AVR32_HMATRIXB_SFR8_SFR_OFFSET                                   0
#define AVR32_HMATRIXB_SFR8_SFR_SIZE                                    32
#define AVR32_HMATRIXB_SFR9                                     0x00000134
#define AVR32_HMATRIXB_SFR9_MASK                                0xffffffff
#define AVR32_HMATRIXB_SFR9_RESETVALUE                          0x00000000
#define AVR32_HMATRIXB_SFR9_SFR                                          0
#define AVR32_HMATRIXB_SFR9_SFR_MASK                            0xffffffff
#define AVR32_HMATRIXB_SFR9_SFR_OFFSET                                   0
#define AVR32_HMATRIXB_SFR9_SFR_SIZE                                    32
#define AVR32_HMATRIXB_SFR_MASK                                 0xffffffff
#define AVR32_HMATRIXB_SFR_OFFSET                                        0
#define AVR32_HMATRIXB_SFR_SIZE                                         32
#define AVR32_HMATRIXB_SINGLE                                   0x00000001
#define AVR32_HMATRIXB_SIXTEEN_BEAT                             0x00000004
#define AVR32_HMATRIXB_SLOT_CYCLE                                        0
#define AVR32_HMATRIXB_SLOT_CYCLE_MASK                          0x000000ff
#define AVR32_HMATRIXB_SLOT_CYCLE_OFFSET                                 0
#define AVR32_HMATRIXB_SLOT_CYCLE_SIZE                                   8
#define AVR32_HMATRIXB_ULBT                                              0
#define AVR32_HMATRIXB_ULBT_EIGHT_BEAT                          0x00000003
#define AVR32_HMATRIXB_ULBT_FOUR_BEAT                           0x00000002
#define AVR32_HMATRIXB_ULBT_INFINITE                            0x00000000
#define AVR32_HMATRIXB_ULBT_MASK                                0x00000007
#define AVR32_HMATRIXB_ULBT_OFFSET                                       0
#define AVR32_HMATRIXB_ULBT_SINGLE                              0x00000001
#define AVR32_HMATRIXB_ULBT_SIXTEEN_BEAT                        0x00000004
#define AVR32_HMATRIXB_ULBT_SIZE                                         3




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_hmatrixb_mcfg_t {
    unsigned int                 :29;
    unsigned int ulbt            : 3;
} avr32_hmatrixb_mcfg_t;



typedef struct avr32_hmatrixb_scfg_t {
    unsigned int                 : 7;
    unsigned int arbt            : 1;
    unsigned int                 : 2;
    unsigned int fixed_defmstr   : 4;
    unsigned int defmstr_type    : 2;
    unsigned int                 : 8;
    unsigned int slot_cycle      : 8;
} avr32_hmatrixb_scfg_t;



typedef struct avr32_hmatrixb_pras_t {
    unsigned int m7pr            : 4;
    unsigned int m6pr            : 4;
    unsigned int m5pr            : 4;
    unsigned int m4pr            : 4;
    unsigned int m3pr            : 4;
    unsigned int m2pr            : 4;
    unsigned int m1pr            : 4;
    unsigned int m0pr            : 4;
} avr32_hmatrixb_pras_t;



typedef struct avr32_hmatrixb_prbs_t {
    unsigned int m15pr           : 4;
    unsigned int m14pr           : 4;
    unsigned int m13pr           : 4;
    unsigned int m12pr           : 4;
    unsigned int m11pr           : 4;
    unsigned int m10pr           : 4;
    unsigned int m9pr            : 4;
    unsigned int m8pr            : 4;
} avr32_hmatrixb_prbs_t;



typedef struct avr32_hmatrixb_mrcr_t {
    unsigned int                 :16;
    unsigned int rcb15           : 1;
    unsigned int rcb14           : 1;
    unsigned int rcb13           : 1;
    unsigned int rcb12           : 1;
    unsigned int rcb11           : 1;
    unsigned int rcb10           : 1;
    unsigned int rcb9            : 1;
    unsigned int rcb8            : 1;
    unsigned int rcb7            : 1;
    unsigned int rcb6            : 1;
    unsigned int rcb5            : 1;
    unsigned int rcb4            : 1;
    unsigned int rcb3            : 1;
    unsigned int rcb2            : 1;
    unsigned int rcb1            : 1;
    unsigned int rcb0            : 1;
} avr32_hmatrixb_mrcr_t;


typedef struct avr32_hmatrixb_prs_t {
  union {
          unsigned long                  pras      ;//0x0000
          avr32_hmatrixb_pras_t          PRAS      ;
  };
  union {
          unsigned long                  prbs      ;//0x0004
          avr32_hmatrixb_prbs_t          PRBS      ;
  };
} avr32_hmatrixb_prs_t;


typedef struct avr32_hmatrixb_t {
  union {
          unsigned long                  mcfg      [16];//0x0000
          avr32_hmatrixb_mcfg_t          MCFG      [16];
  };
  union {
          unsigned long                  scfg      [16];//0x0040
          avr32_hmatrixb_scfg_t          SCFG      [16];
  };
  avr32_hmatrixb_prs_t prs[16];//0x80
  union {
          unsigned long                  mrcr      ;//0x0100
          avr32_hmatrixb_mrcr_t          MRCR      ;
  };
          unsigned int                   :32       ;//0x0104
          unsigned int                   :32       ;//0x0108
          unsigned int                   :32       ;//0x010c
          unsigned long                  sfr       [16];//0x0110
} avr32_hmatrixb_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_HMATRIXB_130_H_INCLUDED*/
#endif

