/*****************************************************************************
 *
 * Copyright (C) 2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_IISC_TXSAME_MASK                              0x00004000
#define AVR32_IISC_TXSAME_OFFSET                                    14
#define AVR32_IISC_TXSAME_SAME                              0x00000001
#define AVR32_IISC_TXSAME_SIZE                                       1
#define AVR32_IISC_TXSAME_ZERO                              0x00000000
#define AVR32_IISC_TXUR                                              6
#define AVR32_IISC_TXURCH                                           20
#define AVR32_IISC_TXURCH_LEFT                              0x00000000
#define AVR32_IISC_TXURCH_MASK                              0x0ff00000
#define AVR32_IISC_TXURCH_OFFSET                                    20
#define AVR32_IISC_TXURCH_RIGHT                             0x00000001
#define AVR32_IISC_TXURCH_SIZE                                       8
#define AVR32_IISC_TXUR_CLEAR                               0x00000001
#define AVR32_IISC_TXUR_DISABLED                            0x00000000
#define AVR32_IISC_TXUR_ENABLED                             0x00000001
#define AVR32_IISC_TXUR_MASK                                0x00000040
#define AVR32_IISC_TXUR_NO                                  0x00000000
#define AVR32_IISC_TXUR_OFF                                 0x00000000
#define AVR32_IISC_TXUR_OFFSET                                       6
#define AVR32_IISC_TXUR_ON                                  0x00000001
#define AVR32_IISC_TXUR_SET                                 0x00000001
#define AVR32_IISC_TXUR_SIZE                                         1
#define AVR32_IISC_TXUR_YES                                 0x00000001
#define AVR32_IISC_VARIANT                                          16
#define AVR32_IISC_VARIANT_MASK                             0x000f0000
#define AVR32_IISC_VARIANT_OFFSET                                   16
#define AVR32_IISC_VARIANT_SIZE                                      4
#define AVR32_IISC_VERSION                                  0x00000028
#define AVR32_IISC_VERSION_MASK                             0x000f0fff
#define AVR32_IISC_VERSION_OFFSET                                    0
#define AVR32_IISC_VERSION_RESETVALUE                       0x00000200
#define AVR32_IISC_VERSION_SIZE                                     12
#define AVR32_IISC_VERSION_VARIANT                                  16
#define AVR32_IISC_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_IISC_VERSION_VARIANT_OFFSET                           16
#define AVR32_IISC_VERSION_VARIANT_SIZE                              4
#define AVR32_IISC_VERSION_VERSION                                   0
#define AVR32_IISC_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_IISC_VERSION_VERSION_OFFSET                            0
#define AVR32_IISC_VERSION_VERSION_SIZE                             12
#define AVR32_IISC_YES                                      0x00000001
#define AVR32_IISC_ZERO                                     0x00000000




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_iisc_cr_t {
    unsigned int                 :24;
    unsigned int swrst           : 1;
    unsigned int                 : 1;
    unsigned int txdis           : 1;
    unsigned int txen            : 1;
    unsigned int ckdis           : 1;
    unsigned int cken            : 1;
    unsigned int rxdis           : 1;
    unsigned int rxen            : 1;
} avr32_iisc_cr_t;



typedef struct avr32_iisc_mr_t {
    unsigned int iws24           : 1;
    unsigned int imckmode        : 1;
    unsigned int imckfs          : 6;
    unsigned int tdmfs           : 2;
    unsigned int                 : 3;
    unsigned int nbchan          : 3;
    unsigned int                 : 1;
    unsigned int txsame          : 1;
    unsigned int txdma           : 1;
    unsigned int txmono          : 1;
    unsigned int                 : 1;
    unsigned int rxloop          : 1;
    unsigned int rxdma           : 1;
    unsigned int rxmono          : 1;
    unsigned int format          : 2;
    unsigned int                 : 1;
    unsigned int datalength      : 3;
    unsigned int                 : 1;
    unsigned int mode            : 1;
} avr32_iisc_mr_t;



typedef struct avr32_iisc_sr_t {
    unsigned int                 : 4;
    unsigned int txurch          : 8;
    unsigned int                 : 4;
    unsigned int rxorch          : 8;
    unsigned int                 : 1;
    unsigned int txur            : 1;
    unsigned int txrdy           : 1;
    unsigned int txen            : 1;
    unsigned int                 : 1;
    unsigned int rxor            : 1;
    unsigned int rxrdy           : 1;
    unsigned int rxen            : 1;
} avr32_iisc_sr_t;



typedef struct avr32_iisc_scr_t {
    unsigned int                 :25;
    unsigned int txur            : 1;
    unsigned int                 : 3;
    unsigned int rxor            : 1;
    unsigned int                 : 2;
} avr32_iisc_scr_t;



typedef struct avr32_iisc_ssr_t {
    unsigned int                 : 4;
    unsigned int txurch          : 8;
    unsigned int                 : 4;
    unsigned int rxorch          : 8;
    unsigned int                 : 1;
    unsigned int txur            : 1;
    unsigned int                 : 3;
    unsigned int rxor            : 1;
    unsigned int                 : 2;
} avr32_iisc_ssr_t;



typedef struct avr32_iisc_ier_t {
    unsigned int                 :25;
    unsigned int txur            : 1;
    unsigned int txrdy           : 1;
    unsigned int                 : 2;
    unsigned int rxor            : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 1;
} avr32_iisc_ier_t;



typedef struct avr32_iisc_idr_t {
    unsigned int                 :25;
    unsigned int txur            : 1;
    unsigned int txrdy           : 1;
    unsigned int                 : 2;
    unsigned int rxor            : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 1;
} avr32_iisc_idr_t;



typedef struct avr32_iisc_imr_t {
    unsigned int                 :25;
    unsigned int txur            : 1;
    unsigned int txrdy           : 1;
    unsigned int                 : 2;
    unsigned int rxor            : 1;
    unsigned int rxrdy           : 1;
    unsigned int                 : 1;
} avr32_iisc_imr_t;



typedef struct avr32_iisc_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_iisc_version_t;



typedef struct avr32_iisc_parameter_t {
    unsigned int                 :13;
    unsigned int nbchan          : 3;
    unsigned int                 : 8;
    unsigned int format          : 1;
    unsigned int                 : 4;
    unsigned int nbdmachan       : 3;
} avr32_iisc_parameter_t;



typedef struct avr32_iisc_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_iisc_cr_t                CR        ;
  };
  union {
          unsigned long                  mr        ;//0x0004
          avr32_iisc_mr_t                MR        ;
  };
  union {
    const unsigned long                  sr        ;//0x0008
    const avr32_iisc_sr_t                SR        ;
  };
  union {
          unsigned long                  scr       ;//0x000c
          avr32_iisc_scr_t               SCR       ;
  };
  union {
          unsigned long                  ssr       ;//0x0010
          avr32_iisc_ssr_t               SSR       ;
  };
  union {
          unsigned long                  ier       ;//0x0014
          avr32_iisc_ier_t               IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0018
          avr32_iisc_idr_t               IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x001c
    const avr32_iisc_imr_t               IMR       ;
  };
    const unsigned long                  rhr       ;//0x0020
          unsigned long                  thr       ;//0x0024
  union {
    const unsigned long                  version   ;//0x0028
    const avr32_iisc_version_t           VERSION   ;
  };
  union {
    const unsigned long                  parameter ;//0x002c
    const avr32_iisc_parameter_t         PARAMETER ;
  };
} avr32_iisc_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_IISC_200_H_INCLUDED*/
#endif

