/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_ISI_Y2R_SET0_C0_OFFSET                                0
#define AVR32_ISI_Y2R_SET0_C0_SIZE                                  8
#define AVR32_ISI_Y2R_SET0_C1                                       8
#define AVR32_ISI_Y2R_SET0_C1_MASK                         0x0000ff00
#define AVR32_ISI_Y2R_SET0_C1_OFFSET                                8
#define AVR32_ISI_Y2R_SET0_C1_SIZE                                  8
#define AVR32_ISI_Y2R_SET0_C2                                      16
#define AVR32_ISI_Y2R_SET0_C2_MASK                         0x00ff0000
#define AVR32_ISI_Y2R_SET0_C2_OFFSET                               16
#define AVR32_ISI_Y2R_SET0_C2_SIZE                                  8
#define AVR32_ISI_Y2R_SET0_C3                                      24
#define AVR32_ISI_Y2R_SET0_C3_MASK                         0xff000000
#define AVR32_ISI_Y2R_SET0_C3_OFFSET                               24
#define AVR32_ISI_Y2R_SET0_C3_SIZE                                  8
#define AVR32_ISI_Y2R_SET1                                 0x00000034
#define AVR32_ISI_Y2R_SET1_C4                                       0
#define AVR32_ISI_Y2R_SET1_C4_MASK                         0x000001ff
#define AVR32_ISI_Y2R_SET1_C4_OFFSET                                0
#define AVR32_ISI_Y2R_SET1_C4_SIZE                                  9
#define AVR32_ISI_Y2R_SET1_CBOFF                                   14
#define AVR32_ISI_Y2R_SET1_CBOFF_MASK                      0x00004000
#define AVR32_ISI_Y2R_SET1_CBOFF_OFFSET                            14
#define AVR32_ISI_Y2R_SET1_CBOFF_SIZE                               1
#define AVR32_ISI_Y2R_SET1_CROFF                                   13
#define AVR32_ISI_Y2R_SET1_CROFF_MASK                      0x00002000
#define AVR32_ISI_Y2R_SET1_CROFF_OFFSET                            13
#define AVR32_ISI_Y2R_SET1_CROFF_SIZE                               1
#define AVR32_ISI_Y2R_SET1_YOFF                                    12
#define AVR32_ISI_Y2R_SET1_YOFF_MASK                       0x00001000
#define AVR32_ISI_Y2R_SET1_YOFF_OFFSET                             12
#define AVR32_ISI_Y2R_SET1_YOFF_SIZE                                1
#define AVR32_ISI_YCC_SWAP                                         28
#define AVR32_ISI_YCC_SWAP_DEFAULT                         0x00000000
#define AVR32_ISI_YCC_SWAP_MASK                            0x30000000
#define AVR32_ISI_YCC_SWAP_MODE_1                          0x00000001
#define AVR32_ISI_YCC_SWAP_MODE_2                          0x00000002
#define AVR32_ISI_YCC_SWAP_MODE_3                          0x00000003
#define AVR32_ISI_YCC_SWAP_OFFSET                                  28
#define AVR32_ISI_YCC_SWAP_SIZE                                     2
#define AVR32_ISI_YOFF                                             12
#define AVR32_ISI_YOFF_MASK                                0x00001000
#define AVR32_ISI_YOFF_OFFSET                                      12
#define AVR32_ISI_YOFF_SIZE                                         1




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_isi_cr1_t {
    unsigned int sfd             : 8;
    unsigned int sld             : 8;
    unsigned int codec_en        : 1;
    unsigned int thmask          : 2;
    unsigned int full            : 1;
    unsigned int                 : 1;
    unsigned int frate           : 3;
    unsigned int crc_sync        : 1;
    unsigned int emb_sync        : 1;
    unsigned int                 : 1;
    unsigned int pixclk_pol      : 1;
    unsigned int vsync_pol       : 1;
    unsigned int hsync_pol       : 1;
    unsigned int dis             : 1;
    unsigned int rst             : 1;
} avr32_isi_cr1_t;



typedef struct avr32_isi_cr2_t {
    unsigned int rgb_cfg         : 2;
    unsigned int ycc_swap        : 2;
    unsigned int                 : 1;
    unsigned int im_hsize        :11;
    unsigned int col_space       : 1;
    unsigned int rgb_swap        : 1;
    unsigned int grayscale       : 1;
    unsigned int rgb_mode        : 1;
    unsigned int gs_mode         : 1;
    unsigned int im_vsize        :11;
} avr32_isi_cr2_t;



typedef struct avr32_isi_sr_t {
    unsigned int                 :22;
    unsigned int fr_ovr          : 1;
    unsigned int fo_c_emp        : 1;
    unsigned int fo_p_emp        : 1;
    unsigned int fo_p_ovf        : 1;
    unsigned int fo_c_ovf        : 1;
    unsigned int crc_err         : 1;
    unsigned int cdc_stat        : 1;
    unsigned int softrst         : 1;
    unsigned int dis             : 1;
    unsigned int sof             : 1;
} avr32_isi_sr_t;



typedef struct avr32_isi_ier_t {
    unsigned int                 :22;
    unsigned int fr_ovr          : 1;
    unsigned int fo_c_emp        : 1;
    unsigned int fo_p_emp        : 1;
    unsigned int fo_p_ovf        : 1;
    unsigned int fo_c_ovf        : 1;
    unsigned int crc_err         : 1;
    unsigned int                 : 1;
    unsigned int softrst         : 1;
    unsigned int dis             : 1;
    unsigned int sof             : 1;
} avr32_isi_ier_t;



typedef struct avr32_isi_idr_t {
    unsigned int                 :22;
    unsigned int fr_ovr          : 1;
    unsigned int fo_c_emp        : 1;
    unsigned int fo_p_emp        : 1;
    unsigned int fo_p_ovf        : 1;
    unsigned int fo_c_ovf        : 1;
    unsigned int crc_err         : 1;
    unsigned int                 : 1;
    unsigned int softrst         : 1;
    unsigned int dis             : 1;
    unsigned int sof             : 1;
} avr32_isi_idr_t;



typedef struct avr32_isi_imr_t {
    unsigned int                 :22;
    unsigned int fr_ovr          : 1;
    unsigned int fo_c_emp        : 1;
    unsigned int fo_p_emp        : 1;
    unsigned int fo_p_ovf        : 1;
    unsigned int fo_c_ovf        : 1;
    unsigned int crc_err         : 1;
    unsigned int                 : 1;
    unsigned int softrst         : 1;
    unsigned int dis             : 1;
    unsigned int sof             : 1;
} avr32_isi_imr_t;



typedef struct avr32_isi_psize_t {
    unsigned int                 : 6;
    unsigned int prev_hsize      :10;
    unsigned int                 : 6;
    unsigned int prev_vsize      :10;
} avr32_isi_psize_t;



typedef struct avr32_isi_pdecf_t {
    unsigned int                 :24;
    unsigned int dec_factor      : 8;
} avr32_isi_pdecf_t;



typedef struct avr32_isi_y2r_set0_t {
    unsigned int c3              : 8;
    unsigned int c2              : 8;
    unsigned int c1              : 8;
    unsigned int c0              : 8;
} avr32_isi_y2r_set0_t;



typedef struct avr32_isi_y2r_set1_t {
    unsigned int                 :17;
    unsigned int cboff           : 1;
    unsigned int croff           : 1;
    unsigned int yoff            : 1;
    unsigned int                 : 3;
    unsigned int c4              : 9;
} avr32_isi_y2r_set1_t;



typedef struct avr32_isi_r2y_set0_t {
    unsigned int                 : 7;
    unsigned int roff            : 1;
    unsigned int                 : 1;
    unsigned int c2              : 7;
    unsigned int                 : 1;
    unsigned int c1              : 7;
    unsigned int                 : 1;
    unsigned int c0              : 7;
} avr32_isi_r2y_set0_t;



typedef struct avr32_isi_r2y_set1_t {
    unsigned int                 : 7;
    unsigned int goff            : 1;
    unsigned int                 : 1;
    unsigned int c5              : 7;
    unsigned int                 : 1;
    unsigned int c4              : 7;
    unsigned int                 : 1;
    unsigned int c3              : 7;
} avr32_isi_r2y_set1_t;



typedef struct avr32_isi_r2y_set2_t {
    unsigned int                 : 7;
    unsigned int boff            : 1;
    unsigned int                 : 1;
    unsigned int c8              : 7;
    unsigned int                 : 1;
    unsigned int c7              : 7;
    unsigned int                 : 1;
    unsigned int c6              : 7;
} avr32_isi_r2y_set2_t;



typedef struct avr32_isi_t {
  union {
          unsigned long                  cr1       ;//0x0000
          avr32_isi_cr1_t                CR1       ;
  };
  union {
          unsigned long                  cr2       ;//0x0004
          avr32_isi_cr2_t                CR2       ;
  };
  union {
    const unsigned long                  sr        ;//0x0008
    const avr32_isi_sr_t                 SR        ;
  };
  union {
          unsigned long                  ier       ;//0x000c
          avr32_isi_ier_t                IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0010
          avr32_isi_idr_t                IDR       ;
  };
  union {
          unsigned long                  imr       ;//0x0014
          avr32_isi_imr_t                IMR       ;
  };
          unsigned int                   :32       ;//0x0018
          unsigned int                   :32       ;//0x001c
  union {
          unsigned long                  psize     ;//0x0020
          avr32_isi_psize_t              PSIZE     ;
  };
  union {
          unsigned long                  pdecf     ;//0x0024
          avr32_isi_pdecf_t              PDECF     ;
  };
          unsigned long                  ppfbd     ;//0x0028
          unsigned long                  cdba      ;//0x002c
  union {
          unsigned long                  y2r_set0  ;//0x0030
          avr32_isi_y2r_set0_t           Y2R_SET0  ;
  };
  union {
          unsigned long                  y2r_set1  ;//0x0034
          avr32_isi_y2r_set1_t           Y2R_SET1  ;
  };
  union {
          unsigned long                  r2y_set0  ;//0x0038
          avr32_isi_r2y_set0_t           R2Y_SET0  ;
  };
  union {
          unsigned long                  r2y_set1  ;//0x003c
          avr32_isi_r2y_set1_t           R2Y_SET1  ;
  };
  union {
          unsigned long                  r2y_set2  ;//0x0040
          avr32_isi_r2y_set2_t           R2Y_SET2  ;
  };
} avr32_isi_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_ISI_0051_H_INCLUDED*/
#endif

