/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_KEYPAD_SENSEDATA3_MASK                          0x00ff0000
#define AVR32_KEYPAD_SENSEDATA3_OFFSET                                16
#define AVR32_KEYPAD_SENSEDATA3_SIZE                                   8
#define AVR32_KEYPAD_SENSEDATA4                                        0
#define AVR32_KEYPAD_SENSEDATA4_MASK                          0x000000ff
#define AVR32_KEYPAD_SENSEDATA4_OFFSET                                 0
#define AVR32_KEYPAD_SENSEDATA4_SIZE                                   8
#define AVR32_KEYPAD_SENSEDATA5                                       16
#define AVR32_KEYPAD_SENSEDATA5_MASK                          0x00ff0000
#define AVR32_KEYPAD_SENSEDATA5_OFFSET                                16
#define AVR32_KEYPAD_SENSEDATA5_SIZE                                   8
#define AVR32_KEYPAD_SENSEDATA6                                        0
#define AVR32_KEYPAD_SENSEDATA6_MASK                          0x000000ff
#define AVR32_KEYPAD_SENSEDATA6_OFFSET                                 0
#define AVR32_KEYPAD_SENSEDATA6_SIZE                                   8
#define AVR32_KEYPAD_SENSEDATA7                                       16
#define AVR32_KEYPAD_SENSEDATA7_MASK                          0x00ff0000
#define AVR32_KEYPAD_SENSEDATA7_OFFSET                                16
#define AVR32_KEYPAD_SENSEDATA7_SIZE                                   8
#define AVR32_KEYPAD_SENSEDATA_MASK                           0x000000ff
#define AVR32_KEYPAD_SENSEDATA_OFFSET                                  0
#define AVR32_KEYPAD_SENSEDATA_SIZE                                    8
#define AVR32_KEYPAD_STATUS                                           29
#define AVR32_KEYPAD_STATUS_MASK                              0x60000000
#define AVR32_KEYPAD_STATUS_MULTIPLE_KEYS_PRESSED             0x00000003
#define AVR32_KEYPAD_STATUS_NO_KEY_PRESSED                    0x00000000
#define AVR32_KEYPAD_STATUS_OFFSET                                    29
#define AVR32_KEYPAD_STATUS_ONE_KEY_PRESSED                   0x00000001
#define AVR32_KEYPAD_STATUS_SIZE                                       2
#define AVR32_KEYPAD_UPD                                              31
#define AVR32_KEYPAD_UPD_MASK                                 0x80000000
#define AVR32_KEYPAD_UPD_OFFSET                                       31
#define AVR32_KEYPAD_UPD_SIZE                                          1
#define AVR32_KEYPAD_VERSION                                  0x0000004c
#define AVR32_KEYPAD_VERSION_MASK                             0x00000fff
#define AVR32_KEYPAD_VERSION_OFFSET                                    0
#define AVR32_KEYPAD_VERSION_SIZE                                     12
#define AVR32_KEYPAD_VERSION_VERSION                                   0
#define AVR32_KEYPAD_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_KEYPAD_VERSION_VERSION_OFFSET                            0
#define AVR32_KEYPAD_VERSION_VERSION_SIZE                             12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_keypad_control_t {
    unsigned int                 :22;
    unsigned int presc           : 2;
    unsigned int                 : 1;
    unsigned int act             : 1;
    unsigned int ascan           : 1;
    unsigned int mkp             : 1;
    unsigned int r1en            : 1;
    unsigned int r0en            : 1;
    unsigned int den             : 1;
    unsigned int men             : 1;
} avr32_keypad_control_t;



typedef struct avr32_keypad_config_t {
    unsigned int                 : 8;
    unsigned int den             : 8;
    unsigned int rows            : 8;
    unsigned int columns         : 8;
} avr32_keypad_config_t;



typedef struct avr32_keypad_sdr_t {
    unsigned int                 :28;
    unsigned int sdr             : 4;
} avr32_keypad_sdr_t;



typedef struct avr32_keypad_debi_t {
    unsigned int                 : 8;
    unsigned int rdebi           : 8;
    unsigned int ddebi           : 8;
    unsigned int mdebi           : 8;
} avr32_keypad_debi_t;



typedef struct avr32_keypad_rot_t {
    unsigned int upd             : 1;
    unsigned int                 : 7;
    unsigned int r1cnt           : 8;
    unsigned int                 : 8;
    unsigned int r0cnt           : 8;
} avr32_keypad_rot_t;



typedef struct avr32_keypad_mandrive_t {
    unsigned int                 :24;
    unsigned int mandrive        : 8;
} avr32_keypad_mandrive_t;



typedef struct avr32_keypad_dsense_t {
    unsigned int upd             : 1;
    unsigned int                 :23;
    unsigned int sensedata       : 8;
} avr32_keypad_dsense_t;



typedef struct avr32_keypad_msense_t {
    unsigned int                 :24;
    unsigned int sensedata       : 8;
} avr32_keypad_msense_t;



typedef struct avr32_keypad_asense_t {
    unsigned int scan            : 1;
    unsigned int status          : 2;
    unsigned int                 :18;
    unsigned int row             : 3;
    unsigned int                 : 5;
    unsigned int column          : 3;
} avr32_keypad_asense_t;



typedef struct avr32_keypad_mkpsense0_t {
    unsigned int scan            : 1;
    unsigned int                 : 7;
    unsigned int sensedata1      : 8;
    unsigned int                 : 8;
    unsigned int sensedata0      : 8;
} avr32_keypad_mkpsense0_t;



typedef struct avr32_keypad_mkpsense1_t {
    unsigned int scan            : 1;
    unsigned int                 : 7;
    unsigned int sensedata3      : 8;
    unsigned int                 : 8;
    unsigned int sensedata2      : 8;
} avr32_keypad_mkpsense1_t;



typedef struct avr32_keypad_mkpsense2_t {
    unsigned int scan            : 1;
    unsigned int                 : 7;
    unsigned int sensedata5      : 8;
    unsigned int                 : 8;
    unsigned int sensedata4      : 8;
} avr32_keypad_mkpsense2_t;



typedef struct avr32_keypad_mkpsense3_t {
    unsigned int scan            : 1;
    unsigned int                 : 7;
    unsigned int sensedata7      : 8;
    unsigned int                 : 8;
    unsigned int sensedata6      : 8;
} avr32_keypad_mkpsense3_t;



typedef struct avr32_keypad_ier_t {
    unsigned int                 :27;
    unsigned int rint1           : 1;
    unsigned int rint0           : 1;
    unsigned int dmint           : 1;
    unsigned int dcint           : 1;
    unsigned int mint            : 1;
} avr32_keypad_ier_t;



typedef struct avr32_keypad_idr_t {
    unsigned int                 :27;
    unsigned int rint1           : 1;
    unsigned int rint0           : 1;
    unsigned int dmint           : 1;
    unsigned int dcint           : 1;
    unsigned int mint            : 1;
} avr32_keypad_idr_t;



typedef struct avr32_keypad_imr_t {
    unsigned int                 :27;
    unsigned int rint1           : 1;
    unsigned int rint0           : 1;
    unsigned int dmint           : 1;
    unsigned int dcint           : 1;
    unsigned int mint            : 1;
} avr32_keypad_imr_t;



typedef struct avr32_keypad_isr_t {
    unsigned int                 :27;
    unsigned int rint1           : 1;
    unsigned int rint0           : 1;
    unsigned int dmint           : 1;
    unsigned int dcint           : 1;
    unsigned int mint            : 1;
} avr32_keypad_isr_t;



typedef struct avr32_keypad_icr_t {
    unsigned int                 :27;
    unsigned int rint1           : 1;
    unsigned int rint0           : 1;
    unsigned int dmint           : 1;
    unsigned int dcint           : 1;
    unsigned int mint            : 1;
} avr32_keypad_icr_t;



typedef struct avr32_keypad_parameter_t {
    unsigned int                 :16;
    unsigned int row             : 8;
    unsigned int column          : 8;
} avr32_keypad_parameter_t;



typedef struct avr32_keypad_version_t {
    unsigned int                 :20;
    unsigned int version         :12;
} avr32_keypad_version_t;



typedef struct avr32_keypad_t {
  union {
          unsigned long                  control   ;//0x0000
          avr32_keypad_control_t         CONTROL   ;
  };
  union {
          unsigned long                  config    ;//0x0004
          avr32_keypad_config_t          CONFIG    ;
  };
  union {
          unsigned long                  sdr       ;//0x0008
          avr32_keypad_sdr_t             SDR       ;
  };
  union {
          unsigned long                  debi      ;//0x000c
          avr32_keypad_debi_t            DEBI      ;
  };
  union {
    const unsigned long                  rot       ;//0x0010
    const avr32_keypad_rot_t             ROT       ;
  };
  union {
          unsigned long                  mandrive  ;//0x0014
          avr32_keypad_mandrive_t        MANDRIVE  ;
  };
  union {
    const unsigned long                  dsense    ;//0x0018
    const avr32_keypad_dsense_t          DSENSE    ;
  };
  union {
    const unsigned long                  msense    ;//0x001c
    const avr32_keypad_msense_t          MSENSE    ;
  };
  union {
    const unsigned long                  asense    ;//0x0020
    const avr32_keypad_asense_t          ASENSE    ;
  };
  union {
    const unsigned long                  mkpsense0 ;//0x0024
    const avr32_keypad_mkpsense0_t       MKPSENSE0 ;
  };
  union {
    const unsigned long                  mkpsense1 ;//0x0028
    const avr32_keypad_mkpsense1_t       MKPSENSE1 ;
  };
  union {
    const unsigned long                  mkpsense2 ;//0x002c
    const avr32_keypad_mkpsense2_t       MKPSENSE2 ;
  };
  union {
    const unsigned long                  mkpsense3 ;//0x0030
    const avr32_keypad_mkpsense3_t       MKPSENSE3 ;
  };
  union {
          unsigned long                  ier       ;//0x0034
          avr32_keypad_ier_t             IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0038
          avr32_keypad_idr_t             IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x003c
    const avr32_keypad_imr_t             IMR       ;
  };
  union {
    const unsigned long                  isr       ;//0x0040
    const avr32_keypad_isr_t             ISR       ;
  };
  union {
          unsigned long                  icr       ;//0x0044
          avr32_keypad_icr_t             ICR       ;
  };
  union {
    const unsigned long                  parameter ;//0x0048
    const avr32_keypad_parameter_t       PARAMETER ;
  };
  union {
    const unsigned long                  version   ;//0x004c
    const avr32_keypad_version_t         VERSION   ;
  };
} avr32_keypad_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_KEYPAD_100_H_INCLUDED*/
#endif

