/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_MACB_USRIO_TX_PAUSE                                    2
#define AVR32_MACB_USRIO_TX_PAUSE_MASK                      0x00000004
#define AVR32_MACB_USRIO_TX_PAUSE_OFFSET                             2
#define AVR32_MACB_USRIO_TX_PAUSE_SIZE                               1
#define AVR32_MACB_USRIO_TX_PAUSE_ZERO                               3
#define AVR32_MACB_USRIO_TX_PAUSE_ZERO_MASK                 0x00000008
#define AVR32_MACB_USRIO_TX_PAUSE_ZERO_OFFSET                        3
#define AVR32_MACB_USRIO_TX_PAUSE_ZERO_SIZE                          1
#define AVR32_MACB_VERSION                                  0x000000fc
#define AVR32_MACB_VERSION_PART_REFERENCE                           16
#define AVR32_MACB_VERSION_PART_REFERENCE_MASK              0xffff0000
#define AVR32_MACB_VERSION_PART_REFERENCE_OFFSET                    16
#define AVR32_MACB_VERSION_PART_REFERENCE_SIZE                      16
#define AVR32_MACB_VERSION_REVISION_REFERENCE                        0
#define AVR32_MACB_VERSION_REVISION_REFERENCE_MASK          0x0000ffff
#define AVR32_MACB_VERSION_REVISION_REFERENCE_OFFSET                 0
#define AVR32_MACB_VERSION_REVISION_REFERENCE_SIZE                  16
#define AVR32_MACB_WESTAT                                            7
#define AVR32_MACB_WESTAT_MASK                              0x00000080
#define AVR32_MACB_WESTAT_OFFSET                                     7
#define AVR32_MACB_WESTAT_SIZE                                       1
#define AVR32_MACB_WOL                                      0x000000c4
#define AVR32_MACB_WOL_ARP                                          17
#define AVR32_MACB_WOL_ARP_MASK                             0x00020000
#define AVR32_MACB_WOL_ARP_OFFSET                                   17
#define AVR32_MACB_WOL_ARP_SIZE                                      1
#define AVR32_MACB_WOL_IP                                            0
#define AVR32_MACB_WOL_IP_MASK                              0x0000ffff
#define AVR32_MACB_WOL_IP_OFFSET                                     0
#define AVR32_MACB_WOL_IP_SIZE                                      16
#define AVR32_MACB_WOL_MAG                                          16
#define AVR32_MACB_WOL_MAG_MASK                             0x00010000
#define AVR32_MACB_WOL_MAG_OFFSET                                   16
#define AVR32_MACB_WOL_MAG_SIZE                                      1
#define AVR32_MACB_WOL_MTI                                          19
#define AVR32_MACB_WOL_MTI_MASK                             0x00080000
#define AVR32_MACB_WOL_MTI_OFFSET                                   19
#define AVR32_MACB_WOL_MTI_SIZE                                      1
#define AVR32_MACB_WOL_SA1                                          18
#define AVR32_MACB_WOL_SA1_MASK                             0x00040000
#define AVR32_MACB_WOL_SA1_OFFSET                                   18
#define AVR32_MACB_WOL_SA1_SIZE                                      1




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_macb_ncr_t {
    unsigned int                 :19;
    unsigned int tzq             : 1;
    unsigned int tpf             : 1;
    unsigned int thalt           : 1;
    unsigned int tstart          : 1;
    unsigned int bp              : 1;
    unsigned int westat          : 1;
    unsigned int incstat         : 1;
    unsigned int clrstat         : 1;
    unsigned int mpe             : 1;
    unsigned int te              : 1;
    unsigned int re              : 1;
    unsigned int llb             : 1;
    unsigned int lb              : 1;
} avr32_macb_ncr_t;



typedef struct avr32_macb_ncfgr_t {
    unsigned int                 :12;
    unsigned int irxfcs          : 1;
    unsigned int efrhd           : 1;
    unsigned int drfcs           : 1;
    unsigned int rlce            : 1;
    unsigned int rbof            : 2;
    unsigned int pae             : 1;
    unsigned int rty             : 1;
    unsigned int clk             : 2;
    unsigned int eae             : 1;
    unsigned int big             : 1;
    unsigned int uni             : 1;
    unsigned int mti             : 1;
    unsigned int nbc             : 1;
    unsigned int caf             : 1;
    unsigned int jframe          : 1;
    unsigned int bit_rate        : 1;
    unsigned int fd              : 1;
    unsigned int spd             : 1;
} avr32_macb_ncfgr_t;



typedef struct avr32_macb_nsr_t {
    unsigned int                 :29;
    unsigned int idle            : 1;
    unsigned int mdio            : 1;
    unsigned int                 : 1;
} avr32_macb_nsr_t;



typedef struct avr32_macb_tsr_t {
    unsigned int                 :25;
    unsigned int und             : 1;
    unsigned int comp            : 1;
    unsigned int bex             : 1;
    unsigned int tgo             : 1;
    unsigned int rle             : 1;
    unsigned int col             : 1;
    unsigned int ubr             : 1;
} avr32_macb_tsr_t;



typedef struct avr32_macb_rsr_t {
    unsigned int                 :29;
    unsigned int ovr             : 1;
    unsigned int rec             : 1;
    unsigned int bna             : 1;
} avr32_macb_rsr_t;



typedef struct avr32_macb_isr_t {
    unsigned int                 :18;
    unsigned int ptz             : 1;
    unsigned int pfr             : 1;
    unsigned int hresp           : 1;
    unsigned int rovr            : 1;
    unsigned int                 : 2;
    unsigned int tcomp           : 1;
    unsigned int txerr           : 1;
    unsigned int rle             : 1;
    unsigned int tund            : 1;
    unsigned int txubr           : 1;
    unsigned int rxubr           : 1;
    unsigned int rcomp           : 1;
    unsigned int mfd             : 1;
} avr32_macb_isr_t;



typedef struct avr32_macb_ier_t {
    unsigned int                 :18;
    unsigned int ptz             : 1;
    unsigned int pfr             : 1;
    unsigned int hresp           : 1;
    unsigned int rovr            : 1;
    unsigned int                 : 2;
    unsigned int tcomp           : 1;
    unsigned int txerr           : 1;
    unsigned int rle             : 1;
    unsigned int tund            : 1;
    unsigned int txubr           : 1;
    unsigned int rxubr           : 1;
    unsigned int rcomp           : 1;
    unsigned int mfd             : 1;
} avr32_macb_ier_t;



typedef struct avr32_macb_idr_t {
    unsigned int                 :18;
    unsigned int ptz             : 1;
    unsigned int pfr             : 1;
    unsigned int hresp           : 1;
    unsigned int rovr            : 1;
    unsigned int                 : 2;
    unsigned int tcomp           : 1;
    unsigned int txerr           : 1;
    unsigned int rle             : 1;
    unsigned int tund            : 1;
    unsigned int txubr           : 1;
    unsigned int rxubr           : 1;
    unsigned int rcomp           : 1;
    unsigned int mfd             : 1;
} avr32_macb_idr_t;



typedef struct avr32_macb_imr_t {
    unsigned int                 :18;
    unsigned int ptz             : 1;
    unsigned int pfr             : 1;
    unsigned int hresp           : 1;
    unsigned int rovr            : 1;
    unsigned int                 : 2;
    unsigned int tcomp           : 1;
    unsigned int txerr           : 1;
    unsigned int rle             : 1;
    unsigned int tund            : 1;
    unsigned int txubr           : 1;
    unsigned int rxubr           : 1;
    unsigned int rcomp           : 1;
    unsigned int mfd             : 1;
} avr32_macb_imr_t;



typedef struct avr32_macb_man_t {
    unsigned int sof             : 2;
    unsigned int rw              : 2;
    unsigned int phya            : 5;
    unsigned int rega            : 5;
    unsigned int code            : 2;
    unsigned int data            :16;
} avr32_macb_man_t;



typedef struct avr32_macb_ptr_t {
    unsigned int                 :16;
    unsigned int ptime           :16;
} avr32_macb_ptr_t;



typedef struct avr32_macb_pfr_t {
    unsigned int                 :16;
    unsigned int frok            :16;
} avr32_macb_pfr_t;



typedef struct avr32_macb_fto_t {
    unsigned int                 : 8;
    unsigned int ftok            :24;
} avr32_macb_fto_t;



typedef struct avr32_macb_scf_t {
    unsigned int                 :16;
    unsigned int scf             :16;
} avr32_macb_scf_t;



typedef struct avr32_macb_mcf_t {
    unsigned int                 :16;
    unsigned int mcf             :16;
} avr32_macb_mcf_t;



typedef struct avr32_macb_fro_t {
    unsigned int                 : 8;
    unsigned int frok            :24;
} avr32_macb_fro_t;



typedef struct avr32_macb_fcse_t {
    unsigned int                 :24;
    unsigned int fcse            : 8;
} avr32_macb_fcse_t;



typedef struct avr32_macb_ale_t {
    unsigned int                 :24;
    unsigned int ale             : 8;
} avr32_macb_ale_t;



typedef struct avr32_macb_dtf_t {
    unsigned int                 :16;
    unsigned int dtf             :16;
} avr32_macb_dtf_t;



typedef struct avr32_macb_lcol_t {
    unsigned int                 :24;
    unsigned int lcol            : 8;
} avr32_macb_lcol_t;



typedef struct avr32_macb_excol_t {
    unsigned int                 :24;
    unsigned int excol           : 8;
} avr32_macb_excol_t;



typedef struct avr32_macb_tund_t {
    unsigned int                 :24;
    unsigned int tund            : 8;
} avr32_macb_tund_t;



typedef struct avr32_macb_cse_t {
    unsigned int                 :24;
    unsigned int cse             : 8;
} avr32_macb_cse_t;



typedef struct avr32_macb_rre_t {
    unsigned int                 :16;
    unsigned int rre             :16;
} avr32_macb_rre_t;



typedef struct avr32_macb_rovr_t {
    unsigned int                 :24;
    unsigned int rovr            : 8;
} avr32_macb_rovr_t;



typedef struct avr32_macb_rse_t {
    unsigned int                 :24;
    unsigned int rse             : 8;
} avr32_macb_rse_t;



typedef struct avr32_macb_ele_t {
    unsigned int                 :24;
    unsigned int exl             : 8;
} avr32_macb_ele_t;



typedef struct avr32_macb_rja_t {
    unsigned int                 :24;
    unsigned int rjb             : 8;
} avr32_macb_rja_t;



typedef struct avr32_macb_usf_t {
    unsigned int                 :24;
    unsigned int usf             : 8;
} avr32_macb_usf_t;



typedef struct avr32_macb_ste_t {
    unsigned int                 :24;
    unsigned int sqer            : 8;
} avr32_macb_ste_t;



typedef struct avr32_macb_rle_t {
    unsigned int                 :24;
    unsigned int rlfm            : 8;
} avr32_macb_rle_t;



typedef struct avr32_macb_tpf_t {
    unsigned int                 :16;
    unsigned int tpf             :16;
} avr32_macb_tpf_t;



typedef struct avr32_macb_sa1t_t {
    unsigned int                 :16;
    unsigned int addr            :16;
} avr32_macb_sa1t_t;



typedef struct avr32_macb_sa2t_t {
    unsigned int                 :16;
    unsigned int addr            :16;
} avr32_macb_sa2t_t;



typedef struct avr32_macb_sa3t_t {
    unsigned int                 :16;
    unsigned int addr            :16;
} avr32_macb_sa3t_t;



typedef struct avr32_macb_sa4t_t {
    unsigned int                 :16;
    unsigned int addr            :16;
} avr32_macb_sa4t_t;



typedef struct avr32_macb_tid_t {
    unsigned int                 :16;
    unsigned int tid             :16;
} avr32_macb_tid_t;



typedef struct avr32_macb_tpq_t {
    unsigned int                 :16;
    unsigned int tpq             :16;
} avr32_macb_tpq_t;



typedef struct avr32_macb_usrio_t {
    unsigned int                 :28;
    unsigned int tx_pause_zero   : 1;
    unsigned int tx_pause        : 1;
    unsigned int eam             : 1;
    unsigned int rmii            : 1;
} avr32_macb_usrio_t;



typedef struct avr32_macb_wol_t {
    unsigned int                 :12;
    unsigned int mti             : 1;
    unsigned int sa1             : 1;
    unsigned int arp             : 1;
    unsigned int mag             : 1;
    unsigned int ip              :16;
} avr32_macb_wol_t;



typedef struct avr32_macb_version_t {
    unsigned int part_reference  :16;
    unsigned int revision_reference :16;
} avr32_macb_version_t;



typedef struct avr32_macb_t {
  union {
          unsigned long                  ncr       ;//0x0000
          avr32_macb_ncr_t               NCR       ;
  };
  union {
          unsigned long                  ncfgr     ;//0x0004
          avr32_macb_ncfgr_t             NCFGR     ;
  };
  union {
    const unsigned long                  nsr       ;//0x0008
    const avr32_macb_nsr_t               NSR       ;
  };
          unsigned int                   :32       ;//0x000c
          unsigned int                   :32       ;//0x0010
  union {
          unsigned long                  tsr       ;//0x0014
          avr32_macb_tsr_t               TSR       ;
  };
          unsigned long                  rbqp      ;//0x0018
          unsigned long                  tbqp      ;//0x001c
  union {
          unsigned long                  rsr       ;//0x0020
          avr32_macb_rsr_t               RSR       ;
  };
  union {
          unsigned long                  isr       ;//0x0024
          avr32_macb_isr_t               ISR       ;
  };
  union {
          unsigned long                  ier       ;//0x0028
          avr32_macb_ier_t               IER       ;
  };
  union {
          unsigned long                  idr       ;//0x002c
          avr32_macb_idr_t               IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0030
    const avr32_macb_imr_t               IMR       ;
  };
  union {
          unsigned long                  man       ;//0x0034
          avr32_macb_man_t               MAN       ;
  };
  union {
    const unsigned long                  ptr       ;//0x0038
    const avr32_macb_ptr_t               PTR       ;
  };
  union {
          unsigned long                  pfr       ;//0x003c
          avr32_macb_pfr_t               PFR       ;
  };
  union {
          unsigned long                  fto       ;//0x0040
          avr32_macb_fto_t               FTO       ;
  };
  union {
          unsigned long                  scf       ;//0x0044
          avr32_macb_scf_t               SCF       ;
  };
  union {
          unsigned long                  mcf       ;//0x0048
          avr32_macb_mcf_t               MCF       ;
  };
  union {
          unsigned long                  fro       ;//0x004c
          avr32_macb_fro_t               FRO       ;
  };
  union {
          unsigned long                  fcse      ;//0x0050
          avr32_macb_fcse_t              FCSE      ;
  };
  union {
          unsigned long                  ale       ;//0x0054
          avr32_macb_ale_t               ALE       ;
  };
  union {
          unsigned long                  dtf       ;//0x0058
          avr32_macb_dtf_t               DTF       ;
  };
  union {
          unsigned long                  lcol      ;//0x005c
          avr32_macb_lcol_t              LCOL      ;
  };
  union {
          unsigned long                  excol     ;//0x0060
          avr32_macb_excol_t             EXCOL     ;
  };
  union {
          unsigned long                  tund      ;//0x0064
          avr32_macb_tund_t              TUND      ;
  };
  union {
          unsigned long                  cse       ;//0x0068
          avr32_macb_cse_t               CSE       ;
  };
  union {
          unsigned long                  rre       ;//0x006c
          avr32_macb_rre_t               RRE       ;
  };
  union {
          unsigned long                  rovr      ;//0x0070
          avr32_macb_rovr_t              ROVR      ;
  };
  union {
          unsigned long                  rse       ;//0x0074
          avr32_macb_rse_t               RSE       ;
  };
  union {
          unsigned long                  ele       ;//0x0078
          avr32_macb_ele_t               ELE       ;
  };
  union {
          unsigned long                  rja       ;//0x007c
          avr32_macb_rja_t               RJA       ;
  };
  union {
          unsigned long                  usf       ;//0x0080
          avr32_macb_usf_t               USF       ;
  };
  union {
          unsigned long                  ste       ;//0x0084
          avr32_macb_ste_t               STE       ;
  };
  union {
          unsigned long                  rle       ;//0x0088
          avr32_macb_rle_t               RLE       ;
  };
  union {
          unsigned long                  tpf       ;//0x008c
          avr32_macb_tpf_t               TPF       ;
  };
          unsigned long                  hrb       ;//0x0090
          unsigned long                  hrt       ;//0x0094
          unsigned long                  sa1b      ;//0x0098
  union {
          unsigned long                  sa1t      ;//0x009c
          avr32_macb_sa1t_t              SA1T      ;
  };
          unsigned long                  sa2b      ;//0x00a0
  union {
          unsigned long                  sa2t      ;//0x00a4
          avr32_macb_sa2t_t              SA2T      ;
  };
          unsigned long                  sa3b      ;//0x00a8
  union {
          unsigned long                  sa3t      ;//0x00ac
          avr32_macb_sa3t_t              SA3T      ;
  };
          unsigned long                  sa4b      ;//0x00b0
  union {
          unsigned long                  sa4t      ;//0x00b4
          avr32_macb_sa4t_t              SA4T      ;
  };
  union {
          unsigned long                  tid       ;//0x00b8
          avr32_macb_tid_t               TID       ;
  };
  union {
          unsigned long                  tpq       ;//0x00bc
          avr32_macb_tpq_t               TPQ       ;
  };
  union {
          unsigned long                  usrio     ;//0x00c0
          avr32_macb_usrio_t             USRIO     ;
  };
  union {
          unsigned long                  wol       ;//0x00c4
          avr32_macb_wol_t               WOL       ;
  };
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
  union {
    const unsigned long                  version   ;//0x00fc
    const avr32_macb_version_t           VERSION   ;
  };
} avr32_macb_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_MACB_1121_H_INCLUDED*/
#endif

