/*****************************************************************************
 *
 * Copyright (C) 2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_MDMA_VR                                       0x0000001c
#define AVR32_MDMA_VR_MASK                                  0x00000fff
#define AVR32_MDMA_VR_RESETVALUE                            0x00000101
#define AVR32_MDMA_VR_VERSION                                        0
#define AVR32_MDMA_VR_VERSION_MASK                          0x00000fff
#define AVR32_MDMA_VR_VERSION_OFFSET                                 0
#define AVR32_MDMA_VR_VERSION_SIZE                                  12
#define AVR32_MDMA_V_MASK                                   0x00200000
#define AVR32_MDMA_V_OFFSET                                         21
#define AVR32_MDMA_V_SIZE                                            1
#define AVR32_MDMA_WAR                                               0
#define AVR32_MDMA_WAR0                                     0x00000048
#define AVR32_MDMA_WAR0_MASK                                0xffffffff
#define AVR32_MDMA_WAR0_RESETVALUE                          0x00000000
#define AVR32_MDMA_WAR0_WAR                                          0
#define AVR32_MDMA_WAR0_WAR_MASK                            0xffffffff
#define AVR32_MDMA_WAR0_WAR_OFFSET                                   0
#define AVR32_MDMA_WAR0_WAR_SIZE                                    32
#define AVR32_MDMA_WAR1                                     0x00000058
#define AVR32_MDMA_WAR1_MASK                                0xffffffff
#define AVR32_MDMA_WAR1_RESETVALUE                          0x00000000
#define AVR32_MDMA_WAR1_WAR                                          0
#define AVR32_MDMA_WAR1_WAR_MASK                            0xffffffff
#define AVR32_MDMA_WAR1_WAR_OFFSET                                   0
#define AVR32_MDMA_WAR1_WAR_SIZE                                    32
#define AVR32_MDMA_WAR2                                     0x00000068
#define AVR32_MDMA_WAR2_MASK                                0xffffffff
#define AVR32_MDMA_WAR2_RESETVALUE                          0x00000000
#define AVR32_MDMA_WAR2_WAR                                          0
#define AVR32_MDMA_WAR2_WAR_MASK                            0xffffffff
#define AVR32_MDMA_WAR2_WAR_OFFSET                                   0
#define AVR32_MDMA_WAR2_WAR_SIZE                                    32
#define AVR32_MDMA_WAR3                                     0x00000078
#define AVR32_MDMA_WAR3_MASK                                0xffffffff
#define AVR32_MDMA_WAR3_RESETVALUE                          0x00000000
#define AVR32_MDMA_WAR3_WAR                                          0
#define AVR32_MDMA_WAR3_WAR_MASK                            0xffffffff
#define AVR32_MDMA_WAR3_WAR_OFFSET                                   0
#define AVR32_MDMA_WAR3_WAR_SIZE                                    32
#define AVR32_MDMA_WAR_MASK                                 0xffffffff
#define AVR32_MDMA_WAR_OFFSET                                        0
#define AVR32_MDMA_WAR_SIZE                                         32




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_mdma_cr_t {
    unsigned int                 : 7;
    unsigned int arb             : 1;
    unsigned int                 : 4;
    unsigned int ch3dis          : 1;
    unsigned int ch2dis          : 1;
    unsigned int ch1dis          : 1;
    unsigned int ch0dis          : 1;
    unsigned int                 : 4;
    unsigned int ch3m            : 1;
    unsigned int ch2m            : 1;
    unsigned int ch1m            : 1;
    unsigned int ch0m            : 1;
    unsigned int                 : 4;
    unsigned int ch3en           : 1;
    unsigned int ch2en           : 1;
    unsigned int ch1en           : 1;
    unsigned int ch0en           : 1;
} avr32_mdma_cr_t;



typedef struct avr32_mdma_ier_t {
    unsigned int                 :20;
    unsigned int berr3           : 1;
    unsigned int berr2           : 1;
    unsigned int berr1           : 1;
    unsigned int berr0           : 1;
    unsigned int                 : 4;
    unsigned int ch3c            : 1;
    unsigned int ch2c            : 1;
    unsigned int ch1c            : 1;
    unsigned int ch0c            : 1;
} avr32_mdma_ier_t;



typedef struct avr32_mdma_idr_t {
    unsigned int                 :20;
    unsigned int berr3           : 1;
    unsigned int berr2           : 1;
    unsigned int berr1           : 1;
    unsigned int berr0           : 1;
    unsigned int                 : 4;
    unsigned int ch3c            : 1;
    unsigned int ch2c            : 1;
    unsigned int ch1c            : 1;
    unsigned int ch0c            : 1;
} avr32_mdma_idr_t;



typedef struct avr32_mdma_imr_t {
    unsigned int                 :20;
    unsigned int berr3           : 1;
    unsigned int berr2           : 1;
    unsigned int berr1           : 1;
    unsigned int berr0           : 1;
    unsigned int                 : 4;
    unsigned int ch3c            : 1;
    unsigned int ch2c            : 1;
    unsigned int ch1c            : 1;
    unsigned int ch0c            : 1;
} avr32_mdma_imr_t;



typedef struct avr32_mdma_isr_t {
    unsigned int                 :20;
    unsigned int berr3           : 1;
    unsigned int berr2           : 1;
    unsigned int berr1           : 1;
    unsigned int berr0           : 1;
    unsigned int                 : 4;
    unsigned int ch3c            : 1;
    unsigned int ch2c            : 1;
    unsigned int ch1c            : 1;
    unsigned int ch0c            : 1;
} avr32_mdma_isr_t;



typedef struct avr32_mdma_icr_t {
    unsigned int                 :20;
    unsigned int berr3           : 1;
    unsigned int berr2           : 1;
    unsigned int berr1           : 1;
    unsigned int berr0           : 1;
    unsigned int                 : 4;
    unsigned int ch3c            : 1;
    unsigned int ch2c            : 1;
    unsigned int ch1c            : 1;
    unsigned int choc            : 1;
} avr32_mdma_icr_t;



typedef struct avr32_mdma_pr_t {
    unsigned int                 :22;
    unsigned int burst           : 2;
    unsigned int                 : 4;
    unsigned int ch3i            : 1;
    unsigned int ch2i            : 1;
    unsigned int ch1i            : 1;
    unsigned int ch0i            : 1;
} avr32_mdma_pr_t;



typedef struct avr32_mdma_vr_t {
    unsigned int                 :20;
    unsigned int version         :12;
} avr32_mdma_vr_t;



typedef struct avr32_mdma_ccr_t {
    unsigned int                 : 6;
    unsigned int bswp            : 2;
    unsigned int                 : 1;
    unsigned int l               : 1;
    unsigned int v               : 1;
    unsigned int tcie            : 1;
    unsigned int burst           : 2;
    unsigned int size            : 2;
    unsigned int tcnt            :16;
} avr32_mdma_ccr_t;


typedef struct avr32_mdma_channel_t
{
    unsigned long  cdar;    // 0x0000
    unsigned long  rar;     // 0x0004
    unsigned long  war;     // 0x0008
    union
    {
        unsigned long    ccr;  // 0x000c
        avr32_mdma_ccr_t CCR;
    };
} avr32_mdma_channel_t;

typedef struct  avr32_mdma_dsar_t
{
    unsigned long dsar;
} avr32_mdma_dsar_t;

typedef struct avr32_mdma_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_mdma_cr_t                CR        ;
  };
  union {
          unsigned long                  ier       ;//0x0004
          avr32_mdma_ier_t               IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0008
          avr32_mdma_idr_t               IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x000c
    const avr32_mdma_imr_t               IMR       ;
  };
  union {
    const unsigned long                  isr       ;//0x0010
    const avr32_mdma_isr_t               ISR       ;
  };
  union {
          unsigned long                  icr       ;//0x0014
          avr32_mdma_icr_t               ICR       ;
  };
  union {
    const unsigned long                  pr        ;//0x0018
    const avr32_mdma_pr_t                PR        ;
  };
  union {
    const unsigned long                  vr        ;//0x001c
    const avr32_mdma_vr_t                VR        ;
  };

    avr32_mdma_dsar_t descriptor_channel[4];   // 0x0020

    unsigned int :32;     // 0x0030
    unsigned int :32;     // 0x0034
    unsigned int :32;     // 0x0038
    unsigned int :32;     // 0x003c

    avr32_mdma_channel_t channel[4];    // 0x0040

} avr32_mdma_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_MDMA_101_H_INCLUDED*/
#endif

