/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_MSI_SRAC_OFFSET                                      14
#define AVR32_MSI_SRAC_SIZE                                         1
#define AVR32_MSI_TBE                                              10
#define AVR32_MSI_TBE_MASK                                 0x00000400
#define AVR32_MSI_TBE_OFFSET                                       10
#define AVR32_MSI_TBE_SIZE                                          1
#define AVR32_MSI_TDE                                               8
#define AVR32_MSI_TDE_MASK                                 0x00000100
#define AVR32_MSI_TDE_OFFSET                                        8
#define AVR32_MSI_TDE_SIZE                                          1
#define AVR32_MSI_TOE                                               4
#define AVR32_MSI_TOE_MASK                                 0x00000010
#define AVR32_MSI_TOE_OFFSET                                        4
#define AVR32_MSI_TOE_SIZE                                          1
#define AVR32_MSI_TPC                                              12
#define AVR32_MSI_TPC_EX_SET_CMD                           0x00000009
#define AVR32_MSI_TPC_GET_INT                              0x00000007
#define AVR32_MSI_TPC_MASK                                 0x0000f000
#define AVR32_MSI_TPC_OFFSET                                       12
#define AVR32_MSI_TPC_READ_LONG_DATA                       0x00000002
#define AVR32_MSI_TPC_READ_PAGE_DATA                       0x00000002
#define AVR32_MSI_TPC_READ_REG                             0x00000004
#define AVR32_MSI_TPC_READ_SHORT_DATA                      0x00000003
#define AVR32_MSI_TPC_SET_CMD                              0x0000000e
#define AVR32_MSI_TPC_SET_RW_REG_ADRS                      0x00000008
#define AVR32_MSI_TPC_SIZE                                          4
#define AVR32_MSI_TPC_WRITE_LONG_DATA                      0x0000000d
#define AVR32_MSI_TPC_WRITE_PAGE_DATA                      0x0000000d
#define AVR32_MSI_TPC_WRITE_REG                            0x0000000b
#define AVR32_MSI_TPC_WRITE_SHORT_DATA                     0x0000000c
#define AVR32_MSI_TRANSMIT                                 0x00000000
#define AVR32_MSI_VERSION                                  0x00000024
#define AVR32_MSI_VERSION_MASK                             0x00000fff
#define AVR32_MSI_VERSION_OFFSET                                    0
#define AVR32_MSI_VERSION_SIZE                                     12
#define AVR32_MSI_VERSION_VERSION                                   0
#define AVR32_MSI_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_MSI_VERSION_VERSION_OFFSET                            0
#define AVR32_MSI_VERSION_VERSION_SIZE                             12
#define AVR32_MSI_WRITE_LONG_DATA                          0x0000000d
#define AVR32_MSI_WRITE_PAGE_DATA                          0x0000000d
#define AVR32_MSI_WRITE_REG                                0x0000000b
#define AVR32_MSI_WRITE_SHORT_DATA                         0x0000000c




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_msi_mscmd_t {
    unsigned int                 :16;
    unsigned int tpc             : 4;
    unsigned int                 : 1;
    unsigned int dsl             : 1;
    unsigned int dsz             :10;
} avr32_msi_mscmd_t;



typedef struct avr32_msi_mssr_t {
    unsigned int                 :15;
    unsigned int ista            : 1;
    unsigned int                 : 3;
    unsigned int rdy             : 1;
    unsigned int                 : 6;
    unsigned int emp             : 1;
    unsigned int ful             : 1;
    unsigned int ced             : 1;
    unsigned int err             : 1;
    unsigned int brq             : 1;
    unsigned int cnk             : 1;
} avr32_msi_mssr_t;



typedef struct avr32_msi_mssys_t {
    unsigned int                 : 8;
    unsigned int clkdiv          : 8;
    unsigned int rst             : 1;
    unsigned int srac            : 1;
    unsigned int                 : 1;
    unsigned int nocrc           : 1;
    unsigned int                 : 2;
    unsigned int fclr            : 1;
    unsigned int fdir            : 1;
    unsigned int                 : 3;
    unsigned int rei             : 1;
    unsigned int reo             : 1;
    unsigned int bsy             : 3;
} avr32_msi_mssys_t;



typedef struct avr32_msi_msisr_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msisr_t;



typedef struct avr32_msi_msiscr_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msiscr_t;



typedef struct avr32_msi_msier_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msier_t;



typedef struct avr32_msi_msidr_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msidr_t;



typedef struct avr32_msi_msimr_t {
    unsigned int                 :20;
    unsigned int rbf             : 1;
    unsigned int tbe             : 1;
    unsigned int rde             : 1;
    unsigned int tde             : 1;
    unsigned int                 : 2;
    unsigned int cd              : 1;
    unsigned int toe             : 1;
    unsigned int crc             : 1;
    unsigned int msint           : 1;
    unsigned int drq             : 1;
    unsigned int pend            : 1;
} avr32_msi_msimr_t;



typedef struct avr32_msi_version_t {
    unsigned int                 :20;
    unsigned int version         :12;
} avr32_msi_version_t;



typedef struct avr32_msi_t {
  union {
          unsigned long                  mscmd     ;//0x0000
          avr32_msi_mscmd_t              MSCMD     ;
  };
          unsigned long                  msdat     ;//0x0004
  union {
    const unsigned long                  mssr      ;//0x0008
    const avr32_msi_mssr_t               MSSR      ;
  };
  union {
          unsigned long                  mssys     ;//0x000c
          avr32_msi_mssys_t              MSSYS     ;
  };
  union {
    const unsigned long                  msisr     ;//0x0010
    const avr32_msi_msisr_t              MSISR     ;
  };
  union {
          unsigned long                  msiscr    ;//0x0014
          avr32_msi_msiscr_t             MSISCR    ;
  };
  union {
          unsigned long                  msier     ;//0x0018
          avr32_msi_msier_t              MSIER     ;
  };
  union {
          unsigned long                  msidr     ;//0x001c
          avr32_msi_msidr_t              MSIDR     ;
  };
  union {
    const unsigned long                  msimr     ;//0x0020
    const avr32_msi_msimr_t              MSIMR     ;
  };
  union {
    const unsigned long                  version   ;//0x0024
    const avr32_msi_version_t            VERSION   ;
  };
} avr32_msi_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_MSI_210_H_INCLUDED*/
#endif

