/*****************************************************************************
 *
 * Copyright (C) 2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_PDCA_TCRR8                                    0x00000210
#define AVR32_PDCA_TCRR8_MASK                               0x0000ffff
#define AVR32_PDCA_TCRR8_RESETVALUE                         0x00000000
#define AVR32_PDCA_TCRR8_TCRV                                        0
#define AVR32_PDCA_TCRR8_TCRV_MASK                          0x0000ffff
#define AVR32_PDCA_TCRR8_TCRV_OFFSET                                 0
#define AVR32_PDCA_TCRR8_TCRV_SIZE                                  16
#define AVR32_PDCA_TCRR9                                    0x00000250
#define AVR32_PDCA_TCRR9_MASK                               0x0000ffff
#define AVR32_PDCA_TCRR9_RESETVALUE                         0x00000000
#define AVR32_PDCA_TCRR9_TCRV                                        0
#define AVR32_PDCA_TCRR9_TCRV_MASK                          0x0000ffff
#define AVR32_PDCA_TCRR9_TCRV_OFFSET                                 0
#define AVR32_PDCA_TCRR9_TCRV_SIZE                                  16
#define AVR32_PDCA_TCRV                                              0
#define AVR32_PDCA_TCRV_MASK                                0x0000ffff
#define AVR32_PDCA_TCRV_OFFSET                                       0
#define AVR32_PDCA_TCRV_SIZE                                        16
#define AVR32_PDCA_TCV                                               0
#define AVR32_PDCA_TCV_MASK                                 0x0000ffff
#define AVR32_PDCA_TCV_OFFSET                                        0
#define AVR32_PDCA_TCV_SIZE                                         16
#define AVR32_PDCA_TDIS                                              1
#define AVR32_PDCA_TDIS_MASK                                0x00000002
#define AVR32_PDCA_TDIS_OFFSET                                       1
#define AVR32_PDCA_TDIS_SIZE                                         1
#define AVR32_PDCA_TEN                                               0
#define AVR32_PDCA_TEN_MASK                                 0x00000001
#define AVR32_PDCA_TEN_OFFSET                                        0
#define AVR32_PDCA_TEN_SIZE                                          1
#define AVR32_PDCA_TERR                                              2
#define AVR32_PDCA_TERR_MASK                                0x00000004
#define AVR32_PDCA_TERR_OFFSET                                       2
#define AVR32_PDCA_TERR_SIZE                                         1
#define AVR32_PDCA_TRC                                               1
#define AVR32_PDCA_TRC_MASK                                 0x00000002
#define AVR32_PDCA_TRC_OFFSET                                        1
#define AVR32_PDCA_TRC_SIZE                                          1
#define AVR32_PDCA_VERSION                                  0x00000834
#define AVR32_PDCA_VERSION_MASK                             0x00000000
#define AVR32_PDCA_VERSION_RESETVALUE                       0x00000123
#define AVR32_PDCA_WORD                                     0x00000002




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_pdca_psr_t {
    unsigned int                 :24;
    unsigned int pid             : 8;
} avr32_pdca_psr_t;



typedef struct avr32_pdca_tcr_t {
    unsigned int                 :16;
    unsigned int tcv             :16;
} avr32_pdca_tcr_t;



typedef struct avr32_pdca_tcrr_t {
    unsigned int                 :16;
    unsigned int tcrv            :16;
} avr32_pdca_tcrr_t;



typedef struct avr32_pdca_cr_t {
    unsigned int                 :23;
    unsigned int eclr            : 1;
    unsigned int                 : 6;
    unsigned int tdis            : 1;
    unsigned int ten             : 1;
} avr32_pdca_cr_t;



typedef struct avr32_pdca_mr_t {
    unsigned int                 :28;
    unsigned int ring            : 1;
    unsigned int etrig           : 1;
    unsigned int size            : 2;
} avr32_pdca_mr_t;



typedef struct avr32_pdca_sr_t {
    unsigned int                 :31;
    unsigned int ten             : 1;
} avr32_pdca_sr_t;



typedef struct avr32_pdca_ier_t {
    unsigned int                 :29;
    unsigned int terr            : 1;
    unsigned int trc             : 1;
    unsigned int rcz             : 1;
} avr32_pdca_ier_t;



typedef struct avr32_pdca_idr_t {
    unsigned int                 :29;
    unsigned int terr            : 1;
    unsigned int trc             : 1;
    unsigned int rcz             : 1;
} avr32_pdca_idr_t;



typedef struct avr32_pdca_imr_t {
    unsigned int                 :29;
    unsigned int terr            : 1;
    unsigned int trc             : 1;
    unsigned int rcz             : 1;
} avr32_pdca_imr_t;



typedef struct avr32_pdca_isr_t {
    unsigned int                 :29;
    unsigned int terr            : 1;
    unsigned int trc             : 1;
    unsigned int rcz             : 1;
} avr32_pdca_isr_t;



typedef struct avr32_pdca_pcontrol_t {
    unsigned int                 : 2;
    unsigned int mon1ch          : 6;
    unsigned int                 : 2;
    unsigned int mon0ch          : 6;
    unsigned int                 : 6;
    unsigned int ch1res          : 1;
    unsigned int ch0res          : 1;
    unsigned int                 : 2;
    unsigned int ch1of           : 1;
    unsigned int ch0of           : 1;
    unsigned int                 : 2;
    unsigned int ch1en           : 1;
    unsigned int ch0en           : 1;
} avr32_pdca_pcontrol_t;



typedef struct avr32_pdca_prlat0_t {
    unsigned int                 :16;
    unsigned int lat             :16;
} avr32_pdca_prlat0_t;



typedef struct avr32_pdca_pwlat0_t {
    unsigned int                 :16;
    unsigned int lat             :16;
} avr32_pdca_pwlat0_t;



typedef struct avr32_pdca_prlat1_t {
    unsigned int                 :16;
    unsigned int lat             :16;
} avr32_pdca_prlat1_t;



typedef struct avr32_pdca_pwlat1_t {
    unsigned int                 :16;
    unsigned int lat             :16;
} avr32_pdca_pwlat1_t;


typedef struct avr32_pdca_channel_t {
          unsigned long                  mar       ;//0x0000
  union {
          unsigned long                  psr       ;//0x0004
          avr32_pdca_psr_t               PSR       ;
  };
  union {
          unsigned long                  tcr       ;//0x0008
          avr32_pdca_tcr_t               TCR       ;
  };
          unsigned long                  marr      ;//0x000c
  union {
          unsigned long                  tcrr      ;//0x0010
          avr32_pdca_tcrr_t              TCRR      ;
  };
  union {
          unsigned long                  cr        ;//0x0014
          avr32_pdca_cr_t                CR        ;
  };
  union {
          unsigned long                  mr        ;//0x0018
          avr32_pdca_mr_t                MR        ;
  };
  union {
    const unsigned long                  sr        ;//0x001c
    const avr32_pdca_sr_t                SR        ;
  };
  union {
          unsigned long                  ier       ;//0x0020
          avr32_pdca_ier_t               IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0024
          avr32_pdca_idr_t               IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0028
    const avr32_pdca_imr_t               IMR       ;
  };
  union {
    const unsigned long                  isr       ;//0x002c
    const avr32_pdca_isr_t               ISR       ;
  };
          unsigned int                   :32       ;//0x0030
          unsigned int                   :32       ;//0x0034
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
} avr32_pdca_channel_t;


typedef struct avr32_pdca_t {
  avr32_pdca_channel_t channel[AVR32_PDCA_CHANNEL_LENGTH];//0x0
  avr32_pdca_channel_t channel_reserved[32 - AVR32_PDCA_CHANNEL_LENGTH];//Padding
  union {
          unsigned long                  pcontrol  ;//0x0800
          avr32_pdca_pcontrol_t          PCONTROL  ;
  };
    const unsigned long                  prdata0   ;//0x0804
    const unsigned long                  prstall0  ;//0x0808
  union {
    const unsigned long                  prlat0    ;//0x080c
    const avr32_pdca_prlat0_t            PRLAT0    ;
  };
    const unsigned long                  pwdata0   ;//0x0810
    const unsigned long                  pwstall0  ;//0x0814
  union {
    const unsigned long                  pwlat0    ;//0x0818
    const avr32_pdca_pwlat0_t            PWLAT0    ;
  };
    const unsigned long                  prdata1   ;//0x081c
    const unsigned long                  prstall1  ;//0x0820
  union {
    const unsigned long                  prlat1    ;//0x0824
    const avr32_pdca_prlat1_t            PRLAT1    ;
  };
    const unsigned long                  pwdata1   ;//0x0828
    const unsigned long                  pwstall1  ;//0x082c
  union {
    const unsigned long                  pwlat1    ;//0x0830
    const avr32_pdca_pwlat1_t            PWLAT1    ;
  };
    const unsigned long                  version   ;//0x0834
} avr32_pdca_t;



#if !defined (DEPRECATED_DISABLE)

#define AVR32_PDCA_CR0                                      0x00000014
#define AVR32_PDCA_CR0_ECLR                                          8
#define AVR32_PDCA_CR0_ECLR_MASK                            0x00000100
#define AVR32_PDCA_CR0_ECLR_OFFSET                                   8
#define AVR32_PDCA_CR0_ECLR_SIZE                                     1
#define AVR32_PDCA_CR0_MASK                                 0x00000103
#define AVR32_PDCA_CR0_RESETVALUE                           0x00000000
#define AVR32_PDCA_CR0_TDIS                                          1
#define AVR32_PDCA_CR0_TDIS_MASK                            0x00000002
#define AVR32_PDCA_CR0_TDIS_OFFSET                                   1
#define AVR32_PDCA_CR0_TDIS_SIZE                                     1
#define AVR32_PDCA_CR0_TEN                                           0
