/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_PEVC_TRSCR1_TRSCR                                      0
#define AVR32_PEVC_TRSCR1_TRSCR_MASK                        0xffffffff
#define AVR32_PEVC_TRSCR1_TRSCR_OFFSET                               0
#define AVR32_PEVC_TRSCR1_TRSCR_SIZE                                32
#define AVR32_PEVC_TRSCR_MASK                               0xffffffff
#define AVR32_PEVC_TRSCR_OFFSET                                      0
#define AVR32_PEVC_TRSCR_SIZE                                       32
#define AVR32_PEVC_TRSR                                              0
#define AVR32_PEVC_TRSR0                                    0x00000060
#define AVR32_PEVC_TRSR0_MASK                               0xffffffff
#define AVR32_PEVC_TRSR0_RESETVALUE                         0x00000000
#define AVR32_PEVC_TRSR0_TRSR                                        0
#define AVR32_PEVC_TRSR0_TRSR_MASK                          0xffffffff
#define AVR32_PEVC_TRSR0_TRSR_OFFSET                                 0
#define AVR32_PEVC_TRSR0_TRSR_SIZE                                  32
#define AVR32_PEVC_TRSR1                                    0x00000064
#define AVR32_PEVC_TRSR1_MASK                               0xffffffff
#define AVR32_PEVC_TRSR1_RESETVALUE                         0x00000000
#define AVR32_PEVC_TRSR1_TRSR                                        0
#define AVR32_PEVC_TRSR1_TRSR_MASK                          0xffffffff
#define AVR32_PEVC_TRSR1_TRSR_OFFSET                                 0
#define AVR32_PEVC_TRSR1_TRSR_SIZE                                  32
#define AVR32_PEVC_TRSR_MASK                                0xffffffff
#define AVR32_PEVC_TRSR_OFFSET                                       0
#define AVR32_PEVC_TRSR_SIZE                                        32
#define AVR32_PEVC_VARIANT                                          16
#define AVR32_PEVC_VARIANT_MASK                             0x000f0000
#define AVR32_PEVC_VARIANT_OFFSET                                   16
#define AVR32_PEVC_VARIANT_SIZE                                      4
#define AVR32_PEVC_VERSION                                  0x00000000
#define AVR32_PEVC_VERSION_MASK                             0x000f0fff
#define AVR32_PEVC_VERSION_OFFSET                                    0
#define AVR32_PEVC_VERSION_RESETVALUE                       0x00000100
#define AVR32_PEVC_VERSION_SIZE                                     12
#define AVR32_PEVC_VERSION_VARIANT                                  16
#define AVR32_PEVC_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_PEVC_VERSION_VARIANT_OFFSET                           16
#define AVR32_PEVC_VERSION_VARIANT_SIZE                              4
#define AVR32_PEVC_VERSION_VERSION                                   0
#define AVR32_PEVC_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_PEVC_VERSION_VERSION_OFFSET                            0
#define AVR32_PEVC_VERSION_VERSION_SIZE                             12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_pevc_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_pevc_version_t;



typedef struct avr32_pevc_parameter_t {
    unsigned int trigout         : 8;
    unsigned int evmx            : 8;
    unsigned int evs             : 8;
    unsigned int evin            : 8;
} avr32_pevc_parameter_t;



typedef struct avr32_pevc_igfdr_t {
    unsigned int                 :28;
    unsigned int igfdr           : 4;
} avr32_pevc_igfdr_t;



typedef struct avr32_pevc_chmx_t {
    unsigned int                 :23;
    unsigned int smx             : 1;
    unsigned int                 : 2;
    unsigned int evmx            : 6;
} avr32_pevc_chmx_t;



typedef struct avr32_pevc_evs_t {
    unsigned int                 :29;
    unsigned int igf             : 1;
    unsigned int evf             : 1;
    unsigned int evr             : 1;
} avr32_pevc_evs_t;



typedef struct avr32_pevc_t {
  union {
    const unsigned long                  version   ;//0x0000
    const avr32_pevc_version_t           VERSION   ;
  };
  union {
    const unsigned long                  parameter ;//0x0004
    const avr32_pevc_parameter_t         PARAMETER ;
  };
  union {
          unsigned long                  igfdr     ;//0x0008
          avr32_pevc_igfdr_t             IGFDR     ;
  };
          unsigned int                   :32       ;//0x000c
    const unsigned long                  chsr0     ;//0x0010
    const unsigned long                  chsr1     ;//0x0014
          unsigned int                   :32       ;//0x0018
          unsigned int                   :32       ;//0x001c
          unsigned long                  cher0     ;//0x0020
          unsigned long                  cher1     ;//0x0024
          unsigned int                   :32       ;//0x0028
          unsigned int                   :32       ;//0x002c
          unsigned long                  chdr0     ;//0x0030
          unsigned long                  chdr1     ;//0x0034
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
          unsigned long                  sev0      ;//0x0040
          unsigned long                  sev1      ;//0x0044
          unsigned int                   :32       ;//0x0048
          unsigned int                   :32       ;//0x004c
    const unsigned long                  busy0     ;//0x0050
    const unsigned long                  busy1     ;//0x0054
          unsigned int                   :32       ;//0x0058
          unsigned int                   :32       ;//0x005c
    const unsigned long                  trsr0     ;//0x0060
    const unsigned long                  trsr1     ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned long                  trscr0    ;//0x0070
          unsigned long                  trscr1    ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
    const unsigned long                  trimr0    ;//0x0080
    const unsigned long                  trimr1    ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned long                  trier0    ;//0x0090
          unsigned long                  trier1    ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned long                  tridr0    ;//0x00a0
          unsigned long                  tridr1    ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
    const unsigned long                  ovsr0     ;//0x00b0
    const unsigned long                  ovsr1     ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned long                  ovscr0    ;//0x00c0
          unsigned long                  ovscr1    ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
    const unsigned long                  ovimr0    ;//0x00d0
    const unsigned long                  ovimr1    ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned long                  ovier0    ;//0x00e0
          unsigned long                  ovier1    ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned long                  ovidr0    ;//0x00f0
          unsigned long                  ovidr1    ;//0x00f4
          unsigned int                   :32       ;//0x00f8
          unsigned int                   :32       ;//0x00fc
  union {
          unsigned long                  chmx      [AVR32_PEVC_TRIGOUT_BITS];//0x0100
          avr32_pevc_chmx_t              CHMX      [AVR32_PEVC_TRIGOUT_BITS];
  };
    unsigned long                        chmx_reserved[64-AVR32_PEVC_TRIGOUT_BITS]; //Padding
  union {
          unsigned long                  evs       [AVR32_PEVC_EVS_BITS];//0x0200
          avr32_pevc_evs_t               EVS       [AVR32_PEVC_EVS_BITS];
  };
    unsigned long                        evs_reserved[64-AVR32_PEVC_EVS_BITS]; //Padding
} avr32_pevc_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_PEVC_100_H_INCLUDED*/
#endif

