/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_PM_VERSION_MASK                             0x000f0fff
#define AVR32_PM_VERSION_OFFSET                                    0
#define AVR32_PM_VERSION_RESETVALUE                       0x00000400
#define AVR32_PM_VERSION_SIZE                                     12
#define AVR32_PM_VERSION_VARIANT                                  16
#define AVR32_PM_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_PM_VERSION_VARIANT_OFFSET                           16
#define AVR32_PM_VERSION_VARIANT_SIZE                              4
#define AVR32_PM_VERSION_VERSION                                   0
#define AVR32_PM_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_PM_VERSION_VERSION_OFFSET                            0
#define AVR32_PM_VERSION_VERSION_SIZE                             12
#define AVR32_PM_WAKE                                              8
#define AVR32_PM_WAKE_MASK                                0x00000100
#define AVR32_PM_WAKE_OFFSET                                       8
#define AVR32_PM_WAKE_SIZE                                         1
#define AVR32_PM_WCAUSE                                   0x00000184
#define AVR32_PM_WCAUSE_AST                                       17
#define AVR32_PM_WCAUSE_AST_MASK                          0x00020000
#define AVR32_PM_WCAUSE_AST_OFFSET                                17
#define AVR32_PM_WCAUSE_AST_SIZE                                   1
#define AVR32_PM_WCAUSE_EIC                                       16
#define AVR32_PM_WCAUSE_EIC_MASK                          0x00010000
#define AVR32_PM_WCAUSE_EIC_OFFSET                                16
#define AVR32_PM_WCAUSE_EIC_SIZE                                   1
#define AVR32_PM_WCAUSE_MASK                              0x0003ffff
#define AVR32_PM_WCAUSE_OFFSET                                     0
#define AVR32_PM_WCAUSE_RESETVALUE                        0x00000000
#define AVR32_PM_WCAUSE_SIZE                                      16
#define AVR32_PM_WCAUSE_WCAUSE                                     0
#define AVR32_PM_WCAUSE_WCAUSE_MASK                       0x0000ffff
#define AVR32_PM_WCAUSE_WCAUSE_OFFSET                              0
#define AVR32_PM_WCAUSE_WCAUSE_SIZE                               16
#define AVR32_PM_WDT                                               3
#define AVR32_PM_WDT_MASK                                 0x00000008
#define AVR32_PM_WDT_OFFSET                                        3
#define AVR32_PM_WDT_SIZE                                          1

#define AVR32_PM_SMODE_DEEPSTOP                        0x00000004
#define AVR32_PM_SMODE_FROZEN                          0x00000001
#define AVR32_PM_SMODE_IDLE                            0x00000000
#define AVR32_PM_SMODE_SHUTDOWN                        0x00000006
#define AVR32_PM_SMODE_STANDBY                         0x00000002
#define AVR32_PM_SMODE_STATIC                          0x00000005
#define AVR32_PM_SMODE_STOP                            0x00000003



#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_pm_mcctrl_t {
    unsigned int                 :29;
    unsigned int mcsel           : 3;
} avr32_pm_mcctrl_t;



typedef struct avr32_pm_cpusel_t {
    unsigned int                 :24;
    unsigned int cpudiv          : 1;
    unsigned int                 : 4;
    unsigned int cpusel          : 3;
} avr32_pm_cpusel_t;



typedef struct avr32_pm_hsbsel_t {
    unsigned int                 :24;
    unsigned int hsbdiv          : 1;
    unsigned int                 : 4;
    unsigned int hsbsel          : 3;
} avr32_pm_hsbsel_t;



typedef struct avr32_pm_pbasel_t {
    unsigned int                 :24;
    unsigned int pbdiv           : 1;
    unsigned int                 : 4;
    unsigned int pbsel           : 3;
} avr32_pm_pbasel_t;



typedef struct avr32_pm_pbbsel_t {
    unsigned int                 :24;
    unsigned int pbdiv           : 1;
    unsigned int                 : 4;
    unsigned int pbsel           : 3;
} avr32_pm_pbbsel_t;



typedef struct avr32_pm_pbcsel_t {
    unsigned int                 :24;
    unsigned int pbdiv           : 1;
    unsigned int                 : 4;
    unsigned int pbsel           : 3;
} avr32_pm_pbcsel_t;



typedef struct avr32_pm_cpumask_t {
    unsigned int                 :15;
    unsigned int systimer        : 1;
    unsigned int                 :16;
} avr32_pm_cpumask_t;



typedef struct avr32_pm_cfdctrl_t {
    unsigned int sfv             : 1;
    unsigned int                 :29;
    unsigned int ocpen           : 1;
    unsigned int cfden           : 1;
} avr32_pm_cfdctrl_t;



typedef struct avr32_pm_unlock_t {
    unsigned int key             : 8;
    unsigned int                 :14;
    unsigned int addr            :10;
} avr32_pm_unlock_t;



typedef struct avr32_pm_ier_t {
    unsigned int ae              : 1;
    unsigned int                 : 2;
    unsigned int perrdy          : 1;
    unsigned int                 :19;
    unsigned int wake            : 1;
    unsigned int                 : 2;
    unsigned int ckrdy           : 1;
    unsigned int                 : 3;
    unsigned int ocp             : 1;
    unsigned int cfd             : 1;
} avr32_pm_ier_t;



typedef struct avr32_pm_idr_t {
    unsigned int ae              : 1;
    unsigned int                 : 2;
    unsigned int perrdy          : 1;
    unsigned int                 :19;
    unsigned int wake            : 1;
    unsigned int                 : 2;
    unsigned int ckrdy           : 1;
    unsigned int                 : 3;
    unsigned int ocp             : 1;
    unsigned int cfd             : 1;
} avr32_pm_idr_t;



typedef struct avr32_pm_imr_t {
    unsigned int ae              : 1;
    unsigned int                 : 2;
    unsigned int perrdy          : 1;
    unsigned int                 :19;
    unsigned int wake            : 1;
    unsigned int                 : 2;
    unsigned int ckrdy           : 1;
    unsigned int                 : 3;
    unsigned int ocp             : 1;
    unsigned int cfd             : 1;
} avr32_pm_imr_t;



typedef struct avr32_pm_isr_t {
    unsigned int ae              : 1;
    unsigned int                 : 2;
    unsigned int perrdy          : 1;
    unsigned int                 :19;
    unsigned int wake            : 1;
    unsigned int                 : 2;
    unsigned int ckrdy           : 1;
    unsigned int                 : 3;
    unsigned int ocp             : 1;
    unsigned int cfd             : 1;
} avr32_pm_isr_t;



typedef struct avr32_pm_icr_t {
    unsigned int ae              : 1;
    unsigned int                 : 2;
    unsigned int perrdy          : 1;
    unsigned int                 :19;
    unsigned int wake            : 1;
    unsigned int                 : 2;
    unsigned int ckrdy           : 1;
    unsigned int                 : 3;
    unsigned int ocp             : 1;
    unsigned int cfd             : 1;
} avr32_pm_icr_t;



typedef struct avr32_pm_sr_t {
    unsigned int ae              : 1;
    unsigned int                 : 2;
    unsigned int perrdy          : 1;
    unsigned int                 :19;
    unsigned int wake            : 1;
    unsigned int                 : 2;
    unsigned int ckrdy           : 1;
    unsigned int                 : 3;
    unsigned int ocp             : 1;
    unsigned int cfo             : 1;
} avr32_pm_sr_t;



typedef struct avr32_pm_ppcr_t {
    unsigned int ppc             :32;
} avr32_pm_ppcr_t;



typedef struct avr32_pm_rcause_t {
    unsigned int                 :18;
    unsigned int bod33           : 1;
    unsigned int awirehard       : 1;
    unsigned int awire           : 1;
    unsigned int shdn            : 1;
    unsigned int jtaghard        : 1;
    unsigned int ocdrst          : 1;
    unsigned int cpuerr          : 1;
    unsigned int sleep           : 1;
    unsigned int                 : 1;
    unsigned int jtag            : 1;
    unsigned int wdt             : 1;
    unsigned int ext             : 1;
    unsigned int bod             : 1;
    unsigned int por             : 1;
} avr32_pm_rcause_t;



typedef struct avr32_pm_wcause_t {
    unsigned int                 :14;
    unsigned int ast             : 1;
    unsigned int eic             : 1;
    unsigned int wcause          :16;
} avr32_pm_wcause_t;



typedef struct avr32_pm_config_t {
    unsigned int                 :19;
    unsigned int gplpinpm        : 1;
    unsigned int gplpnum         : 4;
    unsigned int hsbpevc         : 1;
    unsigned int ocp             : 1;
    unsigned int                 : 2;
    unsigned int pbd             : 1;
    unsigned int pbc             : 1;
    unsigned int pbb             : 1;
    unsigned int pba             : 1;
} avr32_pm_config_t;



typedef struct avr32_pm_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_pm_version_t;



typedef struct avr32_pm_t {
  union {
          unsigned long                  mcctrl    ;//0x0000
          avr32_pm_mcctrl_t              MCCTRL    ;
  };
  union {
          unsigned long                  cpusel    ;//0x0004
          avr32_pm_cpusel_t              CPUSEL    ;
  };
  union {
          unsigned long                  hsbsel    ;//0x0008
          avr32_pm_hsbsel_t              HSBSEL    ;
  };
  union {
          unsigned long                  pbasel    ;//0x000c
          avr32_pm_pbasel_t              PBASEL    ;
  };
  union {
          unsigned long                  pbbsel    ;//0x0010
          avr32_pm_pbbsel_t              PBBSEL    ;
  };
  union {
          unsigned long                  pbcsel    ;//0x0014
          avr32_pm_pbcsel_t              PBCSEL    ;
  };
          unsigned int                   :32       ;//0x0018
          unsigned int                   :32       ;//0x001c
  union {
          unsigned long                  cpumask   ;//0x0020
          avr32_pm_cpumask_t             CPUMASK   ;
  };
          unsigned long                  hsbmask   ;//0x0024
          unsigned long                  pbamask   ;//0x0028
          unsigned long                  pbbmask   ;//0x002c
          unsigned long                  pbcmask   ;//0x0030
          unsigned int                   :32       ;//0x0034
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
          unsigned long                  pbadivmask;//0x0040
          unsigned long                  pbbdivmask;//0x0044
          unsigned long                  pbcdivmask;//0x0048
          unsigned int                   :32       ;//0x004c
          unsigned int                   :32       ;//0x0050
  union {
          unsigned long                  cfdctrl   ;//0x0054
          avr32_pm_cfdctrl_t             CFDCTRL   ;
  };
  union {
          unsigned long                  unlock    ;//0x0058
          avr32_pm_unlock_t              UNLOCK    ;
  };
          unsigned int                   :32       ;//0x005c
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
  union {
          unsigned long                  ier       ;//0x00c0
          avr32_pm_ier_t                 IER       ;
  };
  union {
          unsigned long                  idr       ;//0x00c4
          avr32_pm_idr_t                 IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x00c8
    const avr32_pm_imr_t                 IMR       ;
  };
  union {
    const unsigned long                  isr       ;//0x00cc
    const avr32_pm_isr_t                 ISR       ;
  };
  union {
          unsigned long                  icr       ;//0x00d0
          avr32_pm_icr_t                 ICR       ;
  };
  union {
    const unsigned long                  sr        ;//0x00d4
    const avr32_pm_sr_t                  SR        ;
  };
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
          unsigned int                   :32       ;//0x00fc
          unsigned int                   :32       ;//0x0100
          unsigned int                   :32       ;//0x0104
          unsigned int                   :32       ;//0x0108
          unsigned int                   :32       ;//0x010c
          unsigned int                   :32       ;//0x0110
          unsigned int                   :32       ;//0x0114
          unsigned int                   :32       ;//0x0118
          unsigned int                   :32       ;//0x011c
          unsigned int                   :32       ;//0x0120
          unsigned int                   :32       ;//0x0124
          unsigned int                   :32       ;//0x0128
          unsigned int                   :32       ;//0x012c
          unsigned int                   :32       ;//0x0130
          unsigned int                   :32       ;//0x0134
          unsigned int                   :32       ;//0x0138
          unsigned int                   :32       ;//0x013c
          unsigned int                   :32       ;//0x0140
          unsigned int                   :32       ;//0x0144
          unsigned int                   :32       ;//0x0148
          unsigned int                   :32       ;//0x014c
          unsigned int                   :32       ;//0x0150
          unsigned int                   :32       ;//0x0154
          unsigned int                   :32       ;//0x0158
          unsigned int                   :32       ;//0x015c
  union {
          unsigned long                  ppcr      ;//0x0160
          avr32_pm_ppcr_t                PPCR      ;
  };
          unsigned int                   :32       ;//0x0164
          unsigned int                   :32       ;//0x0168
          unsigned int                   :32       ;//0x016c
          unsigned int                   :32       ;//0x0170
          unsigned int                   :32       ;//0x0174
          unsigned int                   :32       ;//0x0178
          unsigned int                   :32       ;//0x017c
  union {
    const unsigned long                  rcause    ;//0x0180
    const avr32_pm_rcause_t              RCAUSE    ;
  };
  union {
    const unsigned long                  wcause    ;//0x0184
    const avr32_pm_wcause_t              WCAUSE    ;
  };
          unsigned long                  awen      ;//0x0188
          unsigned int                   :32       ;//0x018c
          unsigned int                   :32       ;//0x0190
          unsigned int                   :32       ;//0x0194
          unsigned int                   :32       ;//0x0198
          unsigned int                   :32       ;//0x019c
          unsigned int                   :32       ;//0x01a0
          unsigned int                   :32       ;//0x01a4
          unsigned int                   :32       ;//0x01a8
          unsigned int                   :32       ;//0x01ac
          unsigned int                   :32       ;//0x01b0
          unsigned int                   :32       ;//0x01b4
          unsigned int                   :32       ;//0x01b8
          unsigned int                   :32       ;//0x01bc
          unsigned int                   :32       ;//0x01c0
          unsigned int                   :32       ;//0x01c4
          unsigned int                   :32       ;//0x01c8
          unsigned int                   :32       ;//0x01cc
          unsigned int                   :32       ;//0x01d0
          unsigned int                   :32       ;//0x01d4
          unsigned int                   :32       ;//0x01d8
          unsigned int                   :32       ;//0x01dc
          unsigned int                   :32       ;//0x01e0
          unsigned int                   :32       ;//0x01e4
          unsigned int                   :32       ;//0x01e8
          unsigned int                   :32       ;//0x01ec
          unsigned int                   :32       ;//0x01f0
          unsigned int                   :32       ;//0x01f4
          unsigned int                   :32       ;//0x01f8
          unsigned int                   :32       ;//0x01fc
          unsigned int                   :32       ;//0x0200
          unsigned int                   :32       ;//0x0204
          unsigned int                   :32       ;//0x0208
          unsigned int                   :32       ;//0x020c
          unsigned int                   :32       ;//0x0210
          unsigned int                   :32       ;//0x0214
          unsigned int                   :32       ;//0x0218
          unsigned int                   :32       ;//0x021c
          unsigned int                   :32       ;//0x0220
          unsigned int                   :32       ;//0x0224
          unsigned int                   :32       ;//0x0228
          unsigned int                   :32       ;//0x022c
          unsigned int                   :32       ;//0x0230
          unsigned int                   :32       ;//0x0234
          unsigned int                   :32       ;//0x0238
          unsigned int                   :32       ;//0x023c
          unsigned int                   :32       ;//0x0240
          unsigned int                   :32       ;//0x0244
          unsigned int                   :32       ;//0x0248
          unsigned int                   :32       ;//0x024c
          unsigned int                   :32       ;//0x0250
          unsigned int                   :32       ;//0x0254
          unsigned int                   :32       ;//0x0258
          unsigned int                   :32       ;//0x025c
          unsigned int                   :32       ;//0x0260
          unsigned int                   :32       ;//0x0264
          unsigned int                   :32       ;//0x0268
          unsigned int                   :32       ;//0x026c
          unsigned int                   :32       ;//0x0270
          unsigned int                   :32       ;//0x0274
          unsigned int                   :32       ;//0x0278
          unsigned int                   :32       ;//0x027c
          unsigned int                   :32       ;//0x0280
          unsigned int                   :32       ;//0x0284
          unsigned int                   :32       ;//0x0288
          unsigned int                   :32       ;//0x028c
          unsigned int                   :32       ;//0x0290
          unsigned int                   :32       ;//0x0294
          unsigned int                   :32       ;//0x0298
          unsigned int                   :32       ;//0x029c
          unsigned int                   :32       ;//0x02a0
          unsigned int                   :32       ;//0x02a4
          unsigned int                   :32       ;//0x02a8
          unsigned int                   :32       ;//0x02ac
          unsigned int                   :32       ;//0x02b0
          unsigned int                   :32       ;//0x02b4
          unsigned int                   :32       ;//0x02b8
          unsigned int                   :32       ;//0x02bc
          unsigned int                   :32       ;//0x02c0
          unsigned int                   :32       ;//0x02c4
          unsigned int                   :32       ;//0x02c8
          unsigned int                   :32       ;//0x02cc
          unsigned int                   :32       ;//0x02d0
          unsigned int                   :32       ;//0x02d4
          unsigned int                   :32       ;//0x02d8
          unsigned int                   :32       ;//0x02dc
          unsigned int                   :32       ;//0x02e0
          unsigned int                   :32       ;//0x02e4
          unsigned int                   :32       ;//0x02e8
          unsigned int                   :32       ;//0x02ec
          unsigned int                   :32       ;//0x02f0
          unsigned int                   :32       ;//0x02f4
          unsigned int                   :32       ;//0x02f8
          unsigned int                   :32       ;//0x02fc
          unsigned int                   :32       ;//0x0300
          unsigned int                   :32       ;//0x0304
          unsigned int                   :32       ;//0x0308
          unsigned int                   :32       ;//0x030c
          unsigned int                   :32       ;//0x0310
          unsigned int                   :32       ;//0x0314
          unsigned int                   :32       ;//0x0318
          unsigned int                   :32       ;//0x031c
          unsigned int                   :32       ;//0x0320
          unsigned int                   :32       ;//0x0324
          unsigned int                   :32       ;//0x0328
          unsigned int                   :32       ;//0x032c
          unsigned int                   :32       ;//0x0330
          unsigned int                   :32       ;//0x0334
          unsigned int                   :32       ;//0x0338
          unsigned int                   :32       ;//0x033c
          unsigned int                   :32       ;//0x0340
          unsigned int                   :32       ;//0x0344
          unsigned int                   :32       ;//0x0348
          unsigned int                   :32       ;//0x034c
          unsigned int                   :32       ;//0x0350
          unsigned int                   :32       ;//0x0354
          unsigned int                   :32       ;//0x0358
          unsigned int                   :32       ;//0x035c
          unsigned int                   :32       ;//0x0360
          unsigned int                   :32       ;//0x0364
          unsigned int                   :32       ;//0x0368
          unsigned int                   :32       ;//0x036c
          unsigned int                   :32       ;//0x0370
          unsigned int                   :32       ;//0x0374
          unsigned int                   :32       ;//0x0378
          unsigned int                   :32       ;//0x037c
          unsigned int                   :32       ;//0x0380
          unsigned int                   :32       ;//0x0384
          unsigned int                   :32       ;//0x0388
          unsigned int                   :32       ;//0x038c
          unsigned int                   :32       ;//0x0390
          unsigned int                   :32       ;//0x0394
          unsigned int                   :32       ;//0x0398
          unsigned int                   :32       ;//0x039c
          unsigned int                   :32       ;//0x03a0
          unsigned int                   :32       ;//0x03a4
          unsigned int                   :32       ;//0x03a8
          unsigned int                   :32       ;//0x03ac
          unsigned int                   :32       ;//0x03b0
          unsigned int                   :32       ;//0x03b4
          unsigned int                   :32       ;//0x03b8
          unsigned int                   :32       ;//0x03bc
          unsigned int                   :32       ;//0x03c0
          unsigned int                   :32       ;//0x03c4
          unsigned int                   :32       ;//0x03c8
          unsigned int                   :32       ;//0x03cc
          unsigned int                   :32       ;//0x03d0
          unsigned int                   :32       ;//0x03d4
          unsigned int                   :32       ;//0x03d8
          unsigned int                   :32       ;//0x03dc
          unsigned int                   :32       ;//0x03e0
          unsigned int                   :32       ;//0x03e4
          unsigned int                   :32       ;//0x03e8
          unsigned int                   :32       ;//0x03ec
          unsigned int                   :32       ;//0x03f0
          unsigned int                   :32       ;//0x03f4
  union {
    const unsigned long                  config    ;//0x03f8
    const avr32_pm_config_t              CONFIG    ;
  };
  union {
    const unsigned long                  version   ;//0x03fc
    const avr32_pm_version_t             VERSION   ;
  };
} avr32_pm_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_PM_400_H_INCLUDED*/
#endif

