/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_PWM_WPSWS1                                            1
#define AVR32_PWM_WPSWS1_MASK                              0x00000002
#define AVR32_PWM_WPSWS1_NO                                0x00000000
#define AVR32_PWM_WPSWS1_OFFSET                                     1
#define AVR32_PWM_WPSWS1_SIZE                                       1
#define AVR32_PWM_WPSWS1_YES                               0x00000001
#define AVR32_PWM_WPSWS2                                            2
#define AVR32_PWM_WPSWS2_MASK                              0x00000004
#define AVR32_PWM_WPSWS2_NO                                0x00000000
#define AVR32_PWM_WPSWS2_OFFSET                                     2
#define AVR32_PWM_WPSWS2_SIZE                                       1
#define AVR32_PWM_WPSWS2_YES                               0x00000001
#define AVR32_PWM_WPSWS3                                            3
#define AVR32_PWM_WPSWS3_MASK                              0x00000008
#define AVR32_PWM_WPSWS3_NO                                0x00000000
#define AVR32_PWM_WPSWS3_OFFSET                                     3
#define AVR32_PWM_WPSWS3_SIZE                                       1
#define AVR32_PWM_WPSWS3_YES                               0x00000001
#define AVR32_PWM_WPSWS4                                            4
#define AVR32_PWM_WPSWS4_MASK                              0x00000010
#define AVR32_PWM_WPSWS4_NO                                0x00000000
#define AVR32_PWM_WPSWS4_OFFSET                                     4
#define AVR32_PWM_WPSWS4_SIZE                                       1
#define AVR32_PWM_WPSWS4_YES                               0x00000001
#define AVR32_PWM_WPSWS5                                            5
#define AVR32_PWM_WPSWS5_MASK                              0x00000020
#define AVR32_PWM_WPSWS5_NO                                0x00000000
#define AVR32_PWM_WPSWS5_OFFSET                                     5
#define AVR32_PWM_WPSWS5_SIZE                                       1
#define AVR32_PWM_WPSWS5_YES                               0x00000001
#define AVR32_PWM_WPVS                                              7
#define AVR32_PWM_WPVSRC                                           16
#define AVR32_PWM_WPVSRC_MASK                              0xffff0000
#define AVR32_PWM_WPVSRC_OFFSET                                    16
#define AVR32_PWM_WPVSRC_SIZE                                      16
#define AVR32_PWM_WPVS_MASK                                0x00000080
#define AVR32_PWM_WPVS_OFFSET                                       7
#define AVR32_PWM_WPVS_SIZE                                         1
#define AVR32_PWM_WRDY                                              0
#define AVR32_PWM_WRDY_MASK                                0x00000001
#define AVR32_PWM_WRDY_OFFSET                                       0
#define AVR32_PWM_WRDY_SIZE                                         1
#define AVR32_PWM_YES                                      0x00000001




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_pwm_clk_t
{
    unsigned int clksel          : 1;
    unsigned int                 : 3;
    unsigned int preb            : 4;
    unsigned int divb            : 8;
    unsigned int                 : 4;
    unsigned int prea            : 4;
    unsigned int diva            : 8;
} avr32_pwm_clk_t;



typedef struct avr32_pwm_ena_t
{
    unsigned int                 :28;
    unsigned int chid3           : 1;
    unsigned int chid2           : 1;
    unsigned int chid1           : 1;
    unsigned int chid0           : 1;
} avr32_pwm_ena_t;



typedef struct avr32_pwm_dis_t
{
    unsigned int                 :28;
    unsigned int chid3           : 1;
    unsigned int chid2           : 1;
    unsigned int chid1           : 1;
    unsigned int chid0           : 1;
} avr32_pwm_dis_t;



typedef struct avr32_pwm_sr_t
{
    unsigned int                 :28;
    unsigned int chid3           : 1;
    unsigned int chid2           : 1;
    unsigned int chid1           : 1;
    unsigned int chid0           : 1;
} avr32_pwm_sr_t;



typedef struct avr32_pwm_ier1_t
{
    unsigned int                 :12;
    unsigned int fchid3          : 1;
    unsigned int fchid2          : 1;
    unsigned int fchid1          : 1;
    unsigned int fchid0          : 1;
    unsigned int                 :12;
    unsigned int chid3           : 1;
    unsigned int chid2           : 1;
    unsigned int chid1           : 1;
    unsigned int chid0           : 1;
} avr32_pwm_ier1_t;



typedef struct avr32_pwm_idr1_t
{
    unsigned int                 :12;
    unsigned int fchid3          : 1;
    unsigned int fchid2          : 1;
    unsigned int fchid1          : 1;
    unsigned int fchid0          : 1;
    unsigned int                 :12;
    unsigned int chid3           : 1;
    unsigned int chid2           : 1;
    unsigned int chid1           : 1;
    unsigned int chid0           : 1;
} avr32_pwm_idr1_t;



typedef struct avr32_pwm_imr1_t
{
    unsigned int                 :12;
    unsigned int fchid3          : 1;
    unsigned int fchid2          : 1;
    unsigned int fchid1          : 1;
    unsigned int fchid0          : 1;
    unsigned int                 :12;
    unsigned int chid3           : 1;
    unsigned int chid2           : 1;
    unsigned int chid1           : 1;
    unsigned int chid0           : 1;
} avr32_pwm_imr1_t;



typedef struct avr32_pwm_isr1_t
{
    unsigned int                 :12;
    unsigned int fchid3          : 1;
    unsigned int fchid2          : 1;
    unsigned int fchid1          : 1;
    unsigned int fchid0          : 1;
    unsigned int                 :12;
    unsigned int chid3           : 1;
    unsigned int chid2           : 1;
    unsigned int chid1           : 1;
    unsigned int chid0           : 1;
} avr32_pwm_isr1_t;



typedef struct avr32_pwm_scm_t
{
    unsigned int                 : 8;
    unsigned int ptrcs           : 3;
    unsigned int ptrm            : 1;
    unsigned int                 : 2;
    unsigned int updm            : 2;
    unsigned int                 :12;
    unsigned int sync3           : 1;
    unsigned int sync2           : 1;
    unsigned int sync1           : 1;
    unsigned int sync0           : 1;
} avr32_pwm_scm_t;



typedef struct avr32_pwm_scuc_t
{
    unsigned int                 :31;
    unsigned int updulock        : 1;
} avr32_pwm_scuc_t;



typedef struct avr32_pwm_scup_t
{
    unsigned int                 :24;
    unsigned int uprcnt          : 4;
    unsigned int upr             : 4;
} avr32_pwm_scup_t;



typedef struct avr32_pwm_scupupd_t
{
    unsigned int                 :16;
    unsigned int uprupd          :16;
} avr32_pwm_scupupd_t;



typedef struct avr32_pwm_ier2_t
{
    unsigned int                 : 8;
    unsigned int cmpu7           : 1;
    unsigned int cmpu6           : 1;
    unsigned int cmpu5           : 1;
    unsigned int cmpu4           : 1;
    unsigned int cmpu3           : 1;
    unsigned int cmpu2           : 1;
    unsigned int cmpu1           : 1;
    unsigned int cmpu0           : 1;
    unsigned int cmpm7           : 1;
    unsigned int cmpm6           : 1;
    unsigned int cmpm5           : 1;
    unsigned int cmpm4           : 1;
    unsigned int cmpm3           : 1;
    unsigned int cmpm2           : 1;
    unsigned int cmpm1           : 1;
    unsigned int cmpm0           : 1;
    unsigned int                 : 4;
    unsigned int unre            : 1;
    unsigned int txbufe          : 1;
    unsigned int endtx           : 1;
    unsigned int wrdy            : 1;
} avr32_pwm_ier2_t;



typedef struct avr32_pwm_idr2_t
{
    unsigned int                 : 8;
    unsigned int cmpu7           : 1;
    unsigned int cmpu6           : 1;
    unsigned int cmpu5           : 1;
    unsigned int cmpu4           : 1;
    unsigned int cmpu3           : 1;
    unsigned int cmpu2           : 1;
    unsigned int cmpu1           : 1;
    unsigned int cmpu0           : 1;
    unsigned int cmpm7           : 1;
    unsigned int cmpm6           : 1;
    unsigned int cmpm5           : 1;
    unsigned int cmpm4           : 1;
    unsigned int cmpm3           : 1;
    unsigned int cmpm2           : 1;
    unsigned int cmpm1           : 1;
    unsigned int cmpm0           : 1;
    unsigned int                 : 4;
    unsigned int unre            : 1;
    unsigned int txbufe          : 1;
    unsigned int endtx           : 1;
    unsigned int wrdy            : 1;
} avr32_pwm_idr2_t;



typedef struct avr32_pwm_imr2_t
{
    unsigned int                 : 8;
    unsigned int cmpu7           : 1;
    unsigned int cmpu6           : 1;
    unsigned int cmpu5           : 1;
    unsigned int cmpu4           : 1;
    unsigned int cmpu3           : 1;
    unsigned int cmpu2           : 1;
    unsigned int cmpu1           : 1;
    unsigned int cmpu0           : 1;
    unsigned int cmpm7           : 1;
    unsigned int cmpm6           : 1;
    unsigned int cmpm5           : 1;
    unsigned int cmpm4           : 1;
    unsigned int cmpm3           : 1;
    unsigned int cmpm2           : 1;
    unsigned int cmpm1           : 1;
    unsigned int cmpm0           : 1;
    unsigned int                 : 4;
    unsigned int unre            : 1;
    unsigned int txbufe          : 1;
    unsigned int endtx           : 1;
    unsigned int wrdy            : 1;
} avr32_pwm_imr2_t;



typedef struct avr32_pwm_isr2_t
{
    unsigned int                 : 8;
    unsigned int cmpu7           : 1;
    unsigned int cmpu6           : 1;
    unsigned int cmpu5           : 1;
    unsigned int cmpu4           : 1;
    unsigned int cmpu3           : 1;
    unsigned int cmpu2           : 1;
    unsigned int cmpu1           : 1;
    unsigned int cmpu0           : 1;
    unsigned int cmpm7           : 1;
    unsigned int cmpm6           : 1;
    unsigned int cmpm5           : 1;
    unsigned int cmpm4           : 1;
    unsigned int cmpm3           : 1;
    unsigned int cmpm2           : 1;
    unsigned int cmpm1           : 1;
    unsigned int cmpm0           : 1;
    unsigned int                 : 4;
    unsigned int unre            : 1;
    unsigned int txbufe          : 1;
    unsigned int endtx           : 1;
    unsigned int wrdy            : 1;
} avr32_pwm_isr2_t;



typedef struct avr32_pwm_oov_t
{
    unsigned int                 :12;
    unsigned int oovl3           : 1;
    unsigned int oovl2           : 1;
    unsigned int oovl1           : 1;
    unsigned int oovl0           : 1;
    unsigned int                 :12;
    unsigned int oovh3           : 1;
    unsigned int oovh2           : 1;
    unsigned int oovh1           : 1;
    unsigned int oovh0           : 1;
} avr32_pwm_oov_t;



typedef struct avr32_pwm_os_t
{
    unsigned int                 :12;
    unsigned int osl3            : 1;
    unsigned int osl2            : 1;
    unsigned int osl1            : 1;
    unsigned int osl0            : 1;
    unsigned int                 :12;
    unsigned int osh3            : 1;
    unsigned int osh2            : 1;
    unsigned int osh1            : 1;
    unsigned int osh0            : 1;
} avr32_pwm_os_t;



typedef struct avr32_pwm_oss_t
{
    unsigned int                 :12;
    unsigned int ossl3           : 1;
    unsigned int ossl2           : 1;
    unsigned int ossl1           : 1;
    unsigned int ossl0           : 1;
    unsigned int                 :12;
    unsigned int ossh3           : 1;
    unsigned int ossh2           : 1;
    unsigned int ossh1           : 1;
    unsigned int ossh0           : 1;
} avr32_pwm_oss_t;



typedef struct avr32_pwm_osc_t
{
    unsigned int                 :12;
    unsigned int oscl3           : 1;
    unsigned int oscl2           : 1;
    unsigned int oscl1           : 1;
    unsigned int oscl0           : 1;
    unsigned int                 :12;
    unsigned int osch3           : 1;
    unsigned int osch2           : 1;
    unsigned int osch1           : 1;
    unsigned int osch0           : 1;
} avr32_pwm_osc_t;



typedef struct avr32_pwm_ossupd_t
{
    unsigned int                 :12;
    unsigned int ossupl3         : 1;
    unsigned int ossupl2         : 1;
    unsigned int ossupl1         : 1;
    unsigned int ossupl0         : 1;
    unsigned int                 :13;
    unsigned int ossuph2         : 1;
    unsigned int ossuph1         : 1;
    unsigned int ossuph0         : 1;
} avr32_pwm_ossupd_t;



typedef struct avr32_pwm_oscupd_t
{
    unsigned int                 :12;
    unsigned int oscupl3         : 1;
    unsigned int oscupl2         : 1;
    unsigned int oscupl1         : 1;
    unsigned int oscupl0         : 1;
    unsigned int                 :12;
    unsigned int oscuph3         : 1;
    unsigned int oscuph2         : 1;
    unsigned int oscuph1         : 1;
    unsigned int oscuph0         : 1;
} avr32_pwm_oscupd_t;



typedef struct avr32_pwm_fmr_t
{
    unsigned int                 :11;
    unsigned int ffil4           : 1;
    unsigned int ffil3           : 1;
    unsigned int ffil2           : 1;
    unsigned int ffil1           : 1;
    unsigned int ffil0           : 1;
    unsigned int                 : 3;
    unsigned int fmod4           : 1;
    unsigned int fmod3           : 1;
    unsigned int fmod2           : 1;
    unsigned int fmod1           : 1;
    unsigned int fmod0           : 1;
    unsigned int                 : 3;
    unsigned int fpol4           : 1;
    unsigned int fpol3           : 1;
    unsigned int fpol2           : 1;
    unsigned int fpol1           : 1;
    unsigned int fpol0           : 1;
} avr32_pwm_fmr_t;



typedef struct avr32_pwm_fsr_t
{
    unsigned int                 :19;
    unsigned int fs4             : 1;
    unsigned int fs3             : 1;
    unsigned int fs2             : 1;
    unsigned int fs1             : 1;
    unsigned int fs0             : 1;
    unsigned int                 : 3;
    unsigned int fiv4            : 1;
    unsigned int fiv3            : 1;
    unsigned int fiv2            : 1;
    unsigned int fiv1            : 1;
    unsigned int fiv0            : 1;
} avr32_pwm_fsr_t;



typedef struct avr32_pwm_fcr_t
{
    unsigned int                 :27;
    unsigned int fclr4           : 1;
    unsigned int fclr3           : 1;
    unsigned int fclr2           : 1;
    unsigned int fclr1           : 1;
    unsigned int fclr0           : 1;
} avr32_pwm_fcr_t;



typedef struct avr32_pwm_fpv_t
{
    unsigned int                 :12;
    unsigned int fpvl3           : 1;
    unsigned int fpvl2           : 1;
    unsigned int fpvl1           : 1;
    unsigned int fpvl0           : 1;
    unsigned int                 :12;
    unsigned int fpvh3           : 1;
    unsigned int fpvh2           : 1;
    unsigned int fpvh1           : 1;
    unsigned int fpvh0           : 1;
} avr32_pwm_fpv_t;



typedef struct avr32_pwm_fpe1_t
{
    unsigned int                 : 3;
    unsigned int fpe3            : 5;
    unsigned int                 : 3;
    unsigned int fpe2            : 5;
    unsigned int                 : 3;
    unsigned int fpe1            : 5;
    unsigned int                 : 3;
    unsigned int fpe0            : 5;
} avr32_pwm_fpe1_t;



typedef struct avr32_pwm_elxmr_t
{
    unsigned int                 :24;
    unsigned int csel7           : 1;
    unsigned int csel6           : 1;
    unsigned int csel5           : 1;
    unsigned int csel4           : 1;
    unsigned int csel3           : 1;
    unsigned int csel2           : 1;
    unsigned int csel1           : 1;
    unsigned int csel0           : 1;
} avr32_pwm_elxmr_t;



typedef struct avr32_pwm_wpcr_t
{
    unsigned int wpkey           :24;
    unsigned int wprg5           : 1;
    unsigned int wprg4           : 1;
    unsigned int wprg3           : 1;
    unsigned int wprg2           : 1;
    unsigned int wprg1           : 1;
    unsigned int wprg0           : 1;
    unsigned int wpcmd           : 2;
} avr32_pwm_wpcr_t;



typedef struct avr32_pwm_wpsr_t
{
    unsigned int wpvsrc          :16;
    unsigned int                 : 2;
    unsigned int wphws5          : 1;
    unsigned int wphws4          : 1;
    unsigned int wphws3          : 1;
    unsigned int wphws2          : 1;
    unsigned int wphws1          : 1;
    unsigned int wphws0          : 1;
    unsigned int wpvs            : 1;
    unsigned int                 : 1;
    unsigned int wpsws5          : 1;
    unsigned int wpsws4          : 1;
    unsigned int wpsws3          : 1;
    unsigned int wpsws2          : 1;
    unsigned int wpsws1          : 1;
    unsigned int wpsws0          : 1;
} avr32_pwm_wpsr_t;



typedef struct avr32_pwm_version_t
{
    unsigned int                 :13;
    unsigned int mfn             : 3;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_pwm_version_t;



typedef struct avr32_pwm_cmp0v_t
{
    unsigned int                 : 7;
    unsigned int cvm             : 1;
    unsigned int                 : 4;
    unsigned int cv              :20;
} avr32_pwm_cmp0v_t;



typedef struct avr32_pwm_cmp0vupd_t
{
    unsigned int                 : 7;
    unsigned int cvmupd          : 1;
    unsigned int                 : 4;
    unsigned int cvupd           :20;
} avr32_pwm_cmp0vupd_t;



typedef struct avr32_pwm_cmp0m_t
{
    unsigned int                 : 8;
    unsigned int cuprcnt         : 4;
    unsigned int cupr            : 4;
    unsigned int cprcnt          : 4;
    unsigned int cpr             : 4;
    unsigned int ctr             : 4;
    unsigned int                 : 3;
    unsigned int cen             : 1;
} avr32_pwm_cmp0m_t;



typedef struct avr32_pwm_cmp0mupd_t
{
    unsigned int                 :12;
    unsigned int cuprupd         : 4;
    unsigned int                 : 4;
    unsigned int cprupd          : 4;
    unsigned int ctrupd          : 4;
    unsigned int                 : 3;
    unsigned int cenupd          : 1;
} avr32_pwm_cmp0mupd_t;



typedef struct avr32_pwm_cmr_t
{
    unsigned int                 :13;
    unsigned int dtli            : 1;
    unsigned int dthi            : 1;
    unsigned int dte             : 1;
    unsigned int                 : 5;
    unsigned int ces             : 1;
    unsigned int cpol            : 1;
    unsigned int calg            : 1;
    unsigned int                 : 4;
    unsigned int cpre            : 4;
} avr32_pwm_cmr_t;



typedef struct avr32_pwm_cdty_t
{
    unsigned int                 :12;
    unsigned int cdty            :20;
} avr32_pwm_cdty_t;



typedef struct avr32_pwm_cdtyupd_t
{
    unsigned int                 :12;
    unsigned int cdtyupd         :20;
} avr32_pwm_cdtyupd_t;



typedef struct avr32_pwm_cprd_t
{
    unsigned int                 :12;
    unsigned int cprd            :20;
} avr32_pwm_cprd_t;



typedef struct avr32_pwm_cprdupd_t
{
    unsigned int                 :12;
    unsigned int cprdupd         :20;
} avr32_pwm_cprdupd_t;



typedef struct avr32_pwm_ccnt_t
{
    unsigned int                 :12;
    unsigned int cnt             :20;
} avr32_pwm_ccnt_t;



typedef struct avr32_pwm_dt_t
{
    unsigned int dtl             :16;
    unsigned int dth             :16;
} avr32_pwm_dt_t;



typedef struct avr32_pwm_dtupd_t
{
    unsigned int dtlupd          :16;
    unsigned int dthupd          :16;
} avr32_pwm_dtupd_t;


typedef struct avr32_pwm_channel_t
{
    union
    {
        unsigned long   cmr;    // 0x0000
        avr32_pwm_cmr_t CMR;
    };
    union
    {
        unsigned long    cdty;  // 0x0004
        avr32_pwm_cdty_t CDTY;
    };
    union
    {
        unsigned long       cdtyupd;    // 0x0008
        avr32_pwm_cdtyupd_t CDTYUPD;
    };
    union
    {
        unsigned long    cprd;  // 0x000c
        avr32_pwm_cprd_t CPRD;
    };
    union
    {
        unsigned long       cprdupd;    // 0x0010
        avr32_pwm_cprdupd_t CPRDUPD;
    };
    const unsigned long ccnt;   // 0x0014
    union
    {
        unsigned long  dt;  // 0x0018
        avr32_pwm_dt_t DT;
    };
    union
    {
        unsigned long     dtupd;  // 0x001c
        avr32_pwm_dtupd_t DTUPD;
    };
} avr32_pwm_channel_t;


typedef struct avr32_pwm_comp_t
{
    union
    {
        unsigned long     cmp0v;  // 0x0000
        avr32_pwm_cmp0v_t CMP0V;
    };
    union
    {
        unsigned long        cmp0vupd;  // 0x0004
        avr32_pwm_cmp0vupd_t CMP0VUPD;
    };
    union
    {
        unsigned long     cmp0m;  // 0x0008
        avr32_pwm_cmp0m_t CMP0M;
    };
    union
    {
        unsigned long        cmp0mupd;  // 0x000c
        avr32_pwm_cmp0mupd_t CMP0MUPD;
    };
} avr32_pwm_comp_t;



typedef struct avr32_pwm_t
{
    union
    {
        unsigned long   clk; // 0x0000
        avr32_pwm_clk_t CLK;
    };
    union
    {
        unsigned long   ena; // 0x0004
        avr32_pwm_ena_t ENA;
    };
    union
    {
        unsigned long   dis; // 0x0008
        avr32_pwm_dis_t DIS;
    };
    union
    {
        const unsigned long  sr; // 0x000c
        const avr32_pwm_sr_t SR;
    };
    union
    {
        unsigned long    ier1; // 0x0010
        avr32_pwm_ier1_t IER1;
    };
    union
    {
        unsigned long    idr1;  // 0x0014
        avr32_pwm_idr1_t IDR1;
    };
    union
    {
        const unsigned long    imr1;    // 0x0018
        const avr32_pwm_imr1_t IMR1;
    };
    union
    {
        const unsigned long    isr1;    // 0x001c
        const avr32_pwm_isr1_t ISR1;
    };
    union
    {
        unsigned long   scm;    // 0x0020
        avr32_pwm_scm_t SCM;
    };
    unsigned long pdcdata;  // 0x0024
    union
    {
        unsigned long    scuc;    // 0x0028
        avr32_pwm_scuc_t SCUC;
    };
    union
    {
        unsigned long    scup;    // 0x002c
        avr32_pwm_scup_t SCUP;
    };
    union
    {
        unsigned long       scupupd; // 0x0030
        avr32_pwm_scupupd_t SCUPUPD;
    };
    union
    {
        unsigned long    ier2;    // 0x0034
        avr32_pwm_ier2_t IER2;
    };
    union
    {
        unsigned long    idr2;    // 0x0038
        avr32_pwm_idr2_t IDR2;
    };
    union
    {
        const unsigned long    imr2;  // 0x003c
        const avr32_pwm_imr2_t IMR2;
    };
    union
    {
        const unsigned long    isr2;  // 0x0040
        const avr32_pwm_isr2_t ISR2;
    };
    union
    {
        unsigned long   oov; // 0x0044
        avr32_pwm_oov_t OOV;
    };
    union
    {
        unsigned long  os;  // 0x0048
        avr32_pwm_os_t OS;
    };
    union
    {
        unsigned long   oss; // 0x004c
        avr32_pwm_oss_t OSS;
    };
    union
    {
        unsigned long   osc; // 0x0050
        avr32_pwm_osc_t OSC;
    };
    union
    {
        unsigned long      ossupd;  // 0x0054
        avr32_pwm_ossupd_t OSSUPD;
    };
    union
    {
        unsigned long      oscupd;  // 0x0058
        avr32_pwm_oscupd_t OSCUPD;
    };
    union
    {
        unsigned long   fmr; // 0x005c
        avr32_pwm_fmr_t FMR;
    };
    union
    {
        const unsigned long   fsr;   // 0x0060
        const avr32_pwm_fsr_t FSR;
    };
    union
    {
        unsigned long   fcr; // 0x0064
        avr32_pwm_fcr_t FCR;
    };
    union
    {
        unsigned long   fpv; // 0x0068
        avr32_pwm_fpv_t FPV;
    };
    union
    {
        unsigned long    fpe1;    // 0x006c
        avr32_pwm_fpe1_t FPE1;
    };
    unsigned int :32;   // 0x0070
    unsigned int :32;   // 0x0074
    unsigned int :32;   // 0x0078
    union
    {
        unsigned long     elxmr[AVR32_PWM_EVT_NUM]; // 0x007c
        avr32_pwm_elxmr_t ELXMR[AVR32_PWM_EVT_NUM];
    };
#if AVR32_PWM_EVT_NUM < 2
    unsigned long  elxmr_reserved[2 - AVR32_PWM_EVT_NUM]; // Padding
#endif
    unsigned int :32;   // 0x0084
    unsigned int :32;   // 0x0088
    unsigned int :32;   // 0x008c
    unsigned int :32;   // 0x0090
    unsigned int :32;   // 0x0094
    unsigned int :32;   // 0x0098
    unsigned int :32;   // 0x009c
    unsigned int :32;   // 0x00a0
    unsigned int :32;   // 0x00a4
    unsigned int :32;   // 0x00a8
    unsigned int :32;   // 0x00ac
    unsigned int :32;   // 0x00b0
    unsigned int :32;   // 0x00b4
    unsigned int :32;   // 0x00b8
    unsigned int :32;   // 0x00bc
    unsigned int :32;   // 0x00c0
    unsigned int :32;   // 0x00c4
    unsigned int :32;   // 0x00c8
    unsigned int :32;   // 0x00cc
    unsigned int :32;   // 0x00d0
    unsigned int :32;   // 0x00d4
    unsigned int :32;   // 0x00d8
    unsigned int :32;   // 0x00dc
    unsigned int :32;   // 0x00e0
    union
    {
        unsigned long                  wpcr      ;//0x00e4
        avr32_pwm_wpcr_t               WPCR      ;
    };
    union
    {
        const unsigned long                  wpsr      ;//0x00e8
        const avr32_pwm_wpsr_t               WPSR      ;
    };
    unsigned int                   :32       ;//0x00ec
    unsigned int                   :32       ;//0x00f0
    unsigned int                   :32       ;//0x00f4
    unsigned int                   :32       ;//0x00f8
    union
    {
        const unsigned long                  version   ;//0x00fc
        const avr32_pwm_version_t            VERSION   ;
    };
    unsigned int                   :32       ;//0x0100
    unsigned int                   :32       ;//0x0104
    unsigned long                  tpr       ;//0x0108
    unsigned long                  tcr       ;//0x010c
    unsigned int                   :32       ;//0x0110
    unsigned int                   :32       ;//0x0114
    unsigned long                  tnpr      ;//0x0118
    unsigned long                  tncr      ;//0x011c
    unsigned long                  ptcr      ;//0x0120
    unsigned long                  ptsr      ;//0x0124
    unsigned int                   :32       ;//0x0128
    unsigned int                   :32       ;//0x012c
    avr32_pwm_comp_t comp[AVR32_PWM_CMP_NUM];//0x130
#if AVR32_PWM_CMP_NUM < 8
    avr32_pwm_comp_t comp_reserved[8 - AVR32_PWM_CMP_NUM];//Padding
#endif
    unsigned int                   :32; // 0x01b0
    unsigned int                   :32; // 0x01b4
    unsigned int                   :32; // 0x01b8
    unsigned int                   :32; // 0x01bc
    unsigned int                   :32; // 0x01c0
    unsigned int                   :32; // 0x01c4
    unsigned int                   :32; // 0x01c8
    unsigned int                   :32; // 0x01cc
    unsigned int                   :32; // 0x01d0
    unsigned int                   :32; // 0x01d4
    unsigned int                   :32; // 0x01d8
    unsigned int                   :32; // 0x01dc
    unsigned int                   :32; // 0x01e0
    unsigned int                   :32; // 0x01e4
    unsigned int                   :32; // 0x01e8
    unsigned int                   :32; // 0x01ec
    unsigned int                   :32; // 0x01f0
    unsigned int                   :32; // 0x01f4
    unsigned int                   :32; // 0x01f8
    unsigned int                   :32; // 0x01fc
    avr32_pwm_channel_t channel[AVR32_PWM_CHANNEL_NUM]; // 0x200
#if AVR32_PWM_CHANNEL_NUM < 4
    avr32_pwm_channel_t channel_reserved[4 - AVR32_PWM_CHANNEL_NUM]; // Padding
#endif
} avr32_pwm_t;



#endif /* #ifdef __AVR32_ABI_COMPILER__ */

#endif /* #ifdef AVR32_PWM_410_H_INCLUDED */


