/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_QDEC_TOP_RESETVALUE                           0x00000000
#define AVR32_QDEC_TRIGGER                                           9
#define AVR32_QDEC_TRIGGER_MASK                             0x00000200
#define AVR32_QDEC_TRIGGER_OFFSET                                    9
#define AVR32_QDEC_TRIGGER_SIZE                                      1
#define AVR32_QDEC_TSDIR                                            16
#define AVR32_QDEC_TSDIR_MASK                               0x00010000
#define AVR32_QDEC_TSDIR_OFFSET                                     16
#define AVR32_QDEC_TSDIR_SIZE                                        1
#define AVR32_QDEC_UPD                                              17
#define AVR32_QDEC_UPD_MASK                                 0x00020000
#define AVR32_QDEC_UPD_OFFSET                                       17
#define AVR32_QDEC_UPD_SIZE                                          1
#define AVR32_QDEC_VARIANT                                          16
#define AVR32_QDEC_VARIANT_MASK                             0x000f0000
#define AVR32_QDEC_VARIANT_OFFSET                                   16
#define AVR32_QDEC_VARIANT_SIZE                                      4
#define AVR32_QDEC_VERSION                                  0x00000030
#define AVR32_QDEC_VERSION_MASK                             0x000f0fff
#define AVR32_QDEC_VERSION_OFFSET                                    0
#define AVR32_QDEC_VERSION_RESETVALUE                       0x00000100
#define AVR32_QDEC_VERSION_SIZE                                     12
#define AVR32_QDEC_VERSION_VARIANT                                  16
#define AVR32_QDEC_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_QDEC_VERSION_VARIANT_OFFSET                           16
#define AVR32_QDEC_VERSION_VARIANT_SIZE                              4
#define AVR32_QDEC_VERSION_VERSION                                   0
#define AVR32_QDEC_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_QDEC_VERSION_VERSION_OFFSET                            0
#define AVR32_QDEC_VERSION_VERSION_SIZE                             12
#define AVR32_QDEC_WP                                               30
#define AVR32_QDEC_WPHA                                             26
#define AVR32_QDEC_WPHA_MASK                                0x04000000
#define AVR32_QDEC_WPHA_OFFSET                                      26
#define AVR32_QDEC_WPHA_SIZE                                         1
#define AVR32_QDEC_WPHB                                             27
#define AVR32_QDEC_WPHB_MASK                                0x08000000
#define AVR32_QDEC_WPHB_OFFSET                                      27
#define AVR32_QDEC_WPHB_SIZE                                         1
#define AVR32_QDEC_WP_MASK                                  0x40000000
#define AVR32_QDEC_WP_OFFSET                                        30
#define AVR32_QDEC_WP_SIZE                                           1




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_qdec_ctrl_t {
    unsigned int                 :30;
    unsigned int swtrg           : 1;
    unsigned int clken           : 1;
} avr32_qdec_ctrl_t;



typedef struct avr32_qdec_cf_t {
    unsigned int                 :14;
    unsigned int upd             : 1;
    unsigned int tsdir           : 1;
    unsigned int                 : 2;
    unsigned int filten          : 1;
    unsigned int idxphs          : 2;
    unsigned int idxinv          : 1;
    unsigned int phsinvb         : 1;
    unsigned int phsinva         : 1;
    unsigned int                 : 3;
    unsigned int evtrge          : 1;
    unsigned int rcce            : 1;
    unsigned int pcce            : 1;
    unsigned int idxe            : 1;
    unsigned int qdec            : 1;
} avr32_qdec_cf_t;



typedef struct avr32_qdec_cnt_t {
    unsigned int rc              :16;
    unsigned int pc              :16;
} avr32_qdec_cnt_t;



typedef struct avr32_qdec_top_t {
    unsigned int rctop           :16;
    unsigned int pctop           :16;
} avr32_qdec_top_t;



typedef struct avr32_qdec_cmp_t {
    unsigned int rccmp           :16;
    unsigned int pccmp           :16;
} avr32_qdec_cmp_t;



typedef struct avr32_qdec_cap_t {
    unsigned int rccap           :16;
    unsigned int pccap           :16;
} avr32_qdec_cap_t;



typedef struct avr32_qdec_sr_t {
    unsigned int                 : 1;
    unsigned int wp              : 1;
    unsigned int ctb             : 1;
    unsigned int cta             : 1;
    unsigned int wphb            : 1;
    unsigned int wpha            : 1;
    unsigned int oscb            : 1;
    unsigned int osca            : 1;
    unsigned int                 : 6;
    unsigned int clken           : 1;
    unsigned int cntdir          : 1;
    unsigned int                 : 6;
    unsigned int trigger         : 1;
    unsigned int qderr           : 1;
    unsigned int ovr             : 1;
    unsigned int dirinv          : 1;
    unsigned int idxerr          : 1;
    unsigned int rcro            : 1;
    unsigned int pcro            : 1;
    unsigned int cap             : 1;
    unsigned int cmp             : 1;
    unsigned int qepi            : 1;
} avr32_qdec_sr_t;



typedef struct avr32_qdec_scr_t {
    unsigned int                 : 1;
    unsigned int wp              : 1;
    unsigned int ctb             : 1;
    unsigned int cta             : 1;
    unsigned int wphb            : 1;
    unsigned int wpha            : 1;
    unsigned int oscb            : 1;
    unsigned int osca            : 1;
    unsigned int                 :14;
    unsigned int trigger         : 1;
    unsigned int qderr           : 1;
    unsigned int ovr             : 1;
    unsigned int dirinv          : 1;
    unsigned int idxerr          : 1;
    unsigned int rcro            : 1;
    unsigned int pcro            : 1;
    unsigned int cap             : 1;
    unsigned int cmp             : 1;
    unsigned int qepi            : 1;
} avr32_qdec_scr_t;



typedef struct avr32_qdec_imr_t {
    unsigned int                 : 1;
    unsigned int wp              : 1;
    unsigned int ctb             : 1;
    unsigned int cta             : 1;
    unsigned int wphb            : 1;
    unsigned int wpha            : 1;
    unsigned int oscb            : 1;
    unsigned int osca            : 1;
    unsigned int                 :14;
    unsigned int trigger         : 1;
    unsigned int qderr           : 1;
    unsigned int ovr             : 1;
    unsigned int dirinv          : 1;
    unsigned int idxerr          : 1;
    unsigned int rcro            : 1;
    unsigned int pcro            : 1;
    unsigned int cap             : 1;
    unsigned int cmp             : 1;
    unsigned int qepi            : 1;
} avr32_qdec_imr_t;



typedef struct avr32_qdec_ier_t {
    unsigned int                 : 1;
    unsigned int wp              : 1;
    unsigned int ctb             : 1;
    unsigned int cta             : 1;
    unsigned int wphb            : 1;
    unsigned int wpha            : 1;
    unsigned int oscb            : 1;
    unsigned int osca            : 1;
    unsigned int                 :14;
    unsigned int trigger         : 1;
    unsigned int qderr           : 1;
    unsigned int ovr             : 1;
    unsigned int dirinv          : 1;
    unsigned int idxerr          : 1;
    unsigned int rcro            : 1;
    unsigned int pcro            : 1;
    unsigned int cap             : 1;
    unsigned int cmp             : 1;
    unsigned int qepi            : 1;
} avr32_qdec_ier_t;



typedef struct avr32_qdec_idr_t {
    unsigned int                 : 1;
    unsigned int wp              : 1;
    unsigned int ctb             : 1;
    unsigned int cta             : 1;
    unsigned int wphb            : 1;
    unsigned int wpha            : 1;
    unsigned int oscb            : 1;
    unsigned int osca            : 1;
    unsigned int                 :14;
    unsigned int trigger         : 1;
    unsigned int qderr           : 1;
    unsigned int ovr             : 1;
    unsigned int dirinv          : 1;
    unsigned int idxerr          : 1;
    unsigned int rcro            : 1;
    unsigned int pcro            : 1;
    unsigned int cap             : 1;
    unsigned int cmp             : 1;
    unsigned int qepi            : 1;
} avr32_qdec_idr_t;



typedef struct avr32_qdec_parameter_t {
    unsigned int                 :24;
    unsigned int rc_size         : 4;
    unsigned int pc_size         : 4;
} avr32_qdec_parameter_t;



typedef struct avr32_qdec_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_qdec_version_t;



typedef struct avr32_qdec_t {
  union {
          unsigned long                  ctrl      ;//0x0000
          avr32_qdec_ctrl_t              CTRL      ;
  };
  union {
          unsigned long                  cf        ;//0x0004
          avr32_qdec_cf_t                CF        ;
  };
  union {
          unsigned long                  cnt       ;//0x0008
          avr32_qdec_cnt_t               CNT       ;
  };
  union {
          unsigned long                  top       ;//0x000c
          avr32_qdec_top_t               TOP       ;
  };
  union {
          unsigned long                  cmp       ;//0x0010
          avr32_qdec_cmp_t               CMP       ;
  };
  union {
    const unsigned long                  cap       ;//0x0014
    const avr32_qdec_cap_t               CAP       ;
  };
  union {
    const unsigned long                  sr        ;//0x0018
    const avr32_qdec_sr_t                SR        ;
  };
  union {
          unsigned long                  scr       ;//0x001c
          avr32_qdec_scr_t               SCR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0020
    const avr32_qdec_imr_t               IMR       ;
  };
  union {
          unsigned long                  ier       ;//0x0024
          avr32_qdec_ier_t               IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0028
          avr32_qdec_idr_t               IDR       ;
  };
  union {
    const unsigned long                  parameter ;//0x002c
    const avr32_qdec_parameter_t         PARAMETER ;
  };
  union {
    const unsigned long                  version   ;//0x0030
    const avr32_qdec_version_t           VERSION   ;
  };
} avr32_qdec_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_QDEC_100_H_INCLUDED*/
#endif

