/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_SAU_UKEY_MASK                                0x000000ff
#define AVR32_SAU_UKEY_OFFSET                                       0
#define AVR32_SAU_UKEY_SIZE                                         8
#define AVR32_SAU_UR                                       0x000000fc
#define AVR32_SAU_URES                                              5
#define AVR32_SAU_URES_MASK                                0x00000020
#define AVR32_SAU_URES_OFFSET                                       5
#define AVR32_SAU_URES_SIZE                                         1
#define AVR32_SAU_URKEY                                             4
#define AVR32_SAU_URKEY_MASK                               0x00000010
#define AVR32_SAU_URKEY_OFFSET                                      4
#define AVR32_SAU_URKEY_SIZE                                        1
#define AVR32_SAU_URREAD                                            3
#define AVR32_SAU_URREAD_MASK                              0x00000008
#define AVR32_SAU_URREAD_OFFSET                                     3
#define AVR32_SAU_URREAD_SIZE                                       1
#define AVR32_SAU_UR_CHANNEL                                        0
#define AVR32_SAU_UR_CHANNEL_MASK                          0x0000003f
#define AVR32_SAU_UR_CHANNEL_OFFSET                                 0
#define AVR32_SAU_UR_CHANNEL_SIZE                                   6
#define AVR32_SAU_UR_KEY                                            8
#define AVR32_SAU_UR_KEY_MASK                              0x0000ff00
#define AVR32_SAU_UR_KEY_OFFSET                                     8
#define AVR32_SAU_UR_KEY_SIZE                                       8
#define AVR32_SAU_UR_MASK                                  0x0000ff3f
#define AVR32_SAU_UR_RESETVALUE                            0x00000000
#define AVR32_SAU_VARIANT                                          16
#define AVR32_SAU_VARIANT_MASK                             0x000f0000
#define AVR32_SAU_VARIANT_OFFSET                                   16
#define AVR32_SAU_VARIANT_SIZE                                      4
#define AVR32_SAU_VERSION                                  0x00000028
#define AVR32_SAU_VERSION_MASK                             0x000f0fff
#define AVR32_SAU_VERSION_OFFSET                                    0
#define AVR32_SAU_VERSION_RESETVALUE                       0x00000100
#define AVR32_SAU_VERSION_SIZE                                     12
#define AVR32_SAU_VERSION_VARIANT                                  16
#define AVR32_SAU_VERSION_VARIANT_MASK                     0x000f0000
#define AVR32_SAU_VERSION_VARIANT_OFFSET                           16
#define AVR32_SAU_VERSION_VARIANT_SIZE                              4
#define AVR32_SAU_VERSION_VERSION                                   0
#define AVR32_SAU_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_SAU_VERSION_VERSION_OFFSET                            0
#define AVR32_SAU_VERSION_VERSION_SIZE                             12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_sau_cr_t {
    unsigned int                 :26;
    unsigned int berrdis         : 1;
    unsigned int berren          : 1;
    unsigned int sdis            : 1;
    unsigned int sen             : 1;
    unsigned int dis             : 1;
    unsigned int en              : 1;
} avr32_sau_cr_t;



typedef struct avr32_sau_config_t {
    unsigned int                 :16;
    unsigned int ucyc            : 8;
    unsigned int ukey            : 8;
} avr32_sau_config_t;



typedef struct avr32_sau_cerh_t {
    unsigned int                 : 1;
    unsigned int cerh            :31;
} avr32_sau_cerh_t;



typedef struct avr32_sau_sr_t {
    unsigned int                 :22;
    unsigned int sen             : 1;
    unsigned int en              : 1;
    unsigned int rtradr          : 1;
    unsigned int mberror         : 1;
    unsigned int ures            : 1;
    unsigned int urkey           : 1;
    unsigned int urread          : 1;
    unsigned int cau             : 1;
    unsigned int cas             : 1;
    unsigned int exp             : 1;
} avr32_sau_sr_t;



typedef struct avr32_sau_ier_t {
    unsigned int                 :24;
    unsigned int rtradr          : 1;
    unsigned int mberror         : 1;
    unsigned int ures            : 1;
    unsigned int urkey           : 1;
    unsigned int urread          : 1;
    unsigned int cau             : 1;
    unsigned int cas             : 1;
    unsigned int exp             : 1;
} avr32_sau_ier_t;



typedef struct avr32_sau_idr_t {
    unsigned int                 :24;
    unsigned int rtradr          : 1;
    unsigned int mberror         : 1;
    unsigned int ures            : 1;
    unsigned int urkey           : 1;
    unsigned int urread          : 1;
    unsigned int cau             : 1;
    unsigned int cas             : 1;
    unsigned int exp             : 1;
} avr32_sau_idr_t;



typedef struct avr32_sau_imr_t {
    unsigned int                 :24;
    unsigned int rtradr          : 1;
    unsigned int mberror         : 1;
    unsigned int ures            : 1;
    unsigned int urkey           : 1;
    unsigned int urread          : 1;
    unsigned int cau             : 1;
    unsigned int cas             : 1;
    unsigned int exp             : 1;
} avr32_sau_imr_t;



typedef struct avr32_sau_icr_t {
    unsigned int                 :24;
    unsigned int rtradr          : 1;
    unsigned int mberror         : 1;
    unsigned int ures            : 1;
    unsigned int urkey           : 1;
    unsigned int urread          : 1;
    unsigned int cau             : 1;
    unsigned int cas             : 1;
    unsigned int exp             : 1;
} avr32_sau_icr_t;



typedef struct avr32_sau_parameter_t {
    unsigned int                 :26;
    unsigned int channels        : 6;
} avr32_sau_parameter_t;



typedef struct avr32_sau_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_sau_version_t;



typedef struct avr32_sau_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_sau_cr_t                 CR        ;
  };
  union {
          unsigned long                  config    ;//0x0004
          avr32_sau_config_t             CONFIG    ;
  };
  union {
          unsigned long                  cerh      ;//0x0008
          avr32_sau_cerh_t               CERH      ;
  };
          unsigned long                  cerl      ;//0x000c
  union {
    const unsigned long                  sr        ;//0x0010
    const avr32_sau_sr_t                 SR        ;
  };
  union {
          unsigned long                  ier       ;//0x0014
          avr32_sau_ier_t                IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0018
          avr32_sau_idr_t                IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x001c
    const avr32_sau_imr_t                IMR       ;
  };
  union {
          unsigned long                  icr       ;//0x0020
          avr32_sau_icr_t                ICR       ;
  };
  union {
    const unsigned long                  parameter ;//0x0024
    const avr32_sau_parameter_t          PARAMETER ;
  };
  union {
    const unsigned long                  version   ;//0x0028
    const avr32_sau_version_t            VERSION   ;
  };
} avr32_sau_t;


typedef struct avr32_sau_hsb_ur_t {
    unsigned int                 :16;
    unsigned int key             : 8;
    unsigned int                 : 2;
    unsigned int channel         : 6;
} avr32_sau_hsb_ur_t;



typedef struct avr32_sau_hsb_t {
          unsigned long                  rtr       [AVR32_SAU_CHANNELS];//0x0000
#if AVR32_SAU_CHANNELS!=63  // To avoid errors in IAR
          unsigned long                        rtr_reserved[63-AVR32_SAU_CHANNELS]; //Padding
#endif
          unsigned int                   :32       ;//0x0040
          unsigned int                   :32       ;//0x0044
          unsigned int                   :32       ;//0x0048
          unsigned int                   :32       ;//0x004c
          unsigned int                   :32       ;//0x0050
          unsigned int                   :32       ;//0x0054
          unsigned int                   :32       ;//0x0058
          unsigned int                   :32       ;//0x005c
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
  union {
          unsigned long                  ur        ;//0x00fc
          avr32_sau_hsb_ur_t             UR        ;
  };
} avr32_sau_hsb_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_SAU_100_H_INCLUDED*/
#endif

