/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_SCIF_VREGCR_POR33STATUS_OFFSET                        19
#define AVR32_SCIF_VREGCR_POR33STATUS_SIZE                           1
#define AVR32_SCIF_VREGCR_RESETVALUE                        0x00000000
#define AVR32_SCIF_VREGCR_SELVDD                                     0
#define AVR32_SCIF_VREGCR_SELVDD_MASK                       0x00000007
#define AVR32_SCIF_VREGCR_SELVDD_OFFSET                              0
#define AVR32_SCIF_VREGCR_SELVDD_SIZE                                3
#define AVR32_SCIF_VREGCR_SELVDD_VDD1V35                    0x00000000
#define AVR32_SCIF_VREGCR_SELVDD_VDD1V45                    0x00000001
#define AVR32_SCIF_VREGCR_SELVDD_VDD1V55                    0x00000002
#define AVR32_SCIF_VREGCR_SELVDD_VDD1V65                    0x00000003
#define AVR32_SCIF_VREGCR_SELVDD_VDD1V75                    0x00000004
#define AVR32_SCIF_VREGCR_SELVDD_VDD1V80                    0x00000005
#define AVR32_SCIF_VREGCR_SFV                                       31
#define AVR32_SCIF_VREGCR_SFV_MASK                          0x80000000
#define AVR32_SCIF_VREGCR_SFV_OFFSET                                31
#define AVR32_SCIF_VREGCR_SFV_SIZE                                   1
#define AVR32_SCIF_VREGCR_VREGOK                                     6
#define AVR32_SCIF_VREGCR_VREGOK_MASK                       0x00000040
#define AVR32_SCIF_VREGCR_VREGOK_OFFSET                              6
#define AVR32_SCIF_VREGCR_VREGOK_SIZE                                1
#define AVR32_SCIF_VREGIFBVERSION                           0x000003d8
#define AVR32_SCIF_VREGIFBVERSION_MASK                      0x000f0fff
#define AVR32_SCIF_VREGIFBVERSION_RESETVALUE                0x00000000
#define AVR32_SCIF_VREGIFBVERSION_VARIANT                           16
#define AVR32_SCIF_VREGIFBVERSION_VARIANT_MASK              0x000f0000
#define AVR32_SCIF_VREGIFBVERSION_VARIANT_OFFSET                    16
#define AVR32_SCIF_VREGIFBVERSION_VARIANT_SIZE                       4
#define AVR32_SCIF_VREGIFBVERSION_VERSION                            0
#define AVR32_SCIF_VREGIFBVERSION_VERSION_MASK              0x00000fff
#define AVR32_SCIF_VREGIFBVERSION_VERSION_OFFSET                     0
#define AVR32_SCIF_VREGIFBVERSION_VERSION_SIZE                      12
#define AVR32_SCIF_VREGOK_SIZE                                       1
#define AVR32_SCIF_VVERSION                                          0
#define AVR32_SCIF_VVERSION_MASK                            0x00000fff
#define AVR32_SCIF_VVERSION_OFFSET                                   0
#define AVR32_SCIF_VVERSION_SIZE                                    12

#define AVR32_BOD_OFF                                  0x00000000
#define AVR32_BOD_ON                                   0x00000001
#define AVR32_BOD_ON_NORESET                           0x00000002
#define AVR32_GC_DIV_CLOCK                             0x00000001
#define AVR32_GC_NO_DIV_CLOCK                          0x00000000



#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_scif_ier_t {
    unsigned int ae              : 1;
    unsigned int                 :14;
    unsigned int brifardy        : 1;
    unsigned int dfll0rcs        : 1;
    unsigned int dfll0rdy        : 1;
    unsigned int dfll0locklosta  : 1;
    unsigned int dfll0locklostf  : 1;
    unsigned int dfll0locklostc  : 1;
    unsigned int dfll0locka      : 1;
    unsigned int dfll0lockf      : 1;
    unsigned int dfll0lockc      : 1;
    unsigned int boddet          : 1;
    unsigned int sm33det         : 1;
    unsigned int vregok          : 1;
    unsigned int                 : 3;
    unsigned int osc0rdy         : 1;
    unsigned int osc32rdy        : 1;
} avr32_scif_ier_t;



typedef struct avr32_scif_idr_t {
    unsigned int ae              : 1;
    unsigned int                 :14;
    unsigned int brifardy        : 1;
    unsigned int dfll0rcs        : 1;
    unsigned int dfll0rdy        : 1;
    unsigned int dfll0locklosta  : 1;
    unsigned int dfll0locklostf  : 1;
    unsigned int dfll0locklostc  : 1;
    unsigned int dfll0locka      : 1;
    unsigned int dfll0lockf      : 1;
    unsigned int dfll0lockc      : 1;
    unsigned int boddet          : 1;
    unsigned int sm33det         : 1;
    unsigned int vregok          : 1;
    unsigned int                 : 3;
    unsigned int osc0rdy         : 1;
    unsigned int osc32rdy        : 1;
} avr32_scif_idr_t;



typedef struct avr32_scif_imr_t {
    unsigned int ae              : 1;
    unsigned int                 :14;
    unsigned int brifardy        : 1;
    unsigned int dfll0rcs        : 1;
    unsigned int dfll0rdy        : 1;
    unsigned int dfll0locklosta  : 1;
    unsigned int dfll0locklostf  : 1;
    unsigned int dfll0locklostc  : 1;
    unsigned int dfll0locka      : 1;
    unsigned int dfll0lockf      : 1;
    unsigned int dfll0lockc      : 1;
    unsigned int boddet          : 1;
    unsigned int sm33det         : 1;
    unsigned int vregok          : 1;
    unsigned int                 : 3;
    unsigned int osc0rdy         : 1;
    unsigned int osc32rdy        : 1;
} avr32_scif_imr_t;



typedef struct avr32_scif_isr_t {
    unsigned int ae              : 1;
    unsigned int                 :14;
    unsigned int brifardy        : 1;
    unsigned int dfll0rcs        : 1;
    unsigned int dfll0rdy        : 1;
    unsigned int dfll0locklosta  : 1;
    unsigned int dfll0locklostf  : 1;
    unsigned int dfll0locklostc  : 1;
    unsigned int dfll0locka      : 1;
    unsigned int dfll0lockf      : 1;
    unsigned int dfll0lockc      : 1;
    unsigned int boddet          : 1;
    unsigned int sm33det         : 1;
    unsigned int vregok          : 1;
    unsigned int                 : 3;
    unsigned int osc0rdy         : 1;
    unsigned int osc32rdy        : 1;
} avr32_scif_isr_t;



typedef struct avr32_scif_icr_t {
    unsigned int ae              : 1;
    unsigned int                 :14;
    unsigned int brifardy        : 1;
    unsigned int dfll0rcs        : 1;
    unsigned int dfll0rdy        : 1;
    unsigned int dfll0locklosta  : 1;
    unsigned int dfll0locklostf  : 1;
    unsigned int dfll0locklostc  : 1;
    unsigned int dfll0locka      : 1;
    unsigned int dfll0lockf      : 1;
    unsigned int dfll0lockc      : 1;
    unsigned int boddet          : 1;
    unsigned int sm33det         : 1;
    unsigned int vregok          : 1;
    unsigned int                 : 3;
    unsigned int osc0rdy         : 1;
    unsigned int osc32rdy        : 1;
} avr32_scif_icr_t;



typedef struct avr32_scif_pclksr_t {
    unsigned int                 : 1;
    unsigned int brifavalid      : 1;
    unsigned int                 :13;
    unsigned int brifardy        : 1;
    unsigned int dfll0rcs        : 1;
    unsigned int dfll0rdy        : 1;
    unsigned int dfll0locklosta  : 1;
    unsigned int dfll0locklostf  : 1;
    unsigned int dfll0locklostc  : 1;
    unsigned int dfll0locka      : 1;
    unsigned int dfll0lockf      : 1;
    unsigned int dfll0lockc      : 1;
    unsigned int boddet          : 1;
    unsigned int sm33det         : 1;
    unsigned int vregok          : 1;
    unsigned int                 : 3;
    unsigned int osc0rdy         : 1;
    unsigned int osc32rdy        : 1;
} avr32_scif_pclksr_t;



typedef struct avr32_scif_unlock_t {
    unsigned int key             : 8;
    unsigned int                 :14;
    unsigned int addr            :10;
} avr32_scif_unlock_t;



typedef struct avr32_scif_oscctrl0_t {
    unsigned int                 :15;
    unsigned int oscen           : 1;
    unsigned int                 : 5;
    unsigned int startup         : 3;
    unsigned int                 : 4;
    unsigned int agc             : 1;
    unsigned int gain            : 2;
    unsigned int mode            : 1;
} avr32_scif_oscctrl0_t;



typedef struct avr32_scif_oscctrl32_t {
    unsigned int testmode        : 1;
    unsigned int                 :12;
    unsigned int startup         : 3;
    unsigned int                 : 5;
    unsigned int mode            : 3;
    unsigned int                 : 4;
    unsigned int en1k            : 1;
    unsigned int en32k           : 1;
    unsigned int pinsel          : 1;
    unsigned int osc32en         : 1;
} avr32_scif_oscctrl32_t;



typedef struct avr32_scif_dfll0conf_t {
    unsigned int coarse          : 8;
    unsigned int                 : 7;
    unsigned int fine            : 9;
    unsigned int                 : 5;
    unsigned int dither          : 1;
    unsigned int mode            : 1;
    unsigned int en              : 1;
} avr32_scif_dfll0conf_t;



typedef struct avr32_scif_dfll0step_t {
    unsigned int                 : 7;
    unsigned int fstep           : 9;
    unsigned int                 : 8;
    unsigned int cstep           : 8;
} avr32_scif_dfll0step_t;



typedef struct avr32_scif_dfll0ssg_t {
    unsigned int                 :11;
    unsigned int stepsize        : 5;
    unsigned int                 : 3;
    unsigned int amplitude       : 5;
    unsigned int                 : 6;
    unsigned int prbs            : 1;
    unsigned int en              : 1;
} avr32_scif_dfll0ssg_t;



typedef struct avr32_scif_dfll0ratio_t {
    unsigned int ratiodiff       :16;
    unsigned int                 :11;
    unsigned int numref          : 5;
} avr32_scif_dfll0ratio_t;



typedef struct avr32_scif_dfll0sync_t {
    unsigned int                 :31;
    unsigned int sync            : 1;
} avr32_scif_dfll0sync_t;



typedef struct avr32_scif_bod_t {
    unsigned int sfv             : 1;
    unsigned int                 :14;
    unsigned int fcd             : 1;
    unsigned int                 : 6;
    unsigned int ctrl            : 2;
    unsigned int                 : 1;
    unsigned int hyst            : 1;
    unsigned int level           : 6;
} avr32_scif_bod_t;



typedef struct avr32_scif_bgcr_t {
    unsigned int sfv             : 1;
    unsigned int                 :14;
    unsigned int fcd             : 1;
    unsigned int                 :13;
    unsigned int calib           : 3;
} avr32_scif_bgcr_t;



typedef struct avr32_scif_vregcr_t {
    unsigned int sfv             : 1;
    unsigned int intpd           : 1;
    unsigned int                 : 9;
    unsigned int por33mask       : 1;
    unsigned int por33status     : 1;
    unsigned int por33en         : 1;
    unsigned int deepdis         : 1;
    unsigned int fcd             : 1;
    unsigned int                 : 4;
    unsigned int calib           : 4;
    unsigned int on              : 1;
    unsigned int vregok          : 1;
    unsigned int en              : 1;
    unsigned int                 : 2;
    unsigned int selvdd          : 3;
} avr32_scif_vregcr_t;



typedef struct avr32_scif_rccr_t {
    unsigned int                 :15;
    unsigned int fcd             : 1;
    unsigned int                 : 6;
    unsigned int calib           :10;
} avr32_scif_rccr_t;



typedef struct avr32_scif_sm33_t {
    unsigned int                 : 4;
    unsigned int sampfreq        : 4;
    unsigned int                 : 5;
    unsigned int onsm            : 1;
    unsigned int sfv             : 1;
    unsigned int fcd             : 1;
    unsigned int                 : 4;
    unsigned int calib           : 4;
    unsigned int fs              : 1;
    unsigned int                 : 3;
    unsigned int ctrl            : 4;
} avr32_scif_sm33_t;



typedef struct avr32_scif_tsens_t {
    unsigned int                 :31;
    unsigned int en              : 1;
} avr32_scif_tsens_t;



typedef struct avr32_scif_stilo_t {
    unsigned int sfv             : 1;
    unsigned int                 : 1;
    unsigned int ratio           :10;
    unsigned int                 : 3;
    unsigned int fcd             : 1;
    unsigned int sel             : 8;
    unsigned int                 : 3;
    unsigned int nolock          : 1;
    unsigned int lock            : 1;
    unsigned int tune_en         : 1;
    unsigned int                 : 1;
    unsigned int en              : 1;
} avr32_scif_stilo_t;



typedef struct avr32_scif_rc120mcr_t {
    unsigned int                 :31;
    unsigned int en              : 1;
} avr32_scif_rc120mcr_t;



typedef struct avr32_scif_rc32kcr_t {
    unsigned int                 :31;
    unsigned int en              : 1;
} avr32_scif_rc32kcr_t;



typedef struct avr32_scif_gcctrl_t {
    unsigned int                 : 8;
    unsigned int div             : 8;
    unsigned int                 : 4;
    unsigned int oscsel          : 4;
    unsigned int                 : 6;
    unsigned int diven           : 1;
    unsigned int cen             : 1;
} avr32_scif_gcctrl_t;



typedef struct avr32_scif_osc0version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_osc0version_t;



typedef struct avr32_scif_osc32version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_osc32version_t;



typedef struct avr32_scif_dfllifversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_dfllifversion_t;



typedef struct avr32_scif_bodifaversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_bodifaversion_t;



typedef struct avr32_scif_vregifbversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_vregifbversion_t;



typedef struct avr32_scif_rcoscifaversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_rcoscifaversion_t;



typedef struct avr32_scif_sm33ifaversion_t {
    unsigned int                 : 4;
    unsigned int variant         :12;
    unsigned int                 :12;
    unsigned int version         : 4;
} avr32_scif_sm33ifaversion_t;



typedef struct avr32_scif_tsensifaversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_tsensifaversion_t;



typedef struct avr32_scif_stiloversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_stiloversion_t;



typedef struct avr32_scif_rc120mifaversion_t {
    unsigned int                 : 2;
    unsigned int variant         :14;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_rc120mifaversion_t;



typedef struct avr32_scif_brifaversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_brifaversion_t;



typedef struct avr32_scif_rc32kifaversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int vversion        :12;
} avr32_scif_rc32kifaversion_t;



typedef struct avr32_scif_gclkversion_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_gclkversion_t;



typedef struct avr32_scif_version_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_scif_version_t;



typedef struct avr32_scif_t {
  union {
          unsigned long                  ier       ;//0x0000
          avr32_scif_ier_t               IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0004
          avr32_scif_idr_t               IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0008
    const avr32_scif_imr_t               IMR       ;
  };
  union {
    const unsigned long                  isr       ;//0x000c
    const avr32_scif_isr_t               ISR       ;
  };
  union {
          unsigned long                  icr       ;//0x0010
          avr32_scif_icr_t               ICR       ;
  };
  union {
    const unsigned long                  pclksr    ;//0x0014
    const avr32_scif_pclksr_t            PCLKSR    ;
  };
  union {
          unsigned long                  unlock    ;//0x0018
          avr32_scif_unlock_t            UNLOCK    ;
  };
  union {
          unsigned long                  oscctrl0  ;//0x001c
          avr32_scif_oscctrl0_t          OSCCTRL0  ;
  };
  union {
          unsigned long                  oscctrl32 ;//0x0020
          avr32_scif_oscctrl32_t         OSCCTRL32 ;
  };
  union {
          unsigned long                  dfll0conf ;//0x0024
          avr32_scif_dfll0conf_t         DFLL0CONF ;
  };
          unsigned long                  dfll0fmul ;//0x0028
  union {
          unsigned long                  dfll0step ;//0x002c
          avr32_scif_dfll0step_t         DFLL0STEP ;
  };
  union {
          unsigned long                  dfll0ssg  ;//0x0030
          avr32_scif_dfll0ssg_t          DFLL0SSG  ;
  };
  union {
    const unsigned long                  dfll0ratio;//0x0034
    const avr32_scif_dfll0ratio_t        DFLL0RATIO;
  };
  union {
          unsigned long                  dfll0sync ;//0x0038
          avr32_scif_dfll0sync_t         DFLL0SYNC ;
  };
  union {
          unsigned long                  bod       ;//0x003c
          avr32_scif_bod_t               BOD       ;
  };
  union {
          unsigned long                  bgcr      ;//0x0040
          avr32_scif_bgcr_t              BGCR      ;
  };
  union {
          unsigned long                  vregcr    ;//0x0044
          avr32_scif_vregcr_t            VREGCR    ;
  };
  union {
          unsigned long                  rccr      ;//0x0048
          avr32_scif_rccr_t              RCCR      ;
  };
  union {
          unsigned long                  sm33      ;//0x004c
          avr32_scif_sm33_t              SM33      ;
  };
  union {
          unsigned long                  tsens     ;//0x0050
          avr32_scif_tsens_t             TSENS     ;
  };
  union {
          unsigned long                  stilo     ;//0x0054
          avr32_scif_stilo_t             STILO     ;
  };
  union {
          unsigned long                  rc120mcr  ;//0x0058
          avr32_scif_rc120mcr_t          RC120MCR  ;
  };
          unsigned long                  br        [4];//0x005c
  union {
          unsigned long                  rc32kcr   ;//0x006c
          avr32_scif_rc32kcr_t           RC32KCR   ;
  };
  union {
          unsigned long                  gcctrl    [5];//0x0070
          avr32_scif_gcctrl_t            GCCTRL    [5];
  };
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
          unsigned int                   :32       ;//0x00fc
          unsigned int                   :32       ;//0x0100
          unsigned int                   :32       ;//0x0104
          unsigned int                   :32       ;//0x0108
          unsigned int                   :32       ;//0x010c
          unsigned int                   :32       ;//0x0110
          unsigned int                   :32       ;//0x0114
          unsigned int                   :32       ;//0x0118
          unsigned int                   :32       ;//0x011c
          unsigned int                   :32       ;//0x0120
          unsigned int                   :32       ;//0x0124
          unsigned int                   :32       ;//0x0128
          unsigned int                   :32       ;//0x012c
          unsigned int                   :32       ;//0x0130
          unsigned int                   :32       ;//0x0134
          unsigned int                   :32       ;//0x0138
          unsigned int                   :32       ;//0x013c
          unsigned int                   :32       ;//0x0140
          unsigned int                   :32       ;//0x0144
          unsigned int                   :32       ;//0x0148
          unsigned int                   :32       ;//0x014c
          unsigned int                   :32       ;//0x0150
          unsigned int                   :32       ;//0x0154
          unsigned int                   :32       ;//0x0158
          unsigned int                   :32       ;//0x015c
          unsigned int                   :32       ;//0x0160
          unsigned int                   :32       ;//0x0164
          unsigned int                   :32       ;//0x0168
          unsigned int                   :32       ;//0x016c
          unsigned int                   :32       ;//0x0170
          unsigned int                   :32       ;//0x0174
          unsigned int                   :32       ;//0x0178
          unsigned int                   :32       ;//0x017c
          unsigned int                   :32       ;//0x0180
          unsigned int                   :32       ;//0x0184
          unsigned int                   :32       ;//0x0188
          unsigned int                   :32       ;//0x018c
          unsigned int                   :32       ;//0x0190
          unsigned int                   :32       ;//0x0194
          unsigned int                   :32       ;//0x0198
          unsigned int                   :32       ;//0x019c
          unsigned int                   :32       ;//0x01a0
          unsigned int                   :32       ;//0x01a4
          unsigned int                   :32       ;//0x01a8
          unsigned int                   :32       ;//0x01ac
          unsigned int                   :32       ;//0x01b0
          unsigned int                   :32       ;//0x01b4
          unsigned int                   :32       ;//0x01b8
          unsigned int                   :32       ;//0x01bc
          unsigned int                   :32       ;//0x01c0
          unsigned int                   :32       ;//0x01c4
          unsigned int                   :32       ;//0x01c8
          unsigned int                   :32       ;//0x01cc
          unsigned int                   :32       ;//0x01d0
          unsigned int                   :32       ;//0x01d4
          unsigned int                   :32       ;//0x01d8
          unsigned int                   :32       ;//0x01dc
          unsigned int                   :32       ;//0x01e0
          unsigned int                   :32       ;//0x01e4
          unsigned int                   :32       ;//0x01e8
          unsigned int                   :32       ;//0x01ec
          unsigned int                   :32       ;//0x01f0
          unsigned int                   :32       ;//0x01f4
          unsigned int                   :32       ;//0x01f8
          unsigned int                   :32       ;//0x01fc
          unsigned int                   :32       ;//0x0200
          unsigned int                   :32       ;//0x0204
          unsigned int                   :32       ;//0x0208
          unsigned int                   :32       ;//0x020c
          unsigned int                   :32       ;//0x0210
          unsigned int                   :32       ;//0x0214
          unsigned int                   :32       ;//0x0218
          unsigned int                   :32       ;//0x021c
          unsigned int                   :32       ;//0x0220
          unsigned int                   :32       ;//0x0224
          unsigned int                   :32       ;//0x0228
          unsigned int                   :32       ;//0x022c
          unsigned int                   :32       ;//0x0230
          unsigned int                   :32       ;//0x0234
          unsigned int                   :32       ;//0x0238
          unsigned int                   :32       ;//0x023c
          unsigned int                   :32       ;//0x0240
          unsigned int                   :32       ;//0x0244
          unsigned int                   :32       ;//0x0248
          unsigned int                   :32       ;//0x024c
          unsigned int                   :32       ;//0x0250
          unsigned int                   :32       ;//0x0254
          unsigned int                   :32       ;//0x0258
          unsigned int                   :32       ;//0x025c
          unsigned int                   :32       ;//0x0260
          unsigned int                   :32       ;//0x0264
          unsigned int                   :32       ;//0x0268
          unsigned int                   :32       ;//0x026c
          unsigned int                   :32       ;//0x0270
          unsigned int                   :32       ;//0x0274
          unsigned int                   :32       ;//0x0278
          unsigned int                   :32       ;//0x027c
          unsigned int                   :32       ;//0x0280
          unsigned int                   :32       ;//0x0284
          unsigned int                   :32       ;//0x0288
          unsigned int                   :32       ;//0x028c
          unsigned int                   :32       ;//0x0290
          unsigned int                   :32       ;//0x0294
          unsigned int                   :32       ;//0x0298
          unsigned int                   :32       ;//0x029c
          unsigned int                   :32       ;//0x02a0
          unsigned int                   :32       ;//0x02a4
          unsigned int                   :32       ;//0x02a8
          unsigned int                   :32       ;//0x02ac
          unsigned int                   :32       ;//0x02b0
          unsigned int                   :32       ;//0x02b4
          unsigned int                   :32       ;//0x02b8
          unsigned int                   :32       ;//0x02bc
          unsigned int                   :32       ;//0x02c0
          unsigned int                   :32       ;//0x02c4
          unsigned int                   :32       ;//0x02c8
          unsigned int                   :32       ;//0x02cc
          unsigned int                   :32       ;//0x02d0
          unsigned int                   :32       ;//0x02d4
          unsigned int                   :32       ;//0x02d8
          unsigned int                   :32       ;//0x02dc
          unsigned int                   :32       ;//0x02e0
          unsigned int                   :32       ;//0x02e4
          unsigned int                   :32       ;//0x02e8
          unsigned int                   :32       ;//0x02ec
          unsigned int                   :32       ;//0x02f0
          unsigned int                   :32       ;//0x02f4
          unsigned int                   :32       ;//0x02f8
          unsigned int                   :32       ;//0x02fc
          unsigned int                   :32       ;//0x0300
          unsigned int                   :32       ;//0x0304
          unsigned int                   :32       ;//0x0308
          unsigned int                   :32       ;//0x030c
          unsigned int                   :32       ;//0x0310
          unsigned int                   :32       ;//0x0314
          unsigned int                   :32       ;//0x0318
          unsigned int                   :32       ;//0x031c
          unsigned int                   :32       ;//0x0320
          unsigned int                   :32       ;//0x0324
          unsigned int                   :32       ;//0x0328
          unsigned int                   :32       ;//0x032c
          unsigned int                   :32       ;//0x0330
          unsigned int                   :32       ;//0x0334
          unsigned int                   :32       ;//0x0338
          unsigned int                   :32       ;//0x033c
          unsigned int                   :32       ;//0x0340
          unsigned int                   :32       ;//0x0344
          unsigned int                   :32       ;//0x0348
          unsigned int                   :32       ;//0x034c
          unsigned int                   :32       ;//0x0350
          unsigned int                   :32       ;//0x0354
          unsigned int                   :32       ;//0x0358
          unsigned int                   :32       ;//0x035c
          unsigned int                   :32       ;//0x0360
          unsigned int                   :32       ;//0x0364
          unsigned int                   :32       ;//0x0368
          unsigned int                   :32       ;//0x036c
          unsigned int                   :32       ;//0x0370
          unsigned int                   :32       ;//0x0374
          unsigned int                   :32       ;//0x0378
          unsigned int                   :32       ;//0x037c
          unsigned int                   :32       ;//0x0380
          unsigned int                   :32       ;//0x0384
          unsigned int                   :32       ;//0x0388
          unsigned int                   :32       ;//0x038c
          unsigned int                   :32       ;//0x0390
          unsigned int                   :32       ;//0x0394
          unsigned int                   :32       ;//0x0398
          unsigned int                   :32       ;//0x039c
          unsigned int                   :32       ;//0x03a0
          unsigned int                   :32       ;//0x03a4
          unsigned int                   :32       ;//0x03a8
          unsigned int                   :32       ;//0x03ac
          unsigned int                   :32       ;//0x03b0
          unsigned int                   :32       ;//0x03b4
          unsigned int                   :32       ;//0x03b8
          unsigned int                   :32       ;//0x03bc
          unsigned int                   :32       ;//0x03c0
          unsigned int                   :32       ;//0x03c4
  union {
    const unsigned long                  osc0version;//0x03c8
    const avr32_scif_osc0version_t       OSC0VERSION;
  };
  union {
    const unsigned long                  osc32version;//0x03cc
    const avr32_scif_osc32version_t      OSC32VERSION;
  };
  union {
    const unsigned long                  dfllifversion;//0x03d0
    const avr32_scif_dfllifversion_t     DFLLIFVERSION;
  };
  union {
    const unsigned long                  bodifaversion;//0x03d4
    const avr32_scif_bodifaversion_t     BODIFAVERSION;
  };
  union {
    const unsigned long                  vregifbversion;//0x03d8
    const avr32_scif_vregifbversion_t    VREGIFBVERSION;
  };
  union {
    const unsigned long                  rcoscifaversion;//0x03dc
    const avr32_scif_rcoscifaversion_t   RCOSCIFAVERSION;
  };
  union {
    const unsigned long                  sm33ifaversion;//0x03e0
    const avr32_scif_sm33ifaversion_t    SM33IFAVERSION;
  };
  union {
    const unsigned long                  tsensifaversion;//0x03e4
    const avr32_scif_tsensifaversion_t   TSENSIFAVERSION;
  };
  union {
    const unsigned long                  stiloversion;//0x03e8
    const avr32_scif_stiloversion_t      STILOVERSION;
  };
  union {
    const unsigned long                  rc120mifaversion;//0x03ec
    const avr32_scif_rc120mifaversion_t  RC120MIFAVERSION;
  };
  union {
    const unsigned long                  brifaversion;//0x03f0
    const avr32_scif_brifaversion_t      BRIFAVERSION;
  };
  union {
    const unsigned long                  rc32kifaversion;//0x03f4
    const avr32_scif_rc32kifaversion_t   RC32KIFAVERSION;
  };
  union {
    const unsigned long                  gclkversion;//0x03f8
    const avr32_scif_gclkversion_t       GCLKVERSION;
  };
  union {
    const unsigned long                  version   ;//0x03fc
    const avr32_scif_version_t           VERSION   ;
  };
} avr32_scif_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_SCIF_102_H_INCLUDED*/
#endif

