/*****************************************************************************
 *
 * Copyright (C) 2009-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_TWIM_TLOWM_MASK                               0x0000ff00
#define AVR32_TWIM_TLOWM_OFFSET                                      8
#define AVR32_TWIM_TLOWM_SIZE                                        8
#define AVR32_TWIM_TLOWS                                             0
#define AVR32_TWIM_TLOWS_MASK                               0x000000ff
#define AVR32_TWIM_TLOWS_OFFSET                                      0
#define AVR32_TWIM_TLOWS_SIZE                                        8
#define AVR32_TWIM_TOUT                                             12
#define AVR32_TWIM_TOUT_MASK                                0x00001000
#define AVR32_TWIM_TOUT_OFFSET                                      12
#define AVR32_TWIM_TOUT_SIZE                                         1
#define AVR32_TWIM_TXDATA                                            0
#define AVR32_TWIM_TXDATA_MASK                              0x000000ff
#define AVR32_TWIM_TXDATA_OFFSET                                     0
#define AVR32_TWIM_TXDATA_SIZE                                       8
#define AVR32_TWIM_TXRDY                                             1
#define AVR32_TWIM_TXRDY_MASK                               0x00000002
#define AVR32_TWIM_TXRDY_OFFSET                                      1
#define AVR32_TWIM_TXRDY_SIZE                                        1
#define AVR32_TWIM_VALID                                            15
#define AVR32_TWIM_VALID_MASK                               0x00008000
#define AVR32_TWIM_VALID_OFFSET                                     15
#define AVR32_TWIM_VALID_SIZE                                        1
#define AVR32_TWIM_VARIANT                                          16
#define AVR32_TWIM_VARIANT_MASK                             0x000f0000
#define AVR32_TWIM_VARIANT_OFFSET                                   16
#define AVR32_TWIM_VARIANT_SIZE                                      4
#define AVR32_TWIM_VERSION                                           0
#define AVR32_TWIM_VERSION_MASK                             0x00000fff
#define AVR32_TWIM_VERSION_OFFSET                                    0
#define AVR32_TWIM_VERSION_SIZE                                     12
#define AVR32_TWIM_VR                                       0x00000034
#define AVR32_TWIM_VR_MASK                                  0x000f0fff
#define AVR32_TWIM_VR_RESETVALUE                            0x00000000
#define AVR32_TWIM_VR_VARIANT                                       16
#define AVR32_TWIM_VR_VARIANT_MASK                          0x000f0000
#define AVR32_TWIM_VR_VARIANT_OFFSET                                16
#define AVR32_TWIM_VR_VARIANT_SIZE                                   4
#define AVR32_TWIM_VR_VERSION                                        0
#define AVR32_TWIM_VR_VERSION_MASK                          0x00000fff
#define AVR32_TWIM_VR_VERSION_OFFSET                                 0
#define AVR32_TWIM_VR_VERSION_SIZE                                  12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_twim_cr_t {
    unsigned int                 :23;
    unsigned int stop            : 1;
    unsigned int swrst           : 1;
    unsigned int                 : 1;
    unsigned int smdis           : 1;
    unsigned int smen            : 1;
    unsigned int                 : 2;
    unsigned int mdis            : 1;
    unsigned int men             : 1;
} avr32_twim_cr_t;



typedef struct avr32_twim_cwgr_t {
    unsigned int                 : 1;
    unsigned int exp             : 3;
    unsigned int data            : 4;
    unsigned int stasto          : 8;
    unsigned int high            : 8;
    unsigned int low             : 8;
} avr32_twim_cwgr_t;



typedef struct avr32_twim_smbtr_t {
    unsigned int exp             : 4;
    unsigned int                 : 4;
    unsigned int thmax           : 8;
    unsigned int tlowm           : 8;
    unsigned int tlows           : 8;
} avr32_twim_smbtr_t;



typedef struct avr32_twim_cmdr_t {
    unsigned int                 : 6;
    unsigned int acklast         : 1;
    unsigned int pecen           : 1;
    unsigned int nbytes          : 8;
    unsigned int valid           : 1;
    unsigned int stop            : 1;
    unsigned int start           : 1;
    unsigned int repsame         : 1;
    unsigned int tenbit          : 1;
    unsigned int sadr            :10;
    unsigned int read            : 1;
} avr32_twim_cmdr_t;



typedef struct avr32_twim_ncmdr_t {
    unsigned int                 : 6;
    unsigned int acklast         : 1;
    unsigned int pecen           : 1;
    unsigned int nbytes          : 8;
    unsigned int valid           : 1;
    unsigned int stop            : 1;
    unsigned int start           : 1;
    unsigned int repsame         : 1;
    unsigned int tenbit          : 1;
    unsigned int sadr            :10;
    unsigned int read            : 1;
} avr32_twim_ncmdr_t;



typedef struct avr32_twim_rhr_t {
    unsigned int                 :24;
    unsigned int rxdata          : 8;
} avr32_twim_rhr_t;



typedef struct avr32_twim_thr_t {
    unsigned int                 :24;
    unsigned int txdata          : 8;
} avr32_twim_thr_t;



typedef struct avr32_twim_sr_t {
    unsigned int                 :15;
    unsigned int menb            : 1;
    unsigned int                 : 1;
    unsigned int stop            : 1;
    unsigned int pecerr          : 1;
    unsigned int tout            : 1;
    unsigned int smbalert        : 1;
    unsigned int arblst          : 1;
    unsigned int dnak            : 1;
    unsigned int anak            : 1;
    unsigned int                 : 3;
    unsigned int idle            : 1;
    unsigned int ccomp           : 1;
    unsigned int crdy            : 1;
    unsigned int txrdy           : 1;
    unsigned int rxrdy           : 1;
} avr32_twim_sr_t;



typedef struct avr32_twim_ier_t {
    unsigned int                 :17;
    unsigned int stop            : 1;
    unsigned int pecerr          : 1;
    unsigned int tout            : 1;
    unsigned int smbalert        : 1;
    unsigned int arblst          : 1;
    unsigned int dnak            : 1;
    unsigned int anak            : 1;
    unsigned int                 : 3;
    unsigned int idle            : 1;
    unsigned int ccomp           : 1;
    unsigned int crdy            : 1;
    unsigned int txrdy           : 1;
    unsigned int rxrdy           : 1;
} avr32_twim_ier_t;



typedef struct avr32_twim_idr_t {
    unsigned int                 :17;
    unsigned int stop            : 1;
    unsigned int pecerr          : 1;
    unsigned int tout            : 1;
    unsigned int smbalert        : 1;
    unsigned int arblst          : 1;
    unsigned int dnak            : 1;
    unsigned int anak            : 1;
    unsigned int                 : 3;
    unsigned int idle            : 1;
    unsigned int ccomp           : 1;
    unsigned int crdy            : 1;
    unsigned int txrdy           : 1;
    unsigned int rxrdy           : 1;
} avr32_twim_idr_t;



typedef struct avr32_twim_imr_t {
    unsigned int                 :17;
    unsigned int stop            : 1;
    unsigned int pecerr          : 1;
    unsigned int tout            : 1;
    unsigned int smbalert        : 1;
    unsigned int arblst          : 1;
    unsigned int dnak            : 1;
    unsigned int anak            : 1;
    unsigned int                 : 3;
    unsigned int idle            : 1;
    unsigned int ccomp           : 1;
    unsigned int crdy            : 1;
    unsigned int txrdy           : 1;
    unsigned int rxrdy           : 1;
} avr32_twim_imr_t;



typedef struct avr32_twim_scr_t {
    unsigned int                 :17;
    unsigned int stop            : 1;
    unsigned int pecerr          : 1;
    unsigned int tout            : 1;
    unsigned int smbalert        : 1;
    unsigned int arblst          : 1;
    unsigned int dnak            : 1;
    unsigned int anak            : 1;
    unsigned int                 : 4;
    unsigned int ccomp           : 1;
    unsigned int                 : 3;
} avr32_twim_scr_t;



typedef struct avr32_twim_vr_t {
    unsigned int                 :12;
    unsigned int variant         : 4;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_twim_vr_t;



typedef struct avr32_twim_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_twim_cr_t                CR        ;
  };
  union {
          unsigned long                  cwgr      ;//0x0004
          avr32_twim_cwgr_t              CWGR      ;
  };
  union {
          unsigned long                  smbtr     ;//0x0008
          avr32_twim_smbtr_t             SMBTR     ;
  };
  union {
          unsigned long                  cmdr      ;//0x000c
          avr32_twim_cmdr_t              CMDR      ;
  };
  union {
          unsigned long                  ncmdr     ;//0x0010
          avr32_twim_ncmdr_t             NCMDR     ;
  };
  union {
    const unsigned long                  rhr       ;//0x0014
    const avr32_twim_rhr_t               RHR       ;
  };
  union {
          unsigned long                  thr       ;//0x0018
          avr32_twim_thr_t               THR       ;
  };
  union {
    const unsigned long                  sr        ;//0x001c
    const avr32_twim_sr_t                SR        ;
  };
  union {
          unsigned long                  ier       ;//0x0020
          avr32_twim_ier_t               IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0024
          avr32_twim_idr_t               IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0028
    const avr32_twim_imr_t               IMR       ;
  };
  union {
          unsigned long                  scr       ;//0x002c
          avr32_twim_scr_t               SCR       ;
  };
    const unsigned long                  pr        ;//0x0030
  union {
    const unsigned long                  vr        ;//0x0034
    const avr32_twim_vr_t                VR        ;
  };
} avr32_twim_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_TWIM_101_H_INCLUDED*/
#endif

