/*****************************************************************************
 *
 * Copyright (C) 2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_TWIS_TR_EXP_SIZE                                       4
#define AVR32_TWIS_TR_MASK                                  0xf0ffffff
#define AVR32_TWIS_TR_RESETVALUE                            0x00000000
#define AVR32_TWIS_TR_SUDAT                                         16
#define AVR32_TWIS_TR_SUDAT_MASK                            0x00ff0000
#define AVR32_TWIS_TR_SUDAT_OFFSET                                  16
#define AVR32_TWIS_TR_SUDAT_SIZE                                     8
#define AVR32_TWIS_TR_TLOWS                                          0
#define AVR32_TWIS_TR_TLOWS_MASK                            0x000000ff
#define AVR32_TWIS_TR_TLOWS_OFFSET                                   0
#define AVR32_TWIS_TR_TLOWS_SIZE                                     8
#define AVR32_TWIS_TR_TTOUT                                          8
#define AVR32_TWIS_TR_TTOUT_MASK                            0x0000ff00
#define AVR32_TWIS_TR_TTOUT_OFFSET                                   8
#define AVR32_TWIS_TR_TTOUT_SIZE                                     8
#define AVR32_TWIS_TTOUT                                             8
#define AVR32_TWIS_TTOUT_MASK                               0x0000ff00
#define AVR32_TWIS_TTOUT_OFFSET                                      8
#define AVR32_TWIS_TTOUT_SIZE                                        8
#define AVR32_TWIS_TXDATA                                            0
#define AVR32_TWIS_TXDATA_MASK                              0x000000ff
#define AVR32_TWIS_TXDATA_OFFSET                                     0
#define AVR32_TWIS_TXDATA_SIZE                                       8
#define AVR32_TWIS_TXRDY                                             1
#define AVR32_TWIS_TXRDY_MASK                               0x00000002
#define AVR32_TWIS_TXRDY_OFFSET                                      1
#define AVR32_TWIS_TXRDY_SIZE                                        1
#define AVR32_TWIS_URUN                                              6
#define AVR32_TWIS_URUN_MASK                                0x00000040
#define AVR32_TWIS_URUN_OFFSET                                       6
#define AVR32_TWIS_URUN_SIZE                                         1
#define AVR32_TWIS_VERSION                                           0
#define AVR32_TWIS_VERSION_MASK                             0x00000fff
#define AVR32_TWIS_VERSION_OFFSET                                    0
#define AVR32_TWIS_VERSION_SIZE                                     12
#define AVR32_TWIS_VR                                       0x00000030
#define AVR32_TWIS_VR_MASK                                  0x00000fff
#define AVR32_TWIS_VR_RESETVALUE                            0x00000120
#define AVR32_TWIS_VR_VERSION                                        0
#define AVR32_TWIS_VR_VERSION_MASK                          0x00000fff
#define AVR32_TWIS_VR_VERSION_OFFSET                                 0
#define AVR32_TWIS_VR_VERSION_SIZE                                  12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_twis_cr_t {
    unsigned int                 : 5;
    unsigned int tenbit          : 1;
    unsigned int adr             :10;
    unsigned int sodr            : 1;
    unsigned int soam            : 1;
    unsigned int cup             : 1;
    unsigned int ack             : 1;
    unsigned int pecen           : 1;
    unsigned int smhh            : 1;
    unsigned int smda            : 1;
    unsigned int smbalert        : 1;
    unsigned int swrst           : 1;
    unsigned int                 : 2;
    unsigned int stren           : 1;
    unsigned int gcmatch         : 1;
    unsigned int smatch          : 1;
    unsigned int smen            : 1;
    unsigned int sen             : 1;
} avr32_twis_cr_t;



typedef struct avr32_twis_nbytes_t {
    unsigned int                 :24;
    unsigned int nbytes          : 8;
} avr32_twis_nbytes_t;



typedef struct avr32_twis_tr_t {
    unsigned int exp             : 4;
    unsigned int                 : 4;
    unsigned int sudat           : 8;
    unsigned int ttout           : 8;
    unsigned int tlows           : 8;
} avr32_twis_tr_t;



typedef struct avr32_twis_rhr_t {
    unsigned int                 :24;
    unsigned int rxdata          : 8;
} avr32_twis_rhr_t;



typedef struct avr32_twis_thr_t {
    unsigned int                 :24;
    unsigned int txdata          : 8;
} avr32_twis_thr_t;



typedef struct avr32_twis_pecr_t {
    unsigned int                 :24;
    unsigned int pec             : 8;
} avr32_twis_pecr_t;



typedef struct avr32_twis_sr_t {
    unsigned int                 : 8;
    unsigned int btf             : 1;
    unsigned int rep             : 1;
    unsigned int sto             : 1;
    unsigned int smbdam          : 1;
    unsigned int smbhhm          : 1;
    unsigned int smbalertm       : 1;
    unsigned int gcm             : 1;
    unsigned int sam             : 1;
    unsigned int                 : 1;
    unsigned int buserr          : 1;
    unsigned int smbpecerr       : 1;
    unsigned int smbtout         : 1;
    unsigned int                 : 3;
    unsigned int nak             : 1;
    unsigned int orun            : 1;
    unsigned int urun            : 1;
    unsigned int tra             : 1;
    unsigned int                 : 1;
    unsigned int tcomp           : 1;
    unsigned int sen             : 1;
    unsigned int txrdy           : 1;
    unsigned int rxrdy           : 1;
} avr32_twis_sr_t;



typedef struct avr32_twis_ier_t {
    unsigned int                 : 8;
    unsigned int btf             : 1;
    unsigned int rep             : 1;
    unsigned int sto             : 1;
    unsigned int smbdam          : 1;
    unsigned int smbhhm          : 1;
    unsigned int smbalertm       : 1;
    unsigned int gcm             : 1;
    unsigned int sam             : 1;
    unsigned int                 : 1;
    unsigned int buserr          : 1;
    unsigned int smbpecerr       : 1;
    unsigned int smbtout         : 1;
    unsigned int                 : 3;
    unsigned int nak             : 1;
    unsigned int orun            : 1;
    unsigned int urun            : 1;
    unsigned int                 : 2;
    unsigned int tcomp           : 1;
    unsigned int                 : 1;
    unsigned int txrdy           : 1;
    unsigned int rxrdy           : 1;
} avr32_twis_ier_t;



typedef struct avr32_twis_idr_t {
    unsigned int                 : 8;
    unsigned int btf             : 1;
    unsigned int rep             : 1;
    unsigned int sto             : 1;
    unsigned int smbdam          : 1;
    unsigned int smbhhm          : 1;
    unsigned int smbalertm       : 1;
    unsigned int gcm             : 1;
    unsigned int sam             : 1;
    unsigned int                 : 1;
    unsigned int buserr          : 1;
    unsigned int smbpecerr       : 1;
    unsigned int smbtout         : 1;
    unsigned int                 : 3;
    unsigned int nak             : 1;
    unsigned int orun            : 1;
    unsigned int urun            : 1;
    unsigned int                 : 2;
    unsigned int tcomp           : 1;
    unsigned int                 : 1;
    unsigned int txrdy           : 1;
    unsigned int rxrdy           : 1;
} avr32_twis_idr_t;



typedef struct avr32_twis_imr_t {
    unsigned int                 : 8;
    unsigned int btf             : 1;
    unsigned int rep             : 1;
    unsigned int sto             : 1;
    unsigned int smbdam          : 1;
    unsigned int smbhhm          : 1;
    unsigned int smbalertm       : 1;
    unsigned int gcm             : 1;
    unsigned int sam             : 1;
    unsigned int                 : 1;
    unsigned int buserr          : 1;
    unsigned int smbpecerr       : 1;
    unsigned int smbtout         : 1;
    unsigned int                 : 3;
    unsigned int nak             : 1;
    unsigned int orun            : 1;
    unsigned int urun            : 1;
    unsigned int                 : 2;
    unsigned int tcomp           : 1;
    unsigned int                 : 1;
    unsigned int txrdy           : 1;
    unsigned int rxrdy           : 1;
} avr32_twis_imr_t;



typedef struct avr32_twis_scr_t {
    unsigned int                 : 8;
    unsigned int btf             : 1;
    unsigned int rep             : 1;
    unsigned int sto             : 1;
    unsigned int smbdam          : 1;
    unsigned int smbhhm          : 1;
    unsigned int smbalertm       : 1;
    unsigned int gcm             : 1;
    unsigned int sam             : 1;
    unsigned int                 : 1;
    unsigned int buserr          : 1;
    unsigned int smbpecerr       : 1;
    unsigned int smbtout         : 1;
    unsigned int                 : 3;
    unsigned int nak             : 1;
    unsigned int orun            : 1;
    unsigned int urun            : 1;
    unsigned int                 : 2;
    unsigned int tcomp           : 1;
    unsigned int                 : 3;
} avr32_twis_scr_t;



typedef struct avr32_twis_vr_t {
    unsigned int                 :20;
    unsigned int version         :12;
} avr32_twis_vr_t;



typedef struct avr32_twis_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_twis_cr_t                CR        ;
  };
  union {
          unsigned long                  nbytes    ;//0x0004
          avr32_twis_nbytes_t            NBYTES    ;
  };
  union {
          unsigned long                  tr        ;//0x0008
          avr32_twis_tr_t                TR        ;
  };
  union {
    const unsigned long                  rhr       ;//0x000c
    const avr32_twis_rhr_t               RHR       ;
  };
  union {
          unsigned long                  thr       ;//0x0010
          avr32_twis_thr_t               THR       ;
  };
  union {
    const unsigned long                  pecr      ;//0x0014
    const avr32_twis_pecr_t              PECR      ;
  };
  union {
    const unsigned long                  sr        ;//0x0018
    const avr32_twis_sr_t                SR        ;
  };
  union {
          unsigned long                  ier       ;//0x001c
          avr32_twis_ier_t               IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0020
          avr32_twis_idr_t               IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x0024
    const avr32_twis_imr_t               IMR       ;
  };
  union {
          unsigned long                  scr       ;//0x0028
          avr32_twis_scr_t               SCR       ;
  };
    const unsigned long                  pr        ;//0x002c
  union {
    const unsigned long                  vr        ;//0x0030
    const avr32_twis_vr_t                VR        ;
  };
} avr32_twis_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_TWIS_120_H_INCLUDED*/
#endif

