/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_USBA_TST_PKT_OFFSET                                    4
#define AVR32_USBA_TST_PKT_SIZE                                      1
#define AVR32_USBA_TST_SPEED_CFG                                     0
#define AVR32_USBA_TST_SPEED_CFG_FORCE_FULL                 0x00000003
#define AVR32_USBA_TST_SPEED_CFG_FORCE_HIGH                 0x00000002
#define AVR32_USBA_TST_SPEED_CFG_MASK                       0x00000003
#define AVR32_USBA_TST_SPEED_CFG_NORMAL                     0x00000000
#define AVR32_USBA_TST_SPEED_CFG_OFFSET                              0
#define AVR32_USBA_TST_SPEED_CFG_SIZE                                2
#define AVR32_USBA_TST_TST_J                                         2
#define AVR32_USBA_TST_TST_J_MASK                           0x00000004
#define AVR32_USBA_TST_TST_J_OFFSET                                  2
#define AVR32_USBA_TST_TST_J_SIZE                                    1
#define AVR32_USBA_TST_TST_K                                         3
#define AVR32_USBA_TST_TST_K_MASK                           0x00000008
#define AVR32_USBA_TST_TST_K_OFFSET                                  3
#define AVR32_USBA_TST_TST_K_SIZE                                    1
#define AVR32_USBA_TST_TST_PKT                                       4
#define AVR32_USBA_TST_TST_PKT_MASK                         0x00000010
#define AVR32_USBA_TST_TST_PKT_OFFSET                                4
#define AVR32_USBA_TST_TST_PKT_SIZE                                  1
#define AVR32_USBA_TX_COMPLT                                        10
#define AVR32_USBA_TX_COMPLT_MASK                           0x00000400
#define AVR32_USBA_TX_COMPLT_OFFSET                                 10
#define AVR32_USBA_TX_COMPLT_SIZE                                    1
#define AVR32_USBA_TX_PK_RDY                                        11
#define AVR32_USBA_TX_PK_RDY_MASK                           0x00000800
#define AVR32_USBA_TX_PK_RDY_OFFSET                                 11
#define AVR32_USBA_TX_PK_RDY_SIZE                                    1
#define AVR32_USBA_UPSTR_RES                                         7
#define AVR32_USBA_UPSTR_RES_MASK                           0x00000080
#define AVR32_USBA_UPSTR_RES_OFFSET                                  7
#define AVR32_USBA_UPSTR_RES_SIZE                                    1
#define AVR32_USBA_VERSION_NUM                                       0
#define AVR32_USBA_VERSION_NUM_MASK                         0x0000ffff
#define AVR32_USBA_VERSION_NUM_OFFSET                                0
#define AVR32_USBA_VERSION_NUM_SIZE                                 16
#define AVR32_USBA_WAKE_UP                                           5
#define AVR32_USBA_WAKE_UP_MASK                             0x00000020
#define AVR32_USBA_WAKE_UP_OFFSET                                    5
#define AVR32_USBA_WAKE_UP_SIZE                                      1
#define AVR32_USBA_ZERO                                     0x00000000




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_usba_ctrl_t {
    unsigned int                 :21;
    unsigned int rewakeup        : 1;
    unsigned int detach          : 1;
    unsigned int en_usba         : 1;
    unsigned int faddr_en        : 1;
    unsigned int dev_addr        : 7;
} avr32_usba_ctrl_t;



typedef struct avr32_usba_fnum_t {
    unsigned int fnum_err        : 1;
    unsigned int                 :17;
    unsigned int frame_number    :11;
    unsigned int micro_frame_num : 3;
} avr32_usba_fnum_t;



typedef struct avr32_usba_ien_t {
    unsigned int                 : 1;
    unsigned int dma_int_6       : 1;
    unsigned int dma_int_5       : 1;
    unsigned int dma_int_4       : 1;
    unsigned int dma_int_3       : 1;
    unsigned int dma_int_2       : 1;
    unsigned int dma_int_1       : 1;
    unsigned int                 : 9;
    unsigned int ept_int_7       : 1;
    unsigned int ept_int_6       : 1;
    unsigned int ept_int_5       : 1;
    unsigned int ept_int_4       : 1;
    unsigned int ept_int_3       : 1;
    unsigned int ept_int_2       : 1;
    unsigned int ept_int_1       : 1;
    unsigned int ept_int_0       : 1;
    unsigned int upstr_res       : 1;
    unsigned int endofrsm        : 1;
    unsigned int wake_up         : 1;
    unsigned int endreset        : 1;
    unsigned int int_sof         : 1;
    unsigned int micro_sof       : 1;
    unsigned int det_suspd       : 1;
    unsigned int                 : 1;
} avr32_usba_ien_t;



typedef struct avr32_usba_intsta_t {
    unsigned int                 : 1;
    unsigned int dma_int_6       : 1;
    unsigned int dma_int_5       : 1;
    unsigned int dma_int_4       : 1;
    unsigned int dma_int_3       : 1;
    unsigned int dma_int_2       : 1;
    unsigned int dma_int_1       : 1;
    unsigned int                 : 9;
    unsigned int ept_int_7       : 1;
    unsigned int ept_int_6       : 1;
    unsigned int ept_int_5       : 1;
    unsigned int ept_int_4       : 1;
    unsigned int ept_int_3       : 1;
    unsigned int ept_int_2       : 1;
    unsigned int ept_int_1       : 1;
    unsigned int ept_int_0       : 1;
    unsigned int upstr_res       : 1;
    unsigned int endofrsm        : 1;
    unsigned int wake_up         : 1;
    unsigned int endreset        : 1;
    unsigned int int_sof         : 1;
    unsigned int micro_sof       : 1;
    unsigned int det_suspd       : 1;
    unsigned int speed           : 1;
} avr32_usba_intsta_t;



typedef struct avr32_usba_clrint_t {
    unsigned int                 :24;
    unsigned int upstr_res       : 1;
    unsigned int endofrsm        : 1;
    unsigned int wake_up         : 1;
    unsigned int endreset        : 1;
    unsigned int int_sof         : 1;
    unsigned int micro_sof       : 1;
    unsigned int det_suspd       : 1;
    unsigned int                 : 1;
} avr32_usba_clrint_t;



typedef struct avr32_usba_eptrst_t {
    unsigned int                 :24;
    unsigned int rst_ept_7       : 1;
    unsigned int rst_ept_6       : 1;
    unsigned int rst_ept_5       : 1;
    unsigned int rst_ept_4       : 1;
    unsigned int rst_ept_3       : 1;
    unsigned int rst_ept_2       : 1;
    unsigned int rst_ept_1       : 1;
    unsigned int rst_ept_0       : 1;
} avr32_usba_eptrst_t;



typedef struct avr32_usba_tstsofcnt_t {
    unsigned int                 :24;
    unsigned int sofctload       : 1;
    unsigned int sofcntmax       : 7;
} avr32_usba_tstsofcnt_t;



typedef struct avr32_usba_tstcnta_t {
    unsigned int                 :16;
    unsigned int cntaload        : 1;
    unsigned int                 : 1;
    unsigned int cntamax         :14;
} avr32_usba_tstcnta_t;



typedef struct avr32_usba_tstcntb_t {
    unsigned int                 :24;
    unsigned int cntbload        : 1;
    unsigned int                 : 1;
    unsigned int cntbmax         : 6;
} avr32_usba_tstcntb_t;



typedef struct avr32_usba_tstmodereg_t {
    unsigned int                 :26;
    unsigned int tstmode         : 6;
} avr32_usba_tstmodereg_t;



typedef struct avr32_usba_tst_t {
    unsigned int                 :26;
    unsigned int opmode2         : 1;
    unsigned int tst_pkt         : 1;
    unsigned int tst_k           : 1;
    unsigned int tst_j           : 1;
    unsigned int speed_cfg       : 2;
} avr32_usba_tst_t;



typedef struct avr32_usba_ipfeatures_t {
    unsigned int                 : 8;
    unsigned int iso_ept_7       : 1;
    unsigned int iso_ept_6       : 1;
    unsigned int iso_ept_5       : 1;
    unsigned int iso_ept_4       : 1;
    unsigned int iso_ept_3       : 1;
    unsigned int iso_ept_2       : 1;
    unsigned int iso_ept_1       : 1;
    unsigned int datab16_8       : 1;
    unsigned int bw_dpram        : 1;
    unsigned int fifo_max_size   : 3;
    unsigned int dma_fifo_word_depth : 4;
    unsigned int dma_b_siz       : 1;
    unsigned int dma_channel_nbr : 3;
    unsigned int ept_nbr_max     : 4;
} avr32_usba_ipfeatures_t;



typedef struct avr32_usba_ipversion_t {
    unsigned int                 :13;
    unsigned int metal_fix_num   : 3;
    unsigned int version_num     :16;
} avr32_usba_ipversion_t;



typedef struct avr32_usba_eptcfg_t {
    unsigned int ept_mapd        : 1;
    unsigned int                 :21;
    unsigned int nb_trans        : 2;
    unsigned int bk_number       : 2;
    unsigned int ept_type        : 2;
    unsigned int ept_dir         : 1;
    unsigned int ept_size        : 3;
} avr32_usba_eptcfg_t;



typedef union avr32_usba_eptctlenb_t {
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int nak_in          : 1;
    unsigned int stall_snt       : 1;
    unsigned int rx_setup        : 1;
    unsigned int tx_pk_rdy       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_enabl       : 1;
  } default_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_nbtra       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int err_trans       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_enabl       : 1;
  } isochronous_in_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_criso       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int err_trans       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_enabl       : 1;
  } isochronous_out_mode;
} avr32_usba_eptctlenb_t;



typedef union avr32_usba_eptctldis_t {
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int nak_in          : 1;
    unsigned int stall_snt       : 1;
    unsigned int rx_setup        : 1;
    unsigned int tx_pk_rdy       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_disabl      : 1;
  } default_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_nbtra       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int err_trans       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_disabl      : 1;
  } isochronous_in_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_criso       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int err_trans       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_disabl      : 1;
  } isochronous_out_mode;
} avr32_usba_eptctldis_t;



typedef union avr32_usba_eptctl_t {
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int nak_in          : 1;
    unsigned int stall_snt       : 1;
    unsigned int rx_setup        : 1;
    unsigned int tx_pk_rdy       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_enabl       : 1;
  } default_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_nbtra       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int err_trans       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_enabl       : 1;
  } isochronous_in_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int                 :12;
    unsigned int busy_bank       : 1;
    unsigned int                 : 2;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_criso       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int err_trans       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int mdata_rx        : 1;
    unsigned int datax_rx        : 1;
    unsigned int                 : 1;
    unsigned int nyet_dis        : 1;
    unsigned int intdis_dma      : 1;
    unsigned int                 : 1;
    unsigned int auto_valid      : 1;
    unsigned int ept_enabl       : 1;
  } isochronous_out_mode;
} avr32_usba_eptctl_t;



typedef struct avr32_usba_eptsetsta_t {
    unsigned int                 :20;
    unsigned int tx_pk_rdy       : 1;
    unsigned int                 : 1;
    unsigned int kill_bank       : 1;
    unsigned int                 : 3;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
} avr32_usba_eptsetsta_t;



typedef union avr32_usba_eptclrsta_t {
  struct {
    unsigned int                 :16;
    unsigned int nak_out         : 1;
    unsigned int nak_in          : 1;
    unsigned int stall_snt       : 1;
    unsigned int rx_setup        : 1;
    unsigned int                 : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int                 : 2;
    unsigned int togglesq        : 1;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
  } default_mode;
  struct {
    unsigned int                 :16;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_nbtra       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int                 : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int                 : 2;
    unsigned int togglesq        : 1;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
  } isochronous_mode;
} avr32_usba_eptclrsta_t;



typedef union avr32_usba_eptsta_t {
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int byte_count      :11;
    unsigned int busy_bank_sta   : 2;
    unsigned int control_dir     : 2;
    unsigned int nak_out         : 1;
    unsigned int nak_in          : 1;
    unsigned int stall_snt       : 1;
    unsigned int rx_setup        : 1;
    unsigned int tx_pk_rdy       : 1;
    unsigned int tx_complt       : 1;
    unsigned int kill_bank       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int togglesq_sta    : 2;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
  } control_in_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int byte_count      :11;
    unsigned int busy_bank_sta   : 2;
    unsigned int control_dir     : 2;
    unsigned int nak_out         : 1;
    unsigned int nak_in          : 1;
    unsigned int stall_snt       : 1;
    unsigned int rx_setup        : 1;
    unsigned int tx_pk_rdy       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int togglesq_sta    : 2;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
  } control_out_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int byte_count      :11;
    unsigned int busy_bank_sta   : 2;
    unsigned int current_bank    : 2;
    unsigned int nak_out         : 1;
    unsigned int nak_in          : 1;
    unsigned int stall_snt       : 1;
    unsigned int rx_setup        : 1;
    unsigned int tx_pk_rdy       : 1;
    unsigned int tx_complt       : 1;
    unsigned int kill_bank       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int togglesq_sta    : 2;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
  } default_in_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int byte_count      :11;
    unsigned int busy_bank_sta   : 2;
    unsigned int current_bank    : 2;
    unsigned int nak_out         : 1;
    unsigned int nak_in          : 1;
    unsigned int stall_snt       : 1;
    unsigned int rx_setup        : 1;
    unsigned int tx_pk_rdy       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int togglesq_sta    : 2;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
  } default_out_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int byte_count      :11;
    unsigned int busy_bank_sta   : 2;
    unsigned int current_bank    : 2;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_nbtra       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int err_trans       : 1;
    unsigned int tx_complt       : 1;
    unsigned int kill_bank       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int togglesq_sta    : 2;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
  } isochronous_in_mode;
  struct {
    unsigned int shrt_pckt       : 1;
    unsigned int byte_count      :11;
    unsigned int busy_bank_sta   : 2;
    unsigned int current_bank    : 2;
    unsigned int nak_out         : 1;
    unsigned int err_flush       : 1;
    unsigned int err_criso       : 1;
    unsigned int err_fl_iso      : 1;
    unsigned int err_trans       : 1;
    unsigned int tx_complt       : 1;
    unsigned int rx_bk_rdy       : 1;
    unsigned int err_ovflw       : 1;
    unsigned int togglesq_sta    : 2;
    unsigned int frcestall       : 1;
    unsigned int                 : 5;
  } isochronous_out_mode;
} avr32_usba_eptsta_t;



typedef struct avr32_usba_dmacontrol_t {
    unsigned int buff_length     :16;
    unsigned int                 : 8;
    unsigned int burst_lck       : 1;
    unsigned int desc_ld_it      : 1;
    unsigned int end_buffit      : 1;
    unsigned int end_tr_it       : 1;
    unsigned int end_b_en        : 1;
    unsigned int end_tr_en       : 1;
    unsigned int ldnxt_dsc       : 1;
    unsigned int chann_enb       : 1;
} avr32_usba_dmacontrol_t;



typedef struct avr32_usba_dmastatus_t {
    unsigned int buff_count      :16;
    unsigned int                 : 9;
    unsigned int desc_ldst       : 1;
    unsigned int end_bf_st       : 1;
    unsigned int end_tr_st       : 1;
    unsigned int                 : 2;
    unsigned int chann_act       : 1;
    unsigned int chann_enb       : 1;
} avr32_usba_dmastatus_t;


typedef struct avr32_usba_dma_t {
          unsigned long                  dmanxtdsc ;//0x0000
          unsigned long                  dmaaddress;//0x0004
  union {
          unsigned long                  dmacontrol;//0x0008
          avr32_usba_dmacontrol_t        DMACONTROL;
  };
  union {
          unsigned long                  dmastatus ;//0x000c
          avr32_usba_dmastatus_t         DMASTATUS ;
  };
} avr32_usba_dma_t;

typedef struct avr32_usba_endpoint_t {
  union {
          unsigned long                  eptcfg    ;//0x0000
          avr32_usba_eptcfg_t            EPTCFG    ;
  };
  union {
          unsigned long                  eptctlenb ;//0x0004
          avr32_usba_eptctlenb_t         EPTCTLENB ;
  };
  union {
          unsigned long                  eptctldis ;//0x0008
          avr32_usba_eptctldis_t         EPTCTLDIS ;
  };
  union {
    const unsigned long                  eptctl    ;//0x000c
    const avr32_usba_eptctl_t            EPTCTL    ;
  };
          unsigned int                   :32       ;//0x0010
  union {
          unsigned long                  eptsetsta ;//0x0014
          avr32_usba_eptsetsta_t         EPTSETSTA ;
  };
  union {
          unsigned long                  eptclrsta ;//0x0018
          avr32_usba_eptclrsta_t         EPTCLRSTA ;
  };
  union {
    const unsigned long                  eptsta    ;//0x001c
    const avr32_usba_eptsta_t            EPTSTA    ;
  };
} avr32_usba_endpoint_t;


typedef struct avr32_usba_t {
  union {
          unsigned long                  ctrl      ;//0x0000
          avr32_usba_ctrl_t              CTRL      ;
  };
  union {
    const unsigned long                  fnum      ;//0x0004
    const avr32_usba_fnum_t              FNUM      ;
  };
          unsigned int                   :32       ;//0x0008
          unsigned int                   :32       ;//0x000c
  union {
          unsigned long                  ien       ;//0x0010
          avr32_usba_ien_t               IEN       ;
  };
  union {
    const unsigned long                  intsta    ;//0x0014
    const avr32_usba_intsta_t            INTSTA    ;
  };
  union {
          unsigned long                  clrint    ;//0x0018
          avr32_usba_clrint_t            CLRINT    ;
  };
  union {
          unsigned long                  eptrst    ;//0x001c
          avr32_usba_eptrst_t            EPTRST    ;
  };
          unsigned int                   :32       ;//0x0020
          unsigned int                   :32       ;//0x0024
          unsigned int                   :32       ;//0x0028
          unsigned int                   :32       ;//0x002c
          unsigned int                   :32       ;//0x0030
          unsigned int                   :32       ;//0x0034
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
          unsigned int                   :32       ;//0x0040
          unsigned int                   :32       ;//0x0044
          unsigned int                   :32       ;//0x0048
          unsigned int                   :32       ;//0x004c
          unsigned int                   :32       ;//0x0050
          unsigned int                   :32       ;//0x0054
          unsigned int                   :32       ;//0x0058
          unsigned int                   :32       ;//0x005c
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
  union {
          unsigned long                  tstsofcnt ;//0x00d0
          avr32_usba_tstsofcnt_t         TSTSOFCNT ;
  };
  union {
          unsigned long                  tstcnta   ;//0x00d4
          avr32_usba_tstcnta_t           TSTCNTA   ;
  };
  union {
          unsigned long                  tstcntb   ;//0x00d8
          avr32_usba_tstcntb_t           TSTCNTB   ;
  };
  union {
          unsigned long                  tstmodereg;//0x00dc
          avr32_usba_tstmodereg_t        TSTMODEREG;
  };
  union {
          unsigned long                  tst       ;//0x00e0
          avr32_usba_tst_t               TST       ;
  };
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
    const unsigned long                  ippaddrsize;//0x00ec
    const unsigned long                  ipname1   ;//0x00f0
    const unsigned long                  ipname2   ;//0x00f4
  union {
    const unsigned long                  ipfeatures;//0x00f8
    const avr32_usba_ipfeatures_t        IPFEATURES;
  };
  union {
    const unsigned long                  ipversion ;//0x00fc
    const avr32_usba_ipversion_t         IPVERSION ;
  };
  avr32_usba_endpoint_t endpoint[16];//0x100
          unsigned int                   :32       ;//0x0300
          unsigned int                   :32       ;//0x0304
          unsigned int                   :32       ;//0x0308
          unsigned int                   :32       ;//0x030c
  avr32_usba_dma_t dma[7];//0x310
} avr32_usba_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_USBA_140_H_INCLUDED*/
#endif

