/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_USBH_USBSTS_PCD                                        2
#define AVR32_USBH_USBSTS_PCD_MASK                          0x00000004
#define AVR32_USBH_USBSTS_PCD_OFFSET                                 2
#define AVR32_USBH_USBSTS_PCD_SIZE                                   1
#define AVR32_USBH_USBSTS_PSS                                       14
#define AVR32_USBH_USBSTS_PSS_DISABLED                      0x00000000
#define AVR32_USBH_USBSTS_PSS_ENABLED                       0x00000001
#define AVR32_USBH_USBSTS_PSS_MASK                          0x00004000
#define AVR32_USBH_USBSTS_PSS_OFFSET                                14
#define AVR32_USBH_USBSTS_PSS_SIZE                                   1
#define AVR32_USBH_USBSTS_RECL                                      13
#define AVR32_USBH_USBSTS_RECL_MASK                         0x00002000
#define AVR32_USBH_USBSTS_RECL_OFFSET                               13
#define AVR32_USBH_USBSTS_RECL_SIZE                                  1
#define AVR32_USBH_USBSTS_USBERRINT                                  1
#define AVR32_USBH_USBSTS_USBERRINT_MASK                    0x00000002
#define AVR32_USBH_USBSTS_USBERRINT_OFFSET                           1
#define AVR32_USBH_USBSTS_USBERRINT_SIZE                             1
#define AVR32_USBH_USBSTS_USBINT                                     0
#define AVR32_USBH_USBSTS_USBINT_MASK                       0x00000001
#define AVR32_USBH_USBSTS_USBINT_OFFSET                              0
#define AVR32_USBH_USBSTS_USBINT_SIZE                                1
#define AVR32_USBH_USB_OPERATIONAL                          0x00000002
#define AVR32_USBH_USB_RESET                                0x00000000
#define AVR32_USBH_USB_RESUME                               0x00000001
#define AVR32_USBH_USB_SUSPEND                              0x00000003
#define AVR32_USBH_WDH                                               1
#define AVR32_USBH_WDH_MASK                                 0x00000002
#define AVR32_USBH_WDH_OFFSET                                        1
#define AVR32_USBH_WDH_SIZE                                          1
#define AVR32_USBH_WKCNNT_E                                         20
#define AVR32_USBH_WKCNNT_E_MASK                            0x00100000
#define AVR32_USBH_WKCNNT_E_OFFSET                                  20
#define AVR32_USBH_WKCNNT_E_SIZE                                     1
#define AVR32_USBH_WKDSCNNT_E                                       21
#define AVR32_USBH_WKDSCNNT_E_MASK                          0x00200000
#define AVR32_USBH_WKDSCNNT_E_OFFSET                                21
#define AVR32_USBH_WKDSCNNT_E_SIZE                                   1
#define AVR32_USBH_WKOC_E                                           22
#define AVR32_USBH_WKOC_E_MASK                              0x00400000
#define AVR32_USBH_WKOC_E_OFFSET                                    22
#define AVR32_USBH_WKOC_E_SIZE                                       1




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_usbh_hcrevision_t {
    unsigned int                 :24;
    unsigned int rev             : 8;
} avr32_usbh_hcrevision_t;



typedef struct avr32_usbh_hccontrol_t {
    unsigned int                 :21;
    unsigned int rwe             : 1;
    unsigned int rwc             : 1;
    unsigned int ir              : 1;
    unsigned int hcfs            : 2;
    unsigned int ble             : 1;
    unsigned int cle             : 1;
    unsigned int ie              : 1;
    unsigned int ple             : 1;
    unsigned int cbsr            : 2;
} avr32_usbh_hccontrol_t;



typedef struct avr32_usbh_hccommandstatus_t {
    unsigned int                 :14;
    unsigned int soc             : 2;
    unsigned int                 :12;
    unsigned int ocr             : 1;
    unsigned int blf             : 1;
    unsigned int clf             : 1;
    unsigned int hcr             : 1;
} avr32_usbh_hccommandstatus_t;



typedef struct avr32_usbh_hcinterruptstatus_t {
    unsigned int                 : 1;
    unsigned int oc              : 1;
    unsigned int                 :23;
    unsigned int rhsc            : 1;
    unsigned int fno             : 1;
    unsigned int ue              : 1;
    unsigned int rd              : 1;
    unsigned int sf              : 1;
    unsigned int wdh             : 1;
    unsigned int so              : 1;
} avr32_usbh_hcinterruptstatus_t;



typedef struct avr32_usbh_hcinterruptenable_t {
    unsigned int mie             : 1;
    unsigned int oc              : 1;
    unsigned int                 :23;
    unsigned int rhsc            : 1;
    unsigned int fno             : 1;
    unsigned int ue              : 1;
    unsigned int rd              : 1;
    unsigned int sf              : 1;
    unsigned int wdh             : 1;
    unsigned int so              : 1;
} avr32_usbh_hcinterruptenable_t;



typedef struct avr32_usbh_hcinterruptdisable_t {
    unsigned int mie             : 1;
    unsigned int oc              : 1;
    unsigned int                 :23;
    unsigned int rhsc            : 1;
    unsigned int fno             : 1;
    unsigned int ue              : 1;
    unsigned int rd              : 1;
    unsigned int sf              : 1;
    unsigned int wdh             : 1;
    unsigned int so              : 1;
} avr32_usbh_hcinterruptdisable_t;



typedef struct avr32_usbh_hchcca_t {
    unsigned int hcca            :24;
    unsigned int                 : 8;
} avr32_usbh_hchcca_t;



typedef struct avr32_usbh_hcperiodcurrented_t {
    unsigned int pced            :28;
    unsigned int                 : 4;
} avr32_usbh_hcperiodcurrented_t;



typedef struct avr32_usbh_hccontrolheaded_t {
    unsigned int ched            :28;
    unsigned int                 : 4;
} avr32_usbh_hccontrolheaded_t;



typedef struct avr32_usbh_hccontrolcurrented_t {
    unsigned int cced            :28;
    unsigned int                 : 4;
} avr32_usbh_hccontrolcurrented_t;



typedef struct avr32_usbh_hcbulkheaded_t {
    unsigned int bhed            :28;
    unsigned int                 : 4;
} avr32_usbh_hcbulkheaded_t;



typedef struct avr32_usbh_hcbulkcurrented_t {
    unsigned int bced            :28;
    unsigned int                 : 4;
} avr32_usbh_hcbulkcurrented_t;



typedef struct avr32_usbh_hcdonehead_t {
    unsigned int dh              :28;
    unsigned int                 : 4;
} avr32_usbh_hcdonehead_t;



typedef struct avr32_usbh_hcfminterval_t {
    unsigned int fit             : 1;
    unsigned int fsmps           :15;
    unsigned int                 : 2;
    unsigned int fi              :14;
} avr32_usbh_hcfminterval_t;



typedef struct avr32_usbh_hcfmremaining_t {
    unsigned int frt             : 1;
    unsigned int                 :18;
    unsigned int fr              :14;
} avr32_usbh_hcfmremaining_t;



typedef struct avr32_usbh_hcfmnumber_t {
    unsigned int                 :16;
    unsigned int fn              :16;
} avr32_usbh_hcfmnumber_t;



typedef struct avr32_usbh_hcperiodstart_t {
    unsigned int                 :18;
    unsigned int ps              :14;
} avr32_usbh_hcperiodstart_t;



typedef struct avr32_usbh_hclsthreshold_t {
    unsigned int                 :20;
    unsigned int lst             :12;
} avr32_usbh_hclsthreshold_t;



typedef struct avr32_usbh_hcrhdescriptora_t {
    unsigned int potpgt          : 8;
    unsigned int                 :11;
    unsigned int nocp            : 1;
    unsigned int ocpm            : 1;
    unsigned int dt              : 1;
    unsigned int nps             : 1;
    unsigned int psm             : 1;
    unsigned int ndp             : 8;
} avr32_usbh_hcrhdescriptora_t;



typedef struct avr32_usbh_hcrhdescriptorb_t {
    unsigned int ppcm            :16;
    unsigned int dr              :16;
} avr32_usbh_hcrhdescriptorb_t;



typedef struct avr32_usbh_hcrhstatus_t {
    unsigned int crwe            : 1;
    unsigned int                 :14;
    unsigned int ocic            : 1;
    unsigned int lpsc            : 1;
    unsigned int drwe            : 1;
    unsigned int                 :13;
    unsigned int oci             : 1;
    unsigned int lps             : 1;
} avr32_usbh_hcrhstatus_t;



typedef struct avr32_usbh_hcrhportstatus_t {
    unsigned int                 :11;
    unsigned int prsc            : 1;
    unsigned int ocic            : 1;
    unsigned int pssc            : 1;
    unsigned int pesc            : 1;
    unsigned int csc             : 1;
    unsigned int                 : 6;
    unsigned int lsda            : 1;
    unsigned int pps             : 1;
    unsigned int                 : 3;
    unsigned int prs             : 1;
    unsigned int poci            : 1;
    unsigned int pss             : 1;
    unsigned int pes             : 1;
    unsigned int ccs             : 1;
} avr32_usbh_hcrhportstatus_t;



typedef struct avr32_usbh_hccapbase_t {
    unsigned int hciversion      :16;
    unsigned int                 : 8;
    unsigned int caplength       : 8;
} avr32_usbh_hccapbase_t;



typedef struct avr32_usbh_hcsparams_t {
    unsigned int                 : 8;
    unsigned int dpn             : 4;
    unsigned int                 : 3;
    unsigned int p_indicator     : 1;
    unsigned int n_cc            : 4;
    unsigned int n_pcc           : 4;
    unsigned int prr             : 1;
    unsigned int                 : 2;
    unsigned int ppc             : 1;
    unsigned int n_ports         : 4;
} avr32_usbh_hcsparams_t;



typedef struct avr32_usbh_hccparams_t {
    unsigned int                 :16;
    unsigned int eecp            : 8;
    unsigned int ist             : 4;
    unsigned int                 : 1;
    unsigned int aspc            : 1;
    unsigned int pflf            : 1;
    unsigned int ac64            : 1;
} avr32_usbh_hccparams_t;



typedef struct avr32_usbh_usbcmd_t {
    unsigned int                 : 8;
    unsigned int itc             : 8;
    unsigned int                 : 4;
    unsigned int aspm_e          : 1;
    unsigned int                 : 1;
    unsigned int aspmc           : 2;
    unsigned int lhcreset        : 1;
    unsigned int iaad            : 1;
    unsigned int as_e            : 1;
    unsigned int ps_e            : 1;
    unsigned int fls             : 2;
    unsigned int hcreset         : 1;
    unsigned int rs              : 1;
} avr32_usbh_usbcmd_t;



typedef struct avr32_usbh_usbsts_t {
    unsigned int                 :16;
    unsigned int ass             : 1;
    unsigned int pss             : 1;
    unsigned int recl            : 1;
    unsigned int hchalted        : 1;
    unsigned int                 : 6;
    unsigned int iaa             : 1;
    unsigned int hse             : 1;
    unsigned int flr             : 1;
    unsigned int pcd             : 1;
    unsigned int usberrint       : 1;
    unsigned int usbint          : 1;
} avr32_usbh_usbsts_t;



typedef struct avr32_usbh_usbintr_t {
    unsigned int                 :26;
    unsigned int iaa_e           : 1;
    unsigned int hse_e           : 1;
    unsigned int flr_e           : 1;
    unsigned int pci_e           : 1;
    unsigned int usberrint_e     : 1;
    unsigned int usbint_e        : 1;
} avr32_usbh_usbintr_t;



typedef struct avr32_usbh_frindex_t {
    unsigned int                 :18;
    unsigned int fi              :14;
} avr32_usbh_frindex_t;



typedef struct avr32_usbh_periodiclistbase_t {
    unsigned int bal             :20;
    unsigned int                 :12;
} avr32_usbh_periodiclistbase_t;



typedef struct avr32_usbh_asynclistaddr_t {
    unsigned int lpl             :27;
    unsigned int                 : 5;
} avr32_usbh_asynclistaddr_t;



typedef struct avr32_usbh_configflag_t {
    unsigned int                 :31;
    unsigned int cf              : 1;
} avr32_usbh_configflag_t;



typedef struct avr32_usbh_portsc_t {
    unsigned int                 : 9;
    unsigned int wkoc_e          : 1;
    unsigned int wkdscnnt_e      : 1;
    unsigned int wkcnnt_e        : 1;
    unsigned int ptc             : 4;
    unsigned int pic             : 2;
    unsigned int po              : 1;
    unsigned int pp              : 1;
    unsigned int ls              : 2;
    unsigned int                 : 1;
    unsigned int preset          : 1;
    unsigned int suspend         : 1;
    unsigned int fpr             : 1;
    unsigned int occ             : 1;
    unsigned int oca             : 1;
    unsigned int pedc            : 1;
    unsigned int ped             : 1;
    unsigned int csc             : 1;
    unsigned int ccs             : 1;
} avr32_usbh_portsc_t;


typedef struct avr32_usbh_ohci_t {
  union {
    const unsigned long                  hcrevision;//0x0000
    const avr32_usbh_hcrevision_t        HCREVISION;
  };
  union {
          unsigned long                  hccontrol ;//0x0004
          avr32_usbh_hccontrol_t         HCCONTROL ;
  };
  union {
          unsigned long                  hccommandstatus;//0x0008
          avr32_usbh_hccommandstatus_t   HCCOMMANDSTATUS;
  };
  union {
          unsigned long                  hcinterruptstatus;//0x000c
          avr32_usbh_hcinterruptstatus_t HCINTERRUPTSTATUS;
  };
  union {
          unsigned long                  hcinterruptenable;//0x0010
          avr32_usbh_hcinterruptenable_t HCINTERRUPTENABLE;
  };
  union {
          unsigned long                  hcinterruptdisable;//0x0014
          avr32_usbh_hcinterruptdisable_t HCINTERRUPTDISABLE;
  };
  union {
          unsigned long                  hchcca    ;//0x0018
          avr32_usbh_hchcca_t            HCHCCA    ;
  };
  union {
    const unsigned long                  hcperiodcurrented;//0x001c
    const avr32_usbh_hcperiodcurrented_t HCPERIODCURRENTED;
  };
  union {
          unsigned long                  hccontrolheaded;//0x0020
          avr32_usbh_hccontrolheaded_t   HCCONTROLHEADED;
  };
  union {
          unsigned long                  hccontrolcurrented;//0x0024
          avr32_usbh_hccontrolcurrented_t HCCONTROLCURRENTED;
  };
  union {
          unsigned long                  hcbulkheaded;//0x0028
          avr32_usbh_hcbulkheaded_t      HCBULKHEADED;
  };
  union {
          unsigned long                  hcbulkcurrented;//0x002c
          avr32_usbh_hcbulkcurrented_t   HCBULKCURRENTED;
  };
  union {
    const unsigned long                  hcdonehead;//0x0030
    const avr32_usbh_hcdonehead_t        HCDONEHEAD;
  };
  union {
          unsigned long                  hcfminterval;//0x0034
          avr32_usbh_hcfminterval_t      HCFMINTERVAL;
  };
  union {
    const unsigned long                  hcfmremaining;//0x0038
    const avr32_usbh_hcfmremaining_t     HCFMREMAINING;
  };
  union {
    const unsigned long                  hcfmnumber;//0x003c
    const avr32_usbh_hcfmnumber_t        HCFMNUMBER;
  };
  union {
          unsigned long                  hcperiodstart;//0x0040
          avr32_usbh_hcperiodstart_t     HCPERIODSTART;
  };
  union {
          unsigned long                  hclsthreshold;//0x0044
          avr32_usbh_hclsthreshold_t     HCLSTHRESHOLD;
  };
  union {
          unsigned long                  hcrhdescriptora;//0x0048
          avr32_usbh_hcrhdescriptora_t   HCRHDESCRIPTORA;
  };
  union {
          unsigned long                  hcrhdescriptorb;//0x004c
          avr32_usbh_hcrhdescriptorb_t   HCRHDESCRIPTORB;
  };
  union {
          unsigned long                  hcrhstatus;//0x0050
          avr32_usbh_hcrhstatus_t        HCRHSTATUS;
  };
  union {
          unsigned long                  hcrhportstatus;//0x0054
          avr32_usbh_hcrhportstatus_t    HCRHPORTSTATUS;
  };
} avr32_usbh_ohci_t;


typedef struct avr32_usbh_ehci_t {
  union {
    const unsigned long                  hccapbase ;//0x0000
    const avr32_usbh_hccapbase_t         HCCAPBASE ;
  };
  union {
    const unsigned long                  hcsparams ;//0x0004
    const avr32_usbh_hcsparams_t         HCSPARAMS ;
  };
  union {
    const unsigned long                  hccparams ;//0x0008
    const avr32_usbh_hccparams_t         HCCPARAMS ;
  };
          unsigned int                   :32       ;//0x000c
  union {
          unsigned long                  usbcmd    ;//0x0010
          avr32_usbh_usbcmd_t            USBCMD    ;
  };
  union {
          unsigned long                  usbsts    ;//0x0014
          avr32_usbh_usbsts_t            USBSTS    ;
  };
  union {
          unsigned long                  usbintr   ;//0x0018
          avr32_usbh_usbintr_t           USBINTR   ;
  };
  union {
          unsigned long                  frindex   ;//0x001c
          avr32_usbh_frindex_t           FRINDEX   ;
  };
          unsigned long                  ctrldssegment;//0x0020
  union {
          unsigned long                  periodiclistbase;//0x0024
          avr32_usbh_periodiclistbase_t  PERIODICLISTBASE;
  };
  union {
          unsigned long                  asynclistaddr;//0x0028
          avr32_usbh_asynclistaddr_t     ASYNCLISTADDR;
  };
          unsigned int                   :32       ;//0x002c
          unsigned int                   :32       ;//0x0030
          unsigned int                   :32       ;//0x0034
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
          unsigned int                   :32       ;//0x0040
          unsigned int                   :32       ;//0x0044
          unsigned int                   :32       ;//0x0048
          unsigned int                   :32       ;//0x004c
  union {
          unsigned long                  configflag;//0x0050
          avr32_usbh_configflag_t        CONFIGFLAG;
  };
  union {
          unsigned long                  portsc    ;//0x0054
          avr32_usbh_portsc_t            PORTSC    ;
  };
} avr32_usbh_ehci_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_USBH_291A_H_INCLUDED*/
#endif

